bin/rmail/SCCS/s.rmail.8
h20222
s 00002/00002/00043
d D 6.10 93/04/29 23:31:18 bostic 12 11
c reference mail.local, not binmail
e
s 00008/00007/00037
d D 6.9 91/07/27 22:03:21 cael 11 10
c mdoc version three
e
s 00002/00002/00042
d D 6.8 91/04/20 16:07:13 bostic 10 9
c move from section 1 to section 8, typo
e
s 00002/00000/00042
d D 6.7 91/03/14 00:10:23 cael 9 7
c add .Vx so tmac.andoc will call tmac.mdoc-old
e
s 00001/00000/00042
d R 6.7 91/03/13 20:29:44 cael 8 7
c add .Vx so tmac.andoc will call tmac.mdoc-old
e
s 00000/00000/00042
d D 6.6 90/07/24 22:51:04 cael 7 6
c .Xr botch fix
e
s 00000/00000/00042
d D 6.5 90/06/24 19:12:32 cael 6 5
c converted man page
e
s 00031/00024/00011
d D 6.4 90/06/11 06:00:18 cael 5 4
c converted man page
e
s 00001/00011/00034
d D 6.3 90/05/31 20:38:45 bostic 4 3
c new copyright notice
e
s 00015/00006/00030
d D 6.2 88/11/20 17:00:54 bostic 3 2
c add Berkeley specific copyright notice
e
s 00001/00001/00035
d D 6.1 85/04/29 21:14:58 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00036/00000/00000
d D 5.1 85/04/29 21:14:48 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
D 3
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 3
I 3
D 5
.\" Copyright (c) 1983 The Regents of the University of California.
E 5
I 5
.\" Copyright (c) 1983, 1990 The Regents of the University of California.
E 5
.\" All rights reserved.
E 3
.\"
I 3
D 4
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 4
I 4
D 11
.\" %sccs.include.redist.man%
E 11
I 11
.\" %sccs.include.redist.roff%
E 11
E 4
.\"
E 3
D 5
.\"	%W% (Berkeley) %G%
E 5
I 5
D 11
.\"     %W% (Berkeley) %G%
E 11
I 11
.\"	%W% (Berkeley) %G%
E 11
E 5
.\"
I 9
D 11
.Vx
.Vx
E 11
E 9
D 2
.TH RMAIL 1 "2 April 1983"
E 2
I 2
D 5
.TH RMAIL 1 "%Q%"
E 2
.UC 5
.SH NAME
rmail \- handle remote mail received via uucp
.SH SYNOPSIS
.B rmail
user ...
.SH DESCRIPTION
.I Rmail
E 5
I 5
.Dd %Q%
D 10
.Dt RMAIL 1
E 10
I 10
.Dt RMAIL 8
E 10
.Os BSD 4.2
.Sh NAME
.Nm rmail
.Nd handle remote mail received via uucp
.Sh SYNOPSIS
.Nm rmail
.Ar user ...
.Sh DESCRIPTION
.Nm Rmail
E 5
interprets incoming mail received via
D 5
.IR uucp (1C),
E 5
I 5
.Xr uucp 1 ,
E 5
collapsing ``From'' lines in the form generated
D 5
by 
.IR binmail (1)
E 5
I 5
by
D 12
.Xr binmail  1
E 12
I 12
.Xr mail.local 8
E 12
E 5
into a single line of the form ``return-path!sender'',
and passing the processed mail on to
D 5
.IR sendmail (8).
.PP
.I Rmail
is explicitly designed for use with 
.I uucp
E 5
I 5
.Xr sendmail  8  .
.Pp
.Nm Rmail
is explicitly designed for use with
.Xr uucp
E 5
and
D 5
.IR sendmail .
.SH "SEE ALSO"
D 3
binmail(1),
uucp(1C),
sendmail(8)
E 3
I 3
binmail(1), uucp(1), sendmail(8)
E 3
.SH BUGS
.I Rmail
E 5
I 5
.Xr sendmail  .
.Sh SEE ALSO
D 12
.Xr binmail 1 ,
E 12
.Xr uucp 1 ,
I 12
.Xr mail.local 8 ,
E 12
.Xr sendmail 8
.Sh HISTORY
D 11
.Nm Rmail
D 10
aapeared in 4.2 BSD.
E 10
I 10
apeared in 4.2 BSD.
E 11
I 11
The
.Nm rmail
program appeared in
.Bx 4.2 .
E 11
E 10
.Sh BUGS
.Nm Rmail
E 5
D 11
should not reside in /bin.
E 11
I 11
should not reside in
.Pa /bin .
E 11
E 1
