libexec/rshd/SCCS/s.rshd.8
h38271
s 00002/00002/00181
d D 8.1 93/06/04 19:06:02 bostic 14 13
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00016/00003/00167
d D 6.12 92/07/15 11:55:31 andrew 13 12
c document -L, /etc/nologin behavior
e
s 00077/00077/00093
d D 6.11 91/04/20 11:08:30 cael 12 11
c -mdoc conversion
e
s 00001/00011/00169
d D 6.10 90/06/24 21:22:57 trent 11 10
c new copyright notice
e
s 00016/00007/00164
d D 6.9 89/09/11 21:41:18 karels 10 9
c add -a
e
s 00009/00003/00162
d D 6.8 89/01/23 12:15:52 bostic 9 8
c document -n flag
e
s 00003/00002/00162
d D 6.7 88/12/08 09:28:45 bostic 8 7
c forgot to mention superuser exception on -l flag
e
s 00012/00022/00152
d D 6.6 88/12/07 21:21:28 bostic 7 6
c document the -p flag; don't document ruserok(3), it's in rcmd(3)
e
s 00016/00006/00158
d D 6.5 88/09/19 21:58:42 bostic 6 5
c Berkeley copyright
e
s 00001/00001/00163
d D 6.4 87/10/25 12:10:15 bostic 5 4
c step 1 is really step 2
e
s 00012/00012/00152
d D 6.3 86/05/24 11:03:19 karels 4 3
c more updates
e
s 00015/00014/00149
d D 6.2 85/06/03 14:17:09 lepreau 3 2
c ordder of locuser and remuser were reversed; connection for
c error messages was ambiguous/wrong.
e
s 00001/00001/00162
d D 6.1 85/04/27 15:59:00 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00163/00000/00000
d D 5.1 85/04/27 15:58:52 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
f b 
t
T
I 1
D 6
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 6
I 6
D 10
.\" Copyright (c) 1983 The Regents of the University of California.
E 10
I 10
D 12
.\" Copyright (c) 1983, 1989 The Regents of the University of California.
E 12
I 12
D 14
.\" Copyright (c) 1983, 1989, 1991 The Regents of the University of California.
E 12
E 10
.\" All rights reserved.
E 14
I 14
.\" Copyright (c) 1983, 1989, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 14
E 6
.\"
I 6
D 11
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 11
I 11
.\" %sccs.include.redist.man%
E 11
.\"
E 6
D 12
.\"	%W% (Berkeley) %G%
E 12
I 12
.\"     %W% (Berkeley) %G%
E 12
.\"
D 2
.TH RSHD 8C "4 March 1983"
E 2
I 2
D 6
.TH RSHD 8C "%Q%"
E 6
I 6
D 12
.TH RSHD 8 "%Q%"
E 6
E 2
.UC 5
.SH NAME
rshd \- remote shell server
.SH SYNOPSIS
D 7
.B /etc/rshd
E 7
I 7
D 8
.B rshd [-p]
E 8
I 8
D 9
.B rshd [-l]
E 9
I 9
D 10
.B rshd [-ln]
E 10
I 10
.B rshd [-aln]
E 10
E 9
E 8
E 7
.SH DESCRIPTION
.I Rshd
E 12
I 12
.Dd %Q%
.Dt RSHD 8
.Os BSD 4.2
.Sh NAME
.Nm rshd
.Nd remote shell server
.Sh SYNOPSIS
.Nm rshd
D 13
.Op Fl aln
E 13
I 13
.Op Fl alnL
E 13
.Sh DESCRIPTION
The
.Nm rshd
server
E 12
is the server for the 
D 7
.IR rcmd (3X)
E 7
I 7
D 12
.IR rcmd (3)
E 12
I 12
.Xr rcmd 3
E 12
E 7
routine and, consequently, for the
D 7
.IR rsh (1C)
E 7
I 7
D 12
.IR rsh (1)
E 12
I 12
.Xr rsh 1
E 12
E 7
program.  The server provides remote execution facilities
D 4
with authentication based on privileged port numbers.
E 4
I 4
with authentication based on privileged port numbers from trusted hosts.
E 4
D 12
.PP
.I Rshd
E 12
I 12
.Pp
The
.Nm rshd
server
E 12
listens for service requests at the port indicated in
the ``cmd'' service specification; see
D 12
.IR services (5).
E 12
I 12
.Xr services 5 .
E 12
When a service request is received the following protocol
is initiated:
D 12
.IP 1)
E 12
I 12
.Bl -enum
.It
E 12
The server checks the client's source port.
D 10
If the port is not in the range 0-1023, the server
E 10
I 10
If the port is not in the range 512-1023, the server
E 10
aborts the connection.
D 12
.IP 2)
E 12
I 12
.It
E 12
The server reads characters from the socket up
to a null (`\e0') byte.  The resultant string is
D 12
interpreted as an ASCII number, base 10.
.IP 3)
E 12
I 12
interpreted as an
.Tn ASCII
number, base 10.
.It
E 12
D 5
If the number received in step 1 is non-zero,
E 5
I 5
If the number received in step 2 is non-zero,
E 5
it is interpreted as the port number of a secondary
stream to be used for the 
D 12
.BR stderr .
E 12
I 12
.Em stderr .
E 12
A second connection is then created to the specified
port on the client's machine.  The source port of this
D 10
second connection is also in the range 0-1023.
E 10
I 10
second connection is also in the range 512-1023.
E 10
D 12
.IP 4)
E 12
I 12
.It
E 12
D 4
The server checks the client's source address.
If the address is associated with a host for which no
corresponding entry exists in the host name data base (see
.IR hosts (5)),
the server aborts the connection.
E 4
I 4
The server checks the client's source address
and requests the corresponding host name (see
D 9
.IR gethostbyaddr (3N),
E 9
I 9
D 12
.IR gethostbyaddr (3),
E 9
.IR hosts (5)
E 12
I 12
.Xr gethostbyaddr 3 ,
.Xr hosts 5
E 12
and
D 12
.IR named (8)).
E 12
I 12
.Xr named 8 ) .
E 12
If the hostname cannot be determined,
the dot-notation representation of the host address is used.
I 10
If the hostname is in the same domain as the server (according to
the last two components of the domain name),
or if the
D 12
.B \-a
E 12
I 12
.Fl a
E 12
option is given,
the addresses for the hostname are requested,
verifying that the name and address correspond.
If address verification fails, the connection is aborted
with the message, ``Host address mismatch.''
E 10
E 4
D 12
.IP 5)
E 12
I 12
.It
E 12
A null terminated user name of at most 16 characters
is retrieved on the initial socket.  This user name
D 3
is interpreted as a user identity to use on the
.BR server 's
E 3
I 3
is interpreted as the user identity on the
D 12
.BR client 's
E 12
I 12
.Em client Ns 's
E 12
E 3
machine.
D 12
.IP 6)
E 12
I 12
.It
E 12
A null terminated user name of at most 16 characters
is retrieved on the initial socket.  This user name
D 3
is interpreted as the user identity on the
.BR client 's
E 3
I 3
is interpreted as a user identity to use on the
D 12
.BR server 's
E 12
I 12
.Sy server Ns 's
E 12
E 3
machine.
D 12
.IP 7)
E 12
I 12
.It
E 12
A null terminated command to be passed to a
shell is retrieved on the initial socket.  The length of
the command is limited by the upper bound on the size of
the system's argument list.  
D 12
.IP 8)
.I Rshd
E 12
I 12
.It
.Nm Rshd
E 12
D 7
then validates the user according to the following steps.
D 4
The remote user name is looked up in the password file
E 4
I 4
The local (server-end) user name is looked up in the password file
E 4
and a
.I chdir
is performed to the user's home directory.  If either
the lookup or 
.I chdir
fail, the connection is terminated.
If the user is not the super-user, (user id 0), the file 
.I /etc/hosts.equiv
is consulted for a list of hosts considered ``equivalent''.
If the client's host name is present in this file, the
authentication is considered successful.  If the lookup
fails, or the user is the super-user, then the file
.I .rhosts
in the home directory of the remote user is checked for
the machine name and identity of the user on the client's
machine.  If this lookup fails, the connection is terminated.
E 7
I 7
then validates the user using
D 12
.IR ruserok (3),
which uses the file ``/etc/hosts.equiv'' and the ``.rhosts''
E 12
I 12
.Xr ruserok 3 ,
which uses the file
.Pa /etc/hosts.equiv
and the
.Pa .rhosts
E 12
file found in the user's home directory.  The
D 9
.I -p
E 9
I 9
D 10
.I -l
E 10
I 10
D 12
.B \-l
E 12
I 12
.Fl l
E 12
E 10
E 9
option prevents
D 12
.IR ruserok (3)
E 12
I 12
.Xr ruserok 3
E 12
D 8
from doing any validation based on the user's ``.rhosts'' file.
E 8
I 8
from doing any validation based on the user's ``.rhosts'' file,
unless the user is the superuser.
E 8
E 7
D 12
.IP 9)
E 12
I 12
.It
I 13
If the file 
.Pa /etc/nologin
exists and the user is not the superuser,
the connection is closed.
.It
E 13
E 12
D 3
A null byte is returned on the connection associated
with the
.B stderr 
E 3
I 3
A null byte is returned on the initial socket
E 3
and the command line is passed to the normal login
shell of the user.  The
shell inherits the network connections established
by
D 12
.IR rshd .
I 9
.PP
E 12
I 12
.Nm rshd .
I 13
.El
E 13
.Pp
E 12
Transport-level keepalive messages are enabled unless the
D 12
.B \-n
E 12
I 12
.Fl n
E 12
option is present.
The use of keepalive messages allows sessions to be timed out
if the client crashes or becomes unreachable.
E 9
D 12
.SH DIAGNOSTICS
E 12
I 12
D 13
.El
E 13
I 13
.Pp
The
.Fl L
option causes all successful accesses to be logged to
.Xr syslogd 8
as
.Li auth.info
messages.
E 13
.Sh DIAGNOSTICS
E 12
D 3
All diagnostic messages are returned on the connection
associated with the
.BR stderr ,
E 3
I 3
Except for the last one listed below,
all diagnostic messages
are returned on the initial socket,
E 3
after which any network connections are closed.
An error is indicated by a leading byte with a value of
D 13
1 (0 is returned in step 9 above upon successful completion
E 13
I 13
1 (0 is returned in step 10 above upon successful completion
E 13
D 3
of all the steps prior to the command execution).
E 3
I 3
of all the steps prior to the execution of the login shell).
E 3
D 12
.PP
.B ``locuser too long''
.br
E 12
I 12
.Bl -tag -width indent
.It Sy Locuser too long.
E 12
The name of the user on the client's machine is
longer than 16 characters.
D 12
.PP
.B ``remuser too long''
.br
E 12
I 12
.It Sy Ruser too long.
E 12
The name of the user on the remote machine is
longer than 16 characters.
D 12
.PP
.B ``command too long ''
.br
E 12
I 12
.It Sy Command too long  .
E 12
The command line passed exceeds the size of the argument
list (as configured into the system).
D 12
.PP
D 3
.B ``Hostname for your address unknown.''
E 3
I 3
D 4
.B ``Host name for your address unknown.''
E 3
.br
No entry in the host name database existed for
the client's machine.
.PP
E 4
.B ``Login incorrect.''
.br
E 12
I 12
.It Sy Login incorrect.
E 12
No password file entry for the user name existed.
D 12
.PP
.B ``No remote directory.''
.br
E 12
I 12
.It Sy Remote directory.
E 12
The 
D 12
.I chdir
E 12
I 12
.Xr chdir
E 12
command to the home directory failed.
D 12
.PP
.B ``Permission denied.''
.br
E 12
I 12
.It Sy Permission denied.
E 12
The authentication procedure described above failed.
D 12
.PP
.B ``Can't make pipe.''
.br
E 12
I 12
.It Sy Can't make pipe.
E 12
The pipe needed for the 
D 12
.BR stderr ,
E 12
I 12
.Em stderr ,
E 12
wasn't created.
D 12
.PP
D 10
.B ``Try again.''
E 10
I 10
.B ``Can't fork; try again.''
E 10
.br
E 12
I 12
.It Sy Can't fork; try again. 
E 12
A
D 12
.I fork
E 12
I 12
.Xr fork
E 12
by the server failed.
D 12
.PP
D 3
.B ``/bin/sh: ...''
E 3
I 3
.B ``<shellname>: ...''
E 3
.br
E 12
I 12
.It Sy <shellname>: ...
E 12
D 3
The user's login shell could not be started.
E 3
I 3
The user's login shell could not be started.  This message is returned
on the connection associated with the
D 12
.BR stderr ,
E 12
I 12
.Em stderr ,
E 12
and is not preceded by a flag byte.
E 3
D 12
.SH SEE ALSO
D 6
rsh(1C),
rcmd(3X)
E 6
I 6
D 7
rsh(1), rcmd(3)
E 7
I 7
rsh(1), rcmd(3), ruserok(3)
E 7
E 6
.SH BUGS
E 12
I 12
.El
.Sh SEE ALSO
.Xr rsh 1 ,
.Xr rcmd 3 ,
.Xr ruserok 3
.Sh BUGS
E 12
The authentication procedure used here assumes the integrity
of each client machine and the connecting medium.  This is
insecure, but is useful in an ``open'' environment.
D 12
.PP
E 12
I 12
.Pp
E 12
A facility to allow all data exchanges to be encrypted should be
present.
I 4
D 12
.PP
E 12
I 12
.Pp
E 12
D 10
A more extensible protocol should be used.
E 10
I 10
A more extensible protocol (such as Telnet) should be used.
E 10
E 4
E 1
