sbin/dumpfs/SCCS/s.dumpfs.8
h09670
s 00002/00002/00034
d D 8.1 93/06/05 10:53:49 bostic 4 3
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00028/00019/00008
d D 6.2 91/03/16 17:06:05 cael 3 2
c macro and text revision (-mdoc version 3)
e
s 00001/00001/00026
d D 6.1 85/04/27 14:55:02 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00027/00000/00000
d D 5.1 85/04/27 14:54:43 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
D 3
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 3
I 3
D 4
.\" Copyright (c) 1983, 1991 Regents of the University of California.
.\" All rights reserved.
E 4
I 4
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 4
E 3
.\"
D 3
.\"	%W% (Berkeley) %G%
E 3
I 3
.\" %sccs.include.redist.man%
E 3
.\"
D 2
.TH DUMPFS 8 "4 March 1983"
E 2
I 2
D 3
.TH DUMPFS 8 "%Q%"
E 2
.UC 5
.SH NAME
dumpfs \- dump file system information
.SH SYNOPSIS
.B dumpfs
.IR filesys | device
.SH DESCRIPTION
.I Dumpfs
E 3
I 3
.\"     %W% (Berkeley) %G%
.\"
.Dd %Q%
.Dt DUMPFS 8
.Os BSD 4.2
.Sh NAME
.Nm dumpfs
.Nd dump file system information
.Sh SYNOPSIS
.Nm dumpfs
.Op Ar filesys No \&| Ar device
.Sh DESCRIPTION
.Nm Dumpfs
E 3
prints out the super block and cylinder group information
for the file system or special device specified.
The listing is very long and detailed.  This
command is useful mostly for finding out certain file system
information such as the file system block size and minimum
free space percentage.
D 3
.SH "SEE ALSO"
fs(5),
disktab(5),
tunefs(8),
newfs(8),
fsck(8)
E 3
I 3
.Sh SEE ALSO
.Xr fs 5 ,
.Xr disktab 5 ,
.Xr disklabel 8 ,
.Xr tunefs 8 ,
.Xr newfs 8 ,
.Xr fsck 8
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.2 .
E 3
E 1
