sbin/umount/SCCS/s.umount.8
h39299
s 00014/00011/00086
d D 8.2 95/05/08 17:50:00 mckusick 2 1
c add -A option to unmount all mounted filesystems
e
s 00097/00000/00000
d D 8.1 94/02/20 16:17:57 bostic 1 0
c date and time created 94/02/20 16:17:57 by bostic
e
u
U
t
T
I 1
.\" Copyright (c) 1980, 1989, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" %sccs.include.redist.roff%
.\"
.\"     %W% (Berkeley) %G%
.\"
.Dd %Q%
.Dt UMOUNT 8
.Os BSD 4
.Sh NAME
.Nm umount
D 2
.Nd unmount file systems
E 2
I 2
.Nd unmount filesystems
E 2
.Sh SYNOPSIS
.Nm umount
.Op Fl fv
.Ar special | node
.Nm umount
D 2
.Fl a
E 2
I 2
.Fl a | A
E 2
.Op Fl fv
.Op Fl h Ar host
D 2
.Op Fl t Ar ufs | lfs | external_type
E 2
I 2
.Op Fl t Ar type
E 2
.Sh DESCRIPTION
The
.Nm umount
command
calls the
.Xr unmount 2
system call to remove a
.Ar "special device"
D 2
or the remote node (rhost:path) from the file system tree at the point
E 2
I 2
or the remote node (rhost:path) from the filesystem tree at the point
E 2
.Ar node .
If either
.Ar special
or
.Ar node
are not provided, the appropriate information is taken from the
.Xr fstab 5
file.
.Pp
The options are as follows:
.Bl -tag -width indent
.It Fl a
D 2
All of the file systems described in
E 2
I 2
All the filesystems described in
E 2
.Xr fstab 5
are unmounted.
I 2
.It Fl A
All the currently mounted filesystems except
the root are unmounted.
E 2
.It Fl f
D 2
The file system is forcibly unmounted.
E 2
I 2
The filesystem is forcibly unmounted.
E 2
Active special devices continue to work,
but all other files return errors if further accesses are attempted.
D 2
The root file system cannot be forcibly unmounted.
E 2
I 2
The root filesystem cannot be forcibly unmounted.
E 2
.It Fl h Ar host
Only filesystems mounted from the specified host will be
unmounted.
This option is implies the
D 2
.Fl a
E 2
I 2
.Fl A
E 2
option and, unless otherwise specified with the
.Fl t
option, will only unmount NFS filesystems.
D 2
.It Fl t Ar "ufs \\*(Ba lfs \\*(Ba external type"
E 2
I 2
.It Fl t Ar type
E 2
Is used to indicate the actions should only be taken on
filesystems of the specified type.
More than one type may be specified in a comma separated list.
The list of filesystem types can be prefixed with
.Dq no
to specify the filesystem types for which action should
.Em not
be taken.
For example, the
.Nm umount
command:
.Bd -literal -offset indent
umount -a -t nfs,mfs
.Ed
.Pp
umounts all filesystems of the type
.Tn NFS
and
.Tn MFS .
.It Fl v
D 2
Verbose, additional information is printed out as each file system
E 2
I 2
Verbose, additional information is printed out as each filesystem
E 2
is unmounted.
.El
.Sh FILES
.Bl -tag -width /etc/fstab -compact
.It Pa /etc/fstab
D 2
file system table
E 2
I 2
filesystem table
E 2
.El
.Sh SEE ALSO
.Xr unmount 2 ,
.Xr fstab 5 ,
.Xr mount 8
.Sh HISTORY
A
.Nm umount
command appeared in
.At v6 .
E 1
