libexec/talkd/SCCS/s.talkd.8
h42459
s 00001/00001/00048
d D 8.2 93/12/11 23:43:05 mckusick 7 6
c copyediting for Usenix manuals
e
s 00002/00002/00047
d D 8.1 93/06/04 19:06:34 bostic 6 5
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00031/00017/00018
d D 6.5 91/03/16 17:05:36 cael 5 4
c macro and text revision (-mdoc version 3)
e
s 00002/00012/00033
d D 6.4 90/06/24 21:23:38 trent 4 3
c new copyright & pathnames (talkd)
e
s 00015/00004/00030
d D 6.3 88/09/20 09:43:52 bostic 3 2
c Berkeley copyright
e
s 00002/00000/00032
d D 6.2 86/05/21 22:22:54 mckusick 2 1
c see also section
e
s 00032/00000/00000
d D 6.1 86/05/16 12:13:03 mckusick 1 0
c first distributed with 4.3BSD
e
u
U
t
T
I 1
D 3
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 3
I 3
D 5
.\" Copyright (c) 1983 The Regents of the University of California.
E 5
I 5
D 6
.\" Copyright (c) 1983, 1991 The Regents of the University of California.
E 5
.\" All rights reserved.
E 6
I 6
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 6
E 3
.\"
I 3
D 4
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 4
I 4
.\" %sccs.include.redist.man%
E 4
.\"
E 3
D 5
.\"	%W% (Berkeley) %G%
E 5
I 5
.\"     %W% (Berkeley) %G%
E 5
.\"
D 3
.TH TALKD 8C "%Q%"
E 3
I 3
D 5
.TH TALKD 8 "%Q%"
E 3
.UC 6
.SH NAME
talkd \- remote user communication server
.SH SYNOPSIS
D 4
.B /etc/talkd
E 4
I 4
.B talkd
E 4
.SH DESCRIPTION
.I Talkd
is the server that notifies a user that somebody else wants to
E 5
I 5
.Dd %Q%
.Dt TALKD 8
.Os BSD 4.3
.Sh NAME
.Nm talkd
.Nd remote user communication server
.Sh SYNOPSIS
.Nm talkd
.Sh DESCRIPTION
.Nm Talkd
is the server that notifies a user that someone else wants to
E 5
initiate a conversation.
D 7
It acts a repository of invitations, responding to requests
E 7
I 7
It acts as a repository of invitations, responding to requests
E 7
by clients wishing to rendezvous to hold a conversation.
In normal operation, a client, the caller,
D 5
initiates a rendezvous by sending a CTL_MSG to the server of
type LOOK_UP (see
.RI < protocols/talkd.h >).
E 5
I 5
initiates a rendezvous by sending a
.Tn CTL_MSG
to the server of
type
.Tn LOOK_UP
(see
.Aq Pa protocols/talkd.h ) .
E 5
This causes the server to search its invitation
tables to check if an invitation currently exists for the caller
(to speak to the callee specified in the message).
If the lookup fails,
D 5
the caller then sends an ANNOUNCE message causing the server to
E 5
I 5
the caller then sends an
.Tn ANNOUNCE
message causing the server to
E 5
broadcast an announcement on the callee's login ports requesting contact.
When the callee responds, the local server uses the
recorded invitation to respond with the appropriate rendezvous
address and the caller and callee client programs establish a
stream connection through which the conversation takes place.
I 2
D 5
.SH SEE ALSO
talk(1), write(1)
E 5
I 5
.Sh SEE ALSO
.Xr talk 1 ,
.Xr write 1
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.3 .
E 5
E 2
E 1
