share/man/man8/SCCS/s.adduser.8
h40464
s 00002/00002/00087
d D 8.1 93/06/05 13:57:46 bostic 11 10
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00065/00037/00024
d D 6.8 91/03/16 18:09:38 cael 10 9
c macro and text revision (-mdoc version 3)
e
s 00004/00014/00057
d D 6.7 90/06/24 21:59:31 trent 9 8
c new copyright & pathnames (aliases & skel)
e
s 00012/00009/00059
d D 6.6 89/03/15 20:52:12 bostic 8 7
c document login characters, minor cleanups
e
s 00029/00058/00039
d D 6.5 89/02/23 12:17:05 bostic 7 6
c shadow passwords
e
s 00004/00003/00093
d D 6.4 87/10/01 13:40:14 bostic 6 5
c '-' may not start login name; bug report 4.3BSD/bin/85
e
s 00004/00004/00092
d D 6.3 87/04/13 11:34:53 bostic 5 4
c bug report 4.2BSD/man/25
e
s 00013/00010/00083
d D 6.2 86/05/23 11:29:46 mckusick 4 3
c update for 4.3BSD
e
s 00000/00000/00093
d D 6.1 85/04/27 12:34:17 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00000/00000/00093
d D 5.1 85/04/27 12:33:55 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00093/00000/00000
d D 4.1 85/04/27 12:33:34 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
D 7
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 7
I 7
D 10
.\" Copyright (c) 1980 The Regents of the University of California.
E 10
I 10
D 11
.\" Copyright (c) 1980, 1991 The Regents of the University of California.
E 10
.\" All rights reserved.
E 11
I 11
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 11
E 7
.\"
I 7
D 9
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 9
I 9
.\" %sccs.include.redist.man%
E 9
.\"
E 7
D 10
.\"	%W% (Berkeley) %G%
E 10
I 10
.\"     %W% (Berkeley) %G%
E 10
.\"
D 10
.TH ADDUSER 8 "%Q%"
.UC 4
.SH NAME
adduser \- procedure for adding new users
.SH DESCRIPTION
E 10
I 10
.Dd %Q%
.Dt ADDUSER 8
.Os BSD 4
.Sh NAME
.Nm adduser
.Nd procedure for adding new users
.Sh DESCRIPTION
E 10
A new user must choose a login name, which must not already appear in
D 5
.I /etc/passwd.
An account can be added by editing a line into the passwd file; this must
be done with the password file locked e.g. by using
E 5
I 5
D 6
\fI/etc/passwd\fP or \fI/usr/lib/aliases\fP.  An account can be added
by editing a line into the passwd file; this must be done with the
password file locked e.g. by using
E 6
I 6
D 8
\fI/etc/passwd\fP or \fI/usr/lib/aliases\fP.  It must also not begin with
the hyphen (``-'') character.  An account can be added by editing a line
into the passwd file; this must be done with the password file locked
e.g. by using
E 8
I 8
D 10
.IR /etc/passwd or
D 9
.IR /usr/lib/aliases .
E 9
I 9
.IR /etc/aliases .
E 9
It must also not begin with the hyphen (``-'') character.
E 10
I 10
.Pa /etc/passwd
or
.Pa /etc/aliases .
It must also not begin with the hyphen
.Ql Fl
character.
E 10
It is strongly recommended that it be all lower-case, and not contain
D 10
the dot (``.'') character, as that tends to confuse mailers.
E 10
I 10
the dot
.Ql \&.
character, as that tends to confuse mailers.
E 10
An account can be added by editing a line into the passwd file; this
must be done with the password file locked e.g. by using
E 8
I 7
D 10
.IR chpass (1)
E 10
I 10
.Xr chpass 1
E 10
or
E 7
E 6
E 5
D 10
.IR vipw (8).
.PP
E 10
I 10
.Xr vipw 8 .
.Pp
E 10
A new user is given a group and user id.
D 7
User id's should be distinct across a system, since they
are used to control access to files.
Typically, users working on
similar projects will be put in the same group.  Thus at UCB we have
groups for system staff, faculty, graduate students, and a few special
groups for large projects.  System staff is group \*(lq10\*(rq for historical
reasons, and the super-user is in this group.
E 7
I 7
D 8
User id's should be unique for the system, since they are used to
control access to files.
E 8
I 8
D 10
Login's and user id's should be unique across the system, and often across
E 10
I 10
Login and user id's should be unique across the system, and often across
E 10
a group of systems, since they are used to control file access.
E 8
Typically, users working on similar projects will be put in the same groups.
D 8
At UCB we have groups for system staff, faculty, graduate students, and
special groups for large projects.
E 8
I 8
At the University of California, Berkeley, we have groups for system staff,
faculty, graduate students, and special groups for large projects.
E 8
E 7
D 10
.PP
D 7
A skeletal account for a new user \*(lqernie\*(rq would look like:
E 7
I 7
A skeletal account for a new user \*(lqernie\*(rq might look like:
E 7
.IP
D 7
ernie::235:20:& Kovacs,508E,7925,6428202:/mnt/grad/ernie:/bin/csh
E 7
I 7
D 8
ernie::25:30:none:0:0:Ernie Kovacs,508 Evans Hall,x7925,642-8202:/a/users/ernie:/bin/csh
E 8
I 8
ernie::25:30::0:0:Ernie Kovacs,508 Evans Hall,x7925,642-8202:/a/users/ernie:/bin/csh
E 8
E 7
.PP
E 10
I 10
.Pp
A skeletal account for a new user
\*(lqernie\*(rq
might look like:
.Bd -literal
ernie::25:30::0:0:Ernie Kovacs,508 Evans Hall,x7925,
	642-8202:/a/users/ernie:/bin/csh
.Ed
.Pp
E 10
D 7
The first field is the login name \*(lqernie\*(rq.  The next field is the
encrypted password which is not given and must be initialized using
.IR passwd (1).
The next two fields are the user and group id's.
Traditionally, users in group 20 are graduate students and have account
names with numbers in the 200's.
The next field gives information about ernie's real name, office and office
phone and home phone.
This information is used by the
.IR finger (1)
program.
From this information we can tell that ernie's real name is
\*(lqErnie Kovacs\*(rq (the & here serves to repeat \*(lqernie\*(rq
with appropriate capitalization), that his office is 508 Evans Hall,
his extension is x2-7925, and this his home phone number is 642-8202.
You can modify the
.IR finger (1)
program if necessary to allow different information to be encoded in
this field.  The UCB version of finger knows several things particular
to Berkeley \- that phone extensions start \*(lq2\-\*(rq, that offices ending
in \*(lqE\*(rq are in Evans Hall and that offices ending in \*(lqC\*(rq are
D 4
in Cory Hall.
E 4
I 4
in Cory Hall. The 
.IR chfn (1)
program allows users to change this information.
E 7
I 7
For a description of each of these fields, see
D 10
.IR passwd (5).
E 7
E 4
.PP
E 10
I 10
.Xr passwd 5 .
.Pp
E 10
D 7
The final two fields give a login directory and a login shell name.
D 4
Traditionally, user files live on a file system which has the machines
single letter
.IR net (1)
address as the first of two characters.  Thus on the Berkeley CS Department
VAX, whose Berknet address is ``csvax'' abbreviated ``v'' the user file
systems are mounted on ``/va'', ``/vb'', etc.
On each such filesystem there are subdirectories there for each group
of users, i.e.: \*(lq/va/staff\*(rq and \*(lq/vb/prof\*(rq.
E 4
I 4
Traditionally, user files live on a file system different from /usr.
Typically the user file systems are mounted on a directories in the root
named sequentially starting from from the beginning of the alphabet,
eg /a, /b, /c, etc.
On each such file system there are subdirectories there for each group
of users, i.e.: \*(lq/a/staff\*(rq and \*(lq/b/prof\*(rq.
E 4
This is not strictly necessary but keeps the number of files in the
top level directories reasonably small.
.PP
The login shell will default to \*(lq/bin/sh\*(rq if none is given.
Most users at Berkeley choose \*(lq/bin/csh\*(rq so this is usually
D 4
specified here.
E 4
I 4
specified here. The 
.IR chsh (1)
program allows users to change their login shell to one of the
shells in the approved list given in /etc/shells.
E 4
.PP
E 7
It is useful to give new users some help in getting started, supplying
them with a few skeletal files such as
D 10
.I \&.profile
if they use \*(lq/bin/sh\*(rq, or
.I \&.cshrc
E 10
I 10
.Pa \&.profile
if they use
.Pa /bin/sh ,
or
.Pa \&.cshrc
E 10
and
D 10
.I \&.login
if they use \*(lq/bin/csh\*(rq.
E 10
I 10
.Pa \&.login
if they use
.Pa /bin/csh .
E 10
The directory
D 9
\*(lq/usr/skel\*(rq contains skeletal definitions of such files.
E 9
I 9
D 10
\*(lq/usr/share/skel\*(rq contains skeletal definitions of such files.
E 10
I 10
.Pa /usr/share/skel
contains skeletal definitions of such files.
E 10
E 9
New users should be given copies of these files which, for instance,
D 7
arrange to use
E 7
I 7
use
E 7
D 10
.IR tset (1)
E 10
I 10
.Xr tset 1
E 10
automatically at each login.
D 10
.SH FILES
.ta 2i
D 7
/etc/passwd	password file
E 7
I 7
/etc/master.passwd	user database
E 7
.br
D 9
/usr/skel	skeletal login directory
E 9
I 9
/usr/share/skel	skeletal login directory
E 9
.SH SEE ALSO
D 5
passwd(1), finger(1), chsh(1), chfn(1), passwd(5), vipw(8)
E 5
I 5
D 7
passwd(1), finger(1), chsh(1), chfn(1), aliases(5), passwd(5), vipw(8)
E 7
I 7
chpass(1), finger(1), passwd(1), aliases(5), passwd(5), mkpasswd(8), vipw(8)
E 7
E 5
.SH BUGS
E 10
I 10
.Sh FILES
.Bl -tag -width /etc/master.passwdxx -compact
.It Pa /etc/master.passwd
user database
.It Pa /usr/share/skel
skeletal login directory
.El
.Sh SEE ALSO
.Xr chpass 1 ,
.Xr finger 1 ,
.Xr passwd 1 ,
.Xr aliases 5 ,
.Xr passwd 5 ,
.Xr pwd_mkdb 8 ,
.Xr vipw 8
.Sh BUGS
E 10
D 7
User information should be stored in its own data base separate from
the password file.
E 7
I 7
User information should (and eventually will) be stored elsewhere.
I 10
.Sh HISTORY
The
.Nm
command appeared in
.Bx 3.0 .
E 10
E 7
E 1
