share/man/man8/SCCS/s.makedev.8
h30802
s 00002/00002/00082
d D 8.1 93/06/05 13:57:58 bostic 5 4
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00064/00037/00020
d D 6.3 91/03/16 18:09:49 cael 4 3
c macro and text revision (-mdoc version 3)
e
s 00000/00004/00057
d D 6.2 86/05/19 19:45:04 karels 3 2
c not no more it ain't
e
s 00001/00001/00060
d D 6.1 85/04/27 15:35:11 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00061/00000/00000
d D 5.1 85/04/27 15:34:52 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
D 4
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 4
I 4
D 5
.\" Copyright (c) 1983, 1991 Regents of the University of California.
.\" All rights reserved.
E 5
I 5
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 5
E 4
.\"
D 4
.\"	%W% (Berkeley) %G%
E 4
I 4
.\" %sccs.include.redist.man%
E 4
.\"
D 2
.TH MAKEDEV 8 "18 July 1983"
E 2
I 2
D 4
.TH MAKEDEV 8 "%Q%"
E 2
.UC 5
.SH NAME
makedev \- make system special files
.SH SYNOPSIS
.B /dev/MAKEDEV 
.IR device ...
.SH DESCRIPTION
.I MAKEDEV
E 4
I 4
.\"     %W% (Berkeley) %G%
.\"
.Dd %Q%
.Dt MAKEDEV 8
.Os BSD 4.2
.Sh NAME
.Nm makedev
.Nd make system special files
.Sh SYNOPSIS
.Nm MAKEDEV
.Ar device ...
.Sh DESCRIPTION
.Nm MAKEDEV
E 4
is a shell script normally used to install
special files.  It resides in the 
D 4
.I /dev
E 4
I 4
.Pa /dev
E 4
directory, as this is the normal location of special files.
Arguments to 
D 4
.I MAKEDEV
E 4
I 4
.Nm MAKEDEV
E 4
are usually of the form
D 4
.IR device-name ?
E 4
I 4
.Ar device-name Ns Sy \&?
E 4
where
D 4
.I device-name
E 4
I 4
.Ar device-name
E 4
is one of the supported devices listed in section 4 of the
D 4
manual and ``?'' is a logical unit number (0-9).  A few
E 4
I 4
manual and
.Dq Sy \&?
is a logical unit number (0-9).  A few
E 4
special arguments create assorted collections of devices and are
listed below.
D 4
.TP
.B std
E 4
I 4
.Bl -tag -width Ds
.It Sy std
E 4
Create the
D 4
.I standard
devices for the system; e.g. /dev/console, /dev/tty.
The VAX-11/780 console floppy device, /dev/floppy, and VAX-11/750
and VAX-11/730 console cassette device(s), /dev/tu?, are also
created with this entry.
.TP
.B local
E 4
I 4
.Em standard
devices for the system; for example the standard
.Tn UNIX
devices
.Pa /dev/console and /dev/tty;
the standard hardware dependent devices,
for example in the VAX family
the
.Tn VAX-11/780
console floppy device,
.Pa /dev/floppy ,
and
.Tn VAX-11/750
and
.Tn VAX-11/730
console cassette device(s),
.Pa /dev/tu?
devices would be made for the appropriate system.
.It Sy local
E 4
Create those devices specific to the local site.  This
request causes the shell file 
D 4
.I /dev/MAKEDEV.local
E 4
I 4
.Pa /dev/MAKEDEV.local
E 4
to be executed.  Site specific commands, such as those
D 4
used to setup dialup lines as ``ttyd?'' should be included
E 4
I 4
used to setup dialup lines as
.Pa ttyd?
should be included
E 4
in this file.
D 4
.PP
E 4
I 4
.El
.Pp
E 4
Since all devices are created using 
D 4
.IR mknod (8),
E 4
I 4
.Xr mknod 8 ,
E 4
this shell script is useful only to the super-user.
D 4
.SH DIAGNOSTICS
E 4
I 4
.Sh DIAGNOSTICS
E 4
Either self-explanatory, or generated by one of the programs
D 4
called from the script.  Use ``sh -x MAKEDEV'' in case of
E 4
I 4
called from the script.  Use
.Ql sh -x MAKEDEV
in case of
E 4
trouble.
D 4
.SH "SEE ALSO"
intro(4),
config(8),
mknod(8)
E 4
I 4
.Sh SEE ALSO
.Xr intro 4 ,
.Xr config 8 ,
.Xr mknod 8
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.2 .
E 4
D 3
.SH BUGS
When more than one piece of hardware of the same ``kind'' is
present on a machine (for instance, a dh and a dmf), naming
conflicts arise.
E 3
E 1
