share/man/man8/SCCS/s.rc.8
h25481
s 00001/00001/00079
d D 8.2 93/12/11 23:44:32 mckusick 6 5
c copyediting for Usenix manuals
e
s 00002/00002/00078
d D 8.1 93/06/05 13:58:04 bostic 5 4
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00055/00039/00025
d D 6.2 91/03/16 18:10:13 cael 4 3
c macro and text revision (-mdoc version 3)
e
s 00001/00001/00063
d D 6.1 85/04/27 13:42:03 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00024/00003/00040
d D 5.1 85/04/27 13:41:40 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00043/00000/00000
d D 4.1 85/04/27 13:41:21 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
D 4
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 4
I 4
D 5
.\" Copyright (c) 1980, 1991 Regents of the University of California.
.\" All rights reserved.
E 5
I 5
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 5
E 4
.\"
D 4
.\"	%W% (Berkeley) %G%
E 4
I 4
.\" %sccs.include.redist.man%
E 4
.\"
D 2
.TH RC 8 "4/1/81"
E 2
I 2
D 3
.TH RC 8 "4 February 1983"
E 3
I 3
D 4
.TH RC 8 "%Q%"
E 3
E 2
.UC 4
.SH NAME
rc \- command script for auto-reboot and daemons
.SH SYNOPSIS
.B /etc/rc
I 2
.br
.B /etc/rc.local
E 2
.SH DESCRIPTION
.I Rc
E 4
I 4
.\"     %W% (Berkeley) %G%
.\"
.Dd %Q%
.Dt RC 8
.Os BSD 4
.Sh NAME
.Nm rc
.Nd command script for auto\-reboot and daemons
.Sh SYNOPSIS
.Nm rc
.Nm rc.local
.Sh DESCRIPTION
.Nm Rc
E 4
D 2
is the command script which controls the automatic reboot
E 2
I 2
is the command script which controls the automatic reboot and
D 4
.I rc.local
E 4
I 4
.Nm rc.local
E 4
is the script holding commands which are pertinent only
to a specific site.
E 2
D 4
.PP
E 4
I 4
.Pp
E 4
When an automatic reboot is in progress,
D 4
.I rc
E 4
I 4
.Nm rc
E 4
is invoked with the argument
D 4
.I autoboot
and runs a
.I fsck
E 4
I 4
.Em autoboot .
The first portion of
.Nm rc
runs an
.Xr fsck 8
E 4
with option
D 4
.B \-p
E 4
I 4
.Fl p
E 4
to ``preen'' all the disks of minor inconsistencies resulting
from the last system shutdown and to check for serious inconsistencies
caused by hardware or software failure.
If this auto-check and repair succeeds, then the second part of
D 4
.I rc
E 4
I 4
.Nm rc
E 4
is run.
D 4
.PP
E 4
I 4
.Pp
E 4
The second part of
D 4
.I rc,
E 4
I 4
.Nm rc ,
E 4
D 6
which is run after a auto-reboot succeeds and also if
E 6
I 6
which is run after an auto-reboot succeeds and also if
E 6
D 4
.I rc
E 4
I 4
.Nm rc
E 4
is invoked when a single user shell terminates (see
D 4
.IR init (8)),
E 4
I 4
.Xr init 8 ) ,
E 4
starts all the daemons on the system, preserves editor files
and clears the scratch directory
D 4
.B /tmp.
I 2
.I Rc.local
E 4
I 4
.Pa /tmp .
.Pp
.Nm Rc.local
E 4
is executed immediately before any other commands after a successful
D 4
.IR fsck .
E 4
I 4
.Xr fsck .
E 4
Normally, the first commands placed in the
D 4
.I rc.local
E 4
I 4
.Nm rc.local
E 4
file define the machine's name, using
D 4
.IR hostname (1),
E 4
I 4
.Xr hostname 1 ,
E 4
and save any possible core image that might have been
D 4
generated as a result of a system crash,
.IR savecore (8).
E 4
I 4
generated as a result of a system crash, with
.Xr savecore 8 .
E 4
The latter command is included in the
D 4
.I rc.local
E 4
I 4
.Nm rc.local
E 4
file because the directory in which core dumps are saved
is usually site specific.
E 2
D 4
.SH SEE ALSO
D 2
init(8), reboot(8)
E 2
I 2
init(8),
reboot(8),
savecore(8)
E 2
.SH BUGS
E 4
I 4
.Pp
Following tradition, the startup files
.Nm rc
and
.Nm rc.local
reside in
.Pa /etc .
.Sh SEE ALSO
.Xr init 8 ,
.Xr reboot 8 ,
.Xr savecore 8
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.0 .
E 4
E 1
