share/man/man4/man4.vax/SCCS/s.acc.4
h06081
s 00002/00002/00076
d D 8.1 93/06/05 13:43:19 bostic 6 5
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00055/00037/00023
d D 6.4 91/03/27 23:51:21 cael 5 4
c  macro and text revision (-mdoc version 3)
e
s 00001/00011/00059
d D 6.3 90/06/23 18:06:41 trent 4 3
c new copyright notice
e
s 00016/00003/00054
d D 6.2 89/02/14 17:34:21 bostic 3 2
c add Berkeley specific copyright notice
e
s 00001/00001/00056
d D 6.1 85/05/15 17:41:19 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00057/00000/00000
d D 5.1 85/05/15 17:41:12 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
D 3
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 3
I 3
D 5
.\" Copyright (c) 1983 The Regents of the University of California.
E 5
I 5
D 6
.\" Copyright (c) 1983, 1991 The Regents of the University of California.
E 5
.\" All rights reserved.
E 6
I 6
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 6
E 3
.\"
I 3
D 4
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 4
I 4
.\" %sccs.include.redist.man%
E 4
.\"
E 3
D 5
.\"	%W% (Berkeley) %G%
E 5
I 5
.\"     %W% (Berkeley) %G%
E 5
.\"
D 2
.TH ACC 4 "27 July 1983"
E 2
I 2
D 5
.TH ACC 4 "%Q%"
E 2
.UC 5
.SH NAME
acc \- ACC LH/DH IMP interface
.SH SYNOPSIS
.B "pseudo-device imp"
.br
.B "device acc0 at uba0 csr 167600 vector accrint accxint"
.SH DESCRIPTION
E 5
I 5
.Dd %Q%
.Dt ACC 4 vax
.Os BSD 4.2
.Sh NAME
.Nm acc
.Nd
.Tn ACC LH/DH IMP
interface
.Sh SYNOPSIS
.Cd pseudo-device imp "device acc0 at uba0 csr 167600 vector accrint accxint"
.Sh DESCRIPTION
E 5
The 
D 5
.I acc
E 5
I 5
.Nm acc
E 5
device provides a Local Host/Distant Host
D 5
interface to an IMP.  It is normally used when participating
in the DARPA Internet.  The controller itself is not accessible
to users, but instead provides the hardware support to the IMP
E 5
I 5
interface to an
.Tn IMP .
It is normally used when participating
in the
.Tn DARPA
Internet.  The controller itself is not accessible
to users, but instead provides the hardware support to the
.Tn IMP
E 5
interface described in
D 5
.IR imp (4).
When configuring, the 
.I imp
pseudo-device must also be included.
.SH DIAGNOSTICS
.BR "acc%d: not alive" .
E 5
I 5
.Xr imp 4 .
The configuration entry for the
.Xr imp
must also include the
.Em pseudo-device
as shown above.
.Sh DIAGNOSTICS
.Bl -diag
.It acc%d: not alive.
E 5
The initialization routine was entered even though the device
did not autoconfigure.  This indicates a system problem.
D 5
.PP
.BR "acc%d: can't initialize" .
E 5
I 5
.Pp
.It acc%d: can't initialize.
E 5
Insufficient UNIBUS resources existed to initialize the device.
This is likely to occur when the device is run on a buffered
data path on an 11/750 and other network interfaces are also
configured to use buffered data paths, or when it is configured
to use buffered data paths on an 11/730 (which has none).
D 5
.PP
.BR "acc%d: imp doesn't respond, icsr=%b" .
The driver attempted to initialize the device, but the IMP
E 5
I 5
.Pp
.It acc%d: imp doesn't respond, icsr=%b.
The driver attempted to initialize the device, but the
.Tn IMP
E 5
failed to respond after 500 tries.  Check the cabling.
D 5
.PP
.BR "acc%d: stray xmit interrupt, csr=%b" .
E 5
I 5
.Pp
.It acc%d: stray xmit interrupt, csr=%b.
E 5
An interrupt occurred when no output had previously been started. 
D 5
.PP
.BR "acc%d: output error, ocsr=%b, icsr=%b" .
E 5
I 5
.Pp
.It acc%d: output error, ocsr=%b, icsr=%b.
E 5
The device indicated a problem sending data on output.
D 5
.PP
.BR "acc%d: input error, csr=%b" .
E 5
I 5
.Pp
.It acc%d: input error, csr=%b.
E 5
The device indicated a problem receiving data on input.
D 5
.PP
.BR "acc%d: bad length=%d" .
E 5
I 5
.Pp
.It acc%d: bad length=%d.
E 5
An input operation resulted in a data transfer of less than
0 or more than 1008 bytes of
data into memory (according to the word count register).
D 5
This should never happen as the maximum size of a host-IMP
E 5
I 5
This should never happen as the maximum size of a
.Pf host- Tn IMP
E 5
message is 1008 bytes.
I 3
D 5
.SH "SEE ALSO"
netintro(4)
E 5
I 5
.El
.Sh SEE ALSO
.Xr netintro 4
.Sh HISTORY
The
.Nm
interface appeared in
.Bx 4.2 .
E 5
E 3
E 1
