share/man/man4/man4.vax/SCCS/s.autoconf.4
h18103
s 00002/00002/00245
d D 8.1 93/06/05 13:43:34 bostic 6 5
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00222/00082/00025
d D 6.3 91/03/27 23:51:23 cael 5 4
c  macro and text revision (-mdoc version 3)
e
s 00013/00007/00094
d D 6.2 86/05/15 17:55:53 karels 4 3
c update choice of root fs
e
s 00001/00001/00100
d D 6.1 85/05/15 17:17:04 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00013/00019/00088
d D 5.1 85/05/15 17:16:53 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00107/00000/00000
d D 4.1 85/05/15 17:16:46 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
D 5
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 5
I 5
D 6
.\" Copyright (c) 1980, 1991 Regents of the University of California.
.\" All rights reserved.
E 6
I 6
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 6
E 5
.\"
D 5
.\"	%W% (Berkeley) %G%
E 5
I 5
.\" %sccs.include.redist.man%
E 5
.\"
D 2
.TH AUTOCONF 4 10/8/81
E 2
I 2
D 3
.TH AUTOCONF 4 "27 July 1983"
E 3
I 3
D 5
.TH AUTOCONF 4 "%Q%"
E 3
E 2
.UC 4
.SH NAME
D 2
autoconf \- diagnostics from autoconfiguration code
E 2
I 2
autoconf \- diagnostics from the autoconfiguration code
E 2
.SH DESCRIPTION
D 4
When UNIX bootstraps it probes the innards of the machine it is running
on and locates controllers, drives, and other devices, printing out
E 4
I 4
When UNIX bootstraps it probes the innards of the machine
on which it is running
and locates controllers, drives, and other devices, printing out
E 4
what it finds on the console.  This procedure is driven by a system
E 5
I 5
.\"     %W% (Berkeley) %G%
.\"
.Dd %Q%
.Dt AUTOCONF 4
.Os BSD 4
.Sh NAME
.Nm autoconf
.Nd "diagnostics from the autoconfiguration code"
.Sh DESCRIPTION
When
.Tn UNIX
bootstraps it probes the innards of the machine
on which it is running and
locates controllers, drives, and other devices.
Each item found is recorded on the console.
This procedure is driven by a system
E 5
configuration table which is processed by
D 5
.IR config (8)
E 5
I 5
.Xr config 8
E 5
and compiled into each kernel.
D 5
.PP
D 4
Devices in NEXUS slots are normally noted, thus memory controllers,
E 4
I 4
On the VAX,
devices in NEXUS slots are normally noted, thus memory controllers,
E 4
UNIBUS and MASSBUS adaptors.  Devices which are not supported which
are found in NEXUS slots are noted also.
I 4
The Q-bus on the MICROVAX is configured in the same way as the UNIBUS.
E 4
.PP
MASSBUS devices are located by a very deterministic procedure since
D 2
MASSBUS space is completely probable very easily.  If devices exist which
E 2
I 2
MASSBUS space is completely probe-able.  If devices exist which
E 5
I 5
.Pp
On the
.Tn VAX ,
devices in
.Tn NEXUS
slots are normally noted, thus memory controllers,
.Tn UNIBUS
and
.Tn MASSBUS
adaptors.  Devices which are not supported which
are found in
.Tn NEXUS
slots are noted also.
The Q-bus on the
.Tn MICROVAX
is configured in the same way as the
.Tn UNIBUS.
.Pp
.Tn MASSBUS
devices are located by a very deterministic procedure since
.Tn MASSBUS
space is completely probe-able.  If devices exist which
E 5
E 2
are not configured they will be silently ignored; if devices exist of
unsupported type they will be noted.
D 5
.PP
UNIBUS devices are located by probing to see if their control-status
E 5
I 5
.Pp
.Tn UNIBUS
devices are located by probing to see if their control-status
E 5
registers respond.  If not, they are silently ignored.  If the control
status register responds but the device cannot be made to interrupt,
a diagnostic warning will be printed on the console and the device
D 2
will not be available to the system.  (A command
.IR attach (8)
is planned to cause the device to be attached irregardless of its
failure to interrupt, after the system is bootstrapped, for irksome
devices.  This is not in as of this writing, however.)
E 2
I 2
will not be available to the system. 
E 2
D 5
.PP
E 5
I 5
.Pp
E 5
D 4
A generic system may be built which picks its root device at boot time
E 4
I 4
Normally, the system uses the disk from which it was loaded as the root
filesystem.
If that is not possible,
a generic system will pick its root device
E 4
D 5
as the ``best'' available device (MASSBUS disks are better than
SMD UNIBUS disks are better than RK07's; the device must be drive 0
E 5
I 5
as the
.Dq best
available device
.Pf ( Tn MASSBUS
disks are better than
.Tn SMD UNIBUS
disks are better than
.Tn RK07 Ns s ;
the device must be drive 0
E 5
D 4
to be considered.)
If such a system is booted with the RB_ASKNAME option of (see
E 4
I 4
to be considered).
D 5
If such a system is booted with the RB_ASKNAME option (see
E 4
D 2
.IR reboot (2V)),
E 2
I 2
.IR reboot (2)),
E 5
I 5
If such a system is booted with the
.Dv RB_ASKNAME
option (see
.Xr reboot 2 ) ,
E 5
E 2
then the name of the root device is read from the console terminal at boot
time, and any available device may be used.
D 5
.SH SEE ALSO
D 2
config(8)
E 2
I 2
D 4
intro(4), config(8)
E 4
I 4
intro(4), boot(8), config(8)
E 4
E 2
.SH DIAGNOSTICS
\fBcpu type %d not configured\fR.  You tried to boot UNIX on a cpu
type which it doesn't (or at least this compiled version of UNIX doesn't)
E 5
I 5
.Sh DIAGNOSTICS
.Bl -diag
.It cpu type %d not configured.
You tried to boot
.Tn UNIX
on a
.Tn CPU
type which it doesn't (or at least this compiled version of
.Tn UNIX
doesn't)
E 5
understand.
D 5
.PP
\fBmba%d at tr%d\fR.  A MASSBUS adapter was found in tr%d (the NEXUS
slot number).  UNIX will call it mba%d.
.PP
\fB%d mba's not configured\fR.  More MASSBUS adapters were found on
E 5
I 5
.Pp
.It mba%d at tr%d.
A
.Tn MASSBUS
adapter was found in
.Ql tr%d
(the
.Tn NEXUS
slot number).
.Tn UNIX
will call it
.Ql mba%d .
.Pp
.It %d mba's not configured.
More
.Tn MASSBUS
adapters were found on
E 5
the machine than were declared in the machine configuration; the excess
D 5
MASSBUS adapters will not be accessible.
.PP
\fBuba%d at tr%d\fR.  A UNIBUS adapter was found in tr%d (the NEXUS
slot number).  UNIX will call it uba%d.
.PP
\fBdr32 unsupported (at tr %d)\fR.  A DR32 interface was found in
a NEXUS, for which UNIX does not have a driver.
.PP
I 2
\fBci unsupported (at tr %d)\fR.  A CI interface was found in
a NEXUS, for which UNIX does not have a driver.
.PP
E 2
\fBmcr%d at tr%d\fR.  A memory controller was found in tr%d (the NEXUS
slot number).  UNIX will call it mcr%d.
.PP
\fB5 mcr's unsupported\fR.  UNIX supports only 4 memory controllers
per cpu.
.PP
\fBmpm unsupported (at tr%d)\fR.  Multi-port memory is unsupported
in the sense that UNIX does not know how to poll it for ECC errors.
.PP
\fB%s%d at mba%d drive %d\fR.  A tape formatter or a disk was found
on the MASSBUS; for disks %s%d will look like ``hp0'', for tape formatters
D 2
like ``ht1'' or ``mt1''.  The drive number comes from the unit plug on the drive
E 2
I 2
like ``ht1''.  The drive number comes from the unit plug on the drive
E 2
or in the TM formatter (\fBnot\fR on the tape drive; see below).
.PP
\fB%s%d at %s%d slave %d\fR.  (For MASSBUS devices).
D 2
Which would look like ``tu0 at ht0 slave 0'' or ``mu0 at mt0 slave 0'',
where \fBtu0\fR or \fBmu0\fR is the name for the tape device
and \fBht0\fR or \fBmt0\fR is the name
E 2
I 2
Which would look like ``tu0 at ht0 slave 0'',
where \fBtu0\fR is the name for the tape device and \fBht0\fR is the name
E 5
I 5
.Tn MASSBUS
adapters will not be accessible.
.Pp
.It uba%d at tr%d.
A
.Tn UNIBUS
adapter was found in
.Ql tr%d
(the
.Tn NEXUS
slot number).
.Tn UNIX
will call it
.Ql uba%d .
.Pp
.It dr32 unsupported (at tr %d).
A
.Tn DR Ns 32
interface was found in
a
.Tn NEXUS ,
for which
.Tn UNIX
does not have a driver.
.Pp
.It ci unsupported (at tr %d).
A
.Tn CI
interface was found in
a
.Tn NEXUS ,
for which
.Tn UNIX
does not have a driver.
.Pp
.It mcr%d at tr%d.
A memory controller was found in
.Ql tr%d
(the
.Tn NEXUS
slot number).
.Tn UNIX
will call it
.Ql mcr%d .
.Pp
.It 5 mcr's unsupported.
.Tn UNIX
supports only 4 memory controllers
per
.Tn CPU .
.Pp
.It mpm unsupported (at tr%d).
Multi-port memory is unsupported
in the sense that
.Tn UNIX
does not know how to poll it for
.Tn ECC
errors.
.Pp
.It %s%d at mba%d drive %d.
A tape formatter or a disk was found
on the
.Tn MASSBUS ;
for disks
.Ql %s%d
will look like
.Dq Li hp0 ,
for tape formatters
like
.Dq Li ht1 .
The drive number comes from the unit plug on the drive
or in the
.Tn TM
formatter
.Pf ( Em not
on the tape drive; see below).
.Pp
.It %s%d at %s%d slave %d.
(For
.Tn MASSBUS
devices).
Which would look like
.Dq Li tu0 at ht0 slave 0 ,
where
.Dq Li tu0
is the name for the tape device and
.Dq Li ht0
is the name
E 5
E 2
for the formatter.  A tape slave was found on the tape formatter at the
indicated drive number (on the front of the tape drive).
D 2
UNIX will call the device, e.g., \fBtu0\fR or \fBmu0\fR.
E 2
I 2
D 5
UNIX will call the device, e.g., \fBtu0\fR.
E 2
.PP
\fB%s%d at uba%d csr %o vec %o ipl %x\fR.  The device %s%d, e.g. dz0
was found on uba%d at control-status register address %o and with
device vector %o.  The device interrupted at priority level %x.
.PP
\fB%s%d at uba%d csr %o zero vector\fR.  The device did not present
E 5
I 5
.Ux
will call the device, e.g.,
.Dq Li tu0 .
.Pp
.It "%s%d at uba%d csr %o vec %o ipl %x."
The device
.Ql %s%d ,
e.g.
.Dq Li dz0
was found on
.Ql uba%d
at control-status register address
.Ql \&%o
and with
device vector
.Ql \&%o .
The device interrupted at priority level
.Ql \&%x .
.Pp
.It %s%d at uba%d csr %o zero vector.
The device did not present
E 5
a valid interrupt vector, rather presented 0 (a passive release condition)
to the adapter.
D 5
.PP
\fB%s%d at uba%d csr %o didn't interrupt\fR.  The device did not interrupt,
E 5
I 5
.Pp
.It %s%d at uba%d csr %o didn't interrupt.
The device did not interrupt,
E 5
likely because it is broken, hung, or not the kind of device it is advertised
to be.
D 5
.PP
\fB%s%d at %s%d slave %d\fR.  (For UNIBUS devices).
Which would look like ``up0 at sc0 slave 0'',
where \fBup0\fR is the name of a disk drive and \fBsc0\fR is the name
of the controller.  Analogous to MASSBUS case.
E 5
I 5
.Pp
.It %s%d at %s%d slave %d.
(For UNIBUS devices).
Which would look like 
.Dq Li up0 at sc0 slave 0 ,
where
.Dq Li up0
is the name of a disk drive and
.Dq Li sc0
is the name
of the controller.  Analogous to
.Tn MASSBUS
case.
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr boot 8 ,
.Xr config 8
.Sh HISTORY
The
.Nm
feature
appeared in
.Bx 4.1 .
E 5
D 2
.SH BUGS
Should write
.IR attach (8)
and system call it needs to work.
E 2
E 1
