share/man/man4/man4.vax/SCCS/s.cons.4
h48947
s 00002/00002/00122
d D 8.1 93/06/05 13:43:44 bostic 6 5
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00112/00042/00012
d D 6.3 91/03/27 23:51:24 cael 5 4
c  macro and text revision (-mdoc version 3)
e
s 00017/00006/00037
d D 6.2 86/05/19 16:33:41 karels 4 3
c 8600
e
s 00001/00001/00042
d D 6.1 85/05/15 17:17:55 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00004/00003/00039
d D 5.1 85/05/15 17:17:47 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00042/00000/00000
d D 4.1 85/05/15 17:17:39 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
D 5
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 5
I 5
D 6
.\" Copyright (c) 1980, 1991 Regents of the University of California.
.\" All rights reserved.
E 6
I 6
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 6
E 5
.\"
D 5
.\"	%W% (Berkeley) %G%
E 5
I 5
.\" %sccs.include.redist.man%
E 5
.\"
D 2
.TH CONS 4 4/1/81
E 2
I 2
D 3
.TH CONS 4 "27 July 1983"
E 3
I 3
D 5
.TH CONS 4 "%Q%"
E 3
E 2
.UC 4
.SH NAME
cons \- VAX-11 console interface
.SH DESCRIPTION
E 5
I 5
.\"     %W% (Berkeley) %G%
.\"
.Dd %Q%
.Dt CONS 4 vax
.Os BSD 4
.Sh NAME
.Nm cons
.Nd "VAX-11 console interface"
.Sh DESCRIPTION
E 5
The console is available to the processor through the console registers.
It acts like a normal terminal, except that when the local functions are
D 5
not disabled, control-P puts the console in local console mode (where
the prompt is ``>>>'').  The operation of the console in this mode varies
E 5
I 5
not disabled,
.Ic \&^P
(control-P) puts the console in local console mode (where
the prompt is
.Sq Li >>> ) .
The operation of the console in this mode varies
E 5
slightly per-processor.
D 5
.PP
E 5
I 5
.Ss Tn VAX No 11/780 or 785
On either the
.Tn VAX
11/780 or 785 the following commands may be used
after placing the console in local mode with
.Ic ^P .
.Pp
.Bl -tag -width continue -compact -offset 4n
.It Ic c
.It Ic continue
Re-enter conversational mode
if the processor was halted.
.Pp
.It Ic h
.It Ic halt
Halt the CPU.
E 5
D 4
On an 11/780 you can return to the conversational mode using the command
E 4
I 4
On an 11/780 or 785
the processor is not stopped by entering local console mode.
D 5
The CPU may be halted with the ``halt'' command, which may be abbreviated
to ``h.''
Conversational mode is re-entered by using the command
E 4
D 2
``se t p'' if the processor is still running or ``continue'' if it is halted.
E 2
I 2
``set t p'' (set terminal program) if the processor is still
D 4
running or ``continue'' if it is halted.
E 4
I 4
running, or ``continue'' if it is halted.
E 4
E 2
The latter command may be abbreviated ``c''.
D 4
If you hit the break key on the console, then the console will go into ODT
(console debugger mode).  Hit a ``P'' (upper-case letter p)
E 4
I 4
If you hit the break key on the console, then the console LSI-11
will go into ODT
(console debugger mode).  Hit a ``P'' (upper-case letter p; ``proceed'')
E 4
to get out of this mode.
.PP
E 5
I 5
.Pp
.It Ic set t p
(set terminal program)
Re-enter conversational mode
if the processor is still
running.
.Pp
.It Ic P
(proceed)
Get out of
.Tn ODT
mode.
.Pp
.It Ic <break>
If you hit the break key on the console, then the console
.Tn LSI Ns -11
will go into
.Tn ODT
(console debugger mode).
.El
.Pp
.Ss Tn VAX No 11/750 or 11/730
E 5
On an 11/750
D 2
..or an 11/730
E 2
I 2
or an 11/730
E 2
D 5
the processor is halted whenever the console is not in conversational mode,
and typing ``C'' returns to conversational mode.
When in console mode on an 11/750 which has a remote diagnosis module,
a ^D will put you in remote diagnosis mode, where the prompt will be ``RDM>''.
The command ``ret'' will return from remote diagnosis mode to local console
E 5
I 5
the processor is halted whenever the console is not in conversational mode.
.Pp
.Bl -tag -width continue -compact -offset 4n
.It Ic C
Return to conversational mode.
.Pp
.It Ic ret
Return from remote diagnosis mode to local console
E 5
mode.
D 5
.PP
I 4
The VAX 8600 (8650) console normally works in the same way as the 11/750,
E 5
I 5
.Pp
.It Ic \&^D
(11/750 only)
When in console mode on an 11/750 which has a remote diagnosis module,
a
.Ic \&^D
will put you in remote diagnosis mode, where the prompt will be
.ql RDM> .
.El
.Pp
.Ss Tn VAX No 8600 or 8650
The
.Tn VAX
8600 (8650) console normally works in the same way as the 11/750,
E 5
except that there are many additional modes and commands.
D 5
In the normal mode
control-P halts the processor, and ``c'' or ``continue'' returns to
E 5
I 5
.Pp
.Bl -tag -width continue -compact -offset 4n
.It Ic c
.It Ic continue
Return to
E 5
conversational mode.
D 5
If HEX debug is enabled, control-P does not halt the CPU; the ``halt''
command stops the CPU as on the 11/780.
.PP
E 4
With the above proviso's the console works like any other UNIX terminal.
.SH FILES
/dev/console
.SH "SEE ALSO"
tty(4), reboot(8)
.br
VAX Hardware Handbook
E 5
I 5
.Pp
.It Ic halt
Halt the processor if
.Tn HEX
debug enabled.
.Pp
.It Ic p
Halt the processor if in normal mode.
.El
.Pp
With the above proviso's the console works like any other
.Ux
terminal.
.Sh FILES
.Bl -tag -width /dev/console -compact
.It Pa /dev/console
.El
.Sh SEE ALSO
.Xr tty 4 ,
.Xr reboot 8
.Rs
.%T "VAX Hardware Handbook"
.Re
.Sh HISTORY
The
.Nm cons
interface
appeared in
.Bx 4.0 .
E 5
D 4
.SH DIAGNOSTICS
None.
E 4
E 1
