share/man/man4/man4.vax/SCCS/s.crl.4
h58697
s 00002/00002/00054
d D 8.1 93/06/05 13:43:49 bostic 5 4
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00048/00021/00008
d D 6.3 91/03/27 23:51:25 cael 4 3
c  macro and text revision (-mdoc version 3)
e
s 00001/00001/00028
d D 6.2 86/05/21 15:54:07 anne 3 2
c spelling
e
s 00000/00000/00029
d D 6.1 86/05/19 16:34:30 karels 2 1
c rev 6
e
s 00029/00000/00000
d D 1.1 86/05/19 16:34:06 karels 1 0
c new for 4.3
e
u
U
t
T
I 1
D 4
.\" Copyright (c) 1986 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 4
I 4
D 5
.\" Copyright (c) 1986, 1991 Regents of the University of California.
.\" All rights reserved.
E 5
I 5
.\" Copyright (c) 1986, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 5
E 4
.\"
D 4
.\"	%W% (Berkeley) %G%
E 4
I 4
.\" %sccs.include.redist.man%
E 4
.\"
D 4
.TH CRL 4 "%Q%"
.UC 6
.SH NAME
crl \- VAX 8600 console RL02 interface
.SH DESCRIPTION
This is a simple interface to the DEC RL02
E 4
I 4
.\"     %W% (Berkeley) %G%
.\"
.Dd %Q%
.Dt CRL 4 vax
.Os BSD 4.3
.Sh NAME
.Nm crl
.Nd
.Tn VAX
8600 console
.Tn RL Ns 02
interface
.Sh DESCRIPTION
This is a simple interface to the
.Tn DEC
.Tn RL Ns 02
E 4
disk unit which is part of the console
D 3
subsytem on the VAX 8600 and 8650.
E 3
I 3
D 4
subsystem on the VAX 8600 and 8650.
E 4
I 4
subsystem on the
.Tn VAX
8600 and 8650.
E 4
E 3
Access is given to the entire
D 4
RL02 disk; the pack format is the same
as that of RL02 disks on other controllers.
As on other VAX console media, transfers are done a word at a time
E 4
I 4
.Tn RL Ns 02
disk; the pack format is the same
as that of
.Tn RL Ns 02
disks on other controllers.
As on other
.Tn VAX
console media, transfers are done a word at a time
E 4
using privileged registers (i.e., slowly).
D 4
.PP
All I/O is raw; the seek addresses in raw transfers should be a multiple
E 4
I 4
.Pp
All
.Tn I/O
is raw; the seek addresses in raw transfers should be a multiple
E 4
of 512 bytes and a multiple of 512 bytes should be transferred,
D 4
as in other ``raw'' disk interfaces.
E 4
I 4
as in other
.Dq raw
disk interfaces.
E 4
(Although the sector size is actually 256 bytes, the driver allows
operations only on 512-byte boundaries.)
D 4
.SH FILES
/dev/crl
.SH SEE ALSO
arff(8V)
E 4
I 4
.Sh FILES
.Bl -tag -width /dev/crl -compact
.It Pa /dev/crl
.El
.Sh SEE ALSO
.Xr arff 8
.Sh HISTORY
The
.Nm
driver appeared in
.Bx 4.3 .
E 4
E 1
