share/man/man4/man4.vax/SCCS/s.css.4
h58896
s 00002/00002/00076
d D 8.1 93/06/05 13:43:53 bostic 4 3
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00059/00038/00019
d D 6.2 91/03/27 23:51:26 cael 3 2
c  macro and text revision (-mdoc version 3)
e
s 00001/00001/00056
d D 6.1 85/05/15 17:41:46 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00057/00000/00000
d D 5.1 85/05/15 17:41:40 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
D 3
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 3
I 3
D 4
.\" Copyright (c) 1983, 1991 Regents of the University of California.
.\" All rights reserved.
E 4
I 4
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 4
E 3
.\"
D 3
.\"	%W% (Berkeley) %G%
E 3
I 3
.\" %sccs.include.redist.man%
E 3
.\"
D 2
.TH CSS 4 "27 July 1983"
E 2
I 2
D 3
.TH CSS 4 "%Q%"
E 2
.UC 5
.SH NAME
css \- DEC IMP-11A LH/DH IMP interface
.SH SYNOPSIS
.B "pseudo-device imp"
.br
.B "device css0 at uba0 csr 167600 flags 10 vector cssrint cssxint"
.SH DESCRIPTION
E 3
I 3
.\"     %W% (Berkeley) %G%
.\"
.Dd %Q%
.Dt CSS 4 vax
.Os BSD 4.2
.Sh NAME
.Nm css
.Nd
.Tn DEC IMP-11A LH/DH IMP
interface
.Sh SYNOPSIS
.Cd "pseudo-device imp device css0 \&at uba0 csr 167600 flags 10 vector cssrint cssxint"
.Sh DESCRIPTION
E 3
The 
D 3
.I css
E 3
I 3
.Nm css
E 3
device provides a Local Host/Distant Host
D 3
interface to an IMP.  It is normally used when participating
in the DARPA Internet.  The controller itself is not accessible
to users, but instead provides the hardware support to the IMP
E 3
I 3
interface to an
.Tn IMP .
It is normally used when participating
in the
.Tn DARPA
Internet.  The controller itself is not accessible
to users, but instead provides the hardware support to the
.Tn IMP
E 3
interface described in
D 3
.IR imp (4).
When configuring, the 
.I imp
pseudo-device is also included.
.SH DIAGNOSTICS
.BR "css%d: not alive" .
E 3
I 3
.Xr imp 4 .
The configuration entry for the
.Xr imp
must also include the
.Em pseudo-device
as shown above.
.Sh DIAGNOSTICS
.Bl -diag
.It css%d: not alive.
E 3
The initialization routine was entered even though the device
did not autoconfigure.  This is indicates a system problem.
D 3
.PP
.BR "css%d: can't initialize" .
Insufficient UNIBUS resources existed to initialize the device.
E 3
I 3
.Pp
.It css%d: can't initialize.
Insufficient
.Tn UNIBUS
resources existed to initialize the device.
E 3
This is likely to occur when the device is run on a buffered
data path on an 11/750 and other network interfaces are also
configured to use buffered data paths, or when it is configured
to use buffered data paths on an 11/730 (which has none).
D 3
.PP
.BR "css%d: imp doesn't respond, icsr=%b" .
The driver attempted to initialize the device, but the IMP
E 3
I 3
.Pp
.It css%d: imp doesn't respond, icsr=%b.
The driver attempted to initialize the device, but the
.Tn IMP
E 3
failed to respond after 500 tries.  Check the cabling.
D 3
.PP
.BR "css%d: stray output interrupt csr=%b" .
E 3
I 3
.Pp
.It css%d: stray output interrupt csr=%b.
E 3
An interrupt occurred when no output had previously been started. 
D 3
.PP
.BR "css%d: output error, ocsr=%b icsr=%b" .
E 3
I 3
.Pp
.It css%d: output error, ocsr=%b icsr=%b.
E 3
The device indicated a problem sending data on output.
D 3
.PP
.BR "css%d: recv error, csr=%b" .
E 3
I 3
.Pp
.It css%d: recv error, csr=%b.
E 3
The device indicated a problem receiving data on input.
D 3
.PP
.BR "css%d: bad length=%d" .
E 3
I 3
.Pp
.It css%d: bad length=%d.
E 3
An input operation resulted in a data transfer of less than
0 or more than 1008 bytes of
data into memory (according to the word count register).
D 3
This should never happen as the maximum size of a host-IMP
E 3
I 3
This should never happen as the maximum size of a
.Pf host- Tn IMP
E 3
message is 1008 bytes.
I 3
.El
.Sh HISTORY
The
.Nm
interface appeared in
.Bx 4.2 .
E 3
E 1
