share/man/man4/man4.vax/SCCS/s.ct.4
h05804
s 00002/00002/00042
d D 8.1 93/06/05 13:43:57 bostic 6 5
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00041/00025/00003
d D 6.3 91/03/27 23:51:27 cael 5 4
c  macro and text revision (-mdoc version 3)
e
s 00002/00001/00026
d D 6.2 86/05/16 15:51:26 karels 4 3
c add APS
e
s 00001/00001/00026
d D 6.1 85/05/15 17:18:18 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00004/00004/00023
d D 5.1 85/05/15 17:18:09 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00027/00000/00000
d D 4.1 85/05/15 17:18:02 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
D 5
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 5
I 5
D 6
.\" Copyright (c) 1980, 1991 Regents of the University of California.
.\" All rights reserved.
E 6
I 6
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 6
E 5
.\"
D 5
.\"	%W% (Berkeley) %G%
E 5
I 5
.\" %sccs.include.redist.man%
E 5
.\"
D 2
.TH CT 4 5/10/81
E 2
I 2
D 3
.TH CT 4 "27 July 1983"
E 3
I 3
D 5
.TH CT 4 "%Q%"
E 3
E 2
.UC 4
.SH NAME
ct \- phototypesetter interface
.SH SYNOPSIS
D 2
device ct0 at uba0 csr 0167760 vector ctintr
E 2
I 2
.B "device ct0 at uba0 csr 0167760 vector ctintr"
E 2
.SH DESCRIPTION
D 2
This provides the interfact to a Graphic Systems C/A/T phototypesetter.
E 2
I 2
D 4
This provides an interface to a Graphic Systems C/A/T phototypesetter.
E 4
I 4
This provides an interface to a Graphic Systems C/A/T phototypesetter
or an Autologic APS-Micro5 using a DR11C interface.
E 4
E 2
Bytes written on the file specify font, size, and other control
information as well as the characters to be flashed.  The
D 2
coding will not be described here.
E 2
I 2
coding is not described here.
E 2
.PP
Only one process may have this file open at a time.  It is write-only.
.SH FILES
/dev/cat
.SH "SEE ALSO"
troff(1)
.br
Phototypesetter interface specification
.SH DIAGNOSTICS
E 5
I 5
.\"     %W% (Berkeley) %G%
.\"
.Dd %Q%
.Dt CT 4 vax
.Os BSD 4
.Sh NAME
.Nm \&ct
.Nd "C/A/T phototypesetter interface"
.Sh SYNOPSIS
.Cd "device ct0 at uba0 csr 0167760 vector ctintr"
.Sh DESCRIPTION
This is an interface to either a Graphic Systems
.Tn C/A/T
phototypesetter
or an Autologic
.Tn APS-Micro5
using a
.Tn DR-11 C
interface.
.Pp
The
.Nm \&ct
is a write only device.
.Sh FILES
.Bl -tag -width /dev/catxx -compact
.It Pa /dev/cat
.El
.Sh DIAGNOSTICS
E 5
None.
I 5
.Sh SEE ALSO
.Xr troff 1
.Rs
.%T Phototypesetter interface specification
.Re
.Sh HISTORY
The
.Nm \&ct
driver appeared in
.Bx 4.1 .
E 5
E 1
