share/man/man4/man4.vax/SCCS/s.ddn.4
h15638
s 00002/00002/00104
d D 8.1 93/06/05 13:44:00 bostic 6 5
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00092/00048/00014
d D 6.5 91/03/27 23:51:28 cael 5 4
c  macro and text revision (-mdoc version 3)
e
s 00001/00011/00061
d D 6.4 90/06/23 18:06:37 trent 4 3
c new copyright notice
e
s 00018/00003/00054
d D 6.3 89/02/14 17:34:22 bostic 3 2
c add Berkeley specific copyright notice
e
s 00003/00001/00054
d D 6.2 86/05/16 15:54:04 karels 2 1
c updates
e
s 00055/00000/00000
d D 6.1 85/08/08 18:55:23 mckusick 1 0
c date and time created 85/08/08 18:55:23 by mckusick
e
u
U
t
T
I 3
D 5
.\" Copyright (c) 1983 The Regents of the University of California.
E 5
I 5
D 6
.\" Copyright (c) 1983, 1991 The Regents of the University of California.
E 5
.\" All rights reserved.
E 6
I 6
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 6
.\"
D 4
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 4
I 4
.\" %sccs.include.redist.man%
E 4
.\"
E 3
I 1
D 5
.\"	%W% (Berkeley) %G%
E 5
I 5
.\"     %W% (Berkeley) %G%
E 5
.\"
D 5
.TH DDN 4 "%Q%"
.UC 6
.SH NAME
ddn \- DDN Standard Mode X.25 IMP interface
.SH SYNOPSIS
.B "device ddn0 at uba0 csr 166740 vector ddnintr"
.SH DESCRIPTION
E 5
I 5
.Dd %Q%
.Dt DDN 4 vax
.Os BSD 4.3
.Sh NAME
.Nm ddn
.Nd
.Tn DDN
Standard Mode
.Tn X.25
.Tn IMP
interface
.Sh SYNOPSIS
.Cd "device ddn0 at uba0 csr 166740 vector ddnintr"
.Sh DESCRIPTION
E 5
The 
D 5
.I ddn
device provides a DDN Standard Mode X.25 interface to an IMP using
the ACC ACP625 X.25 board.  It is normally used for connecting to
the Defense Data Network (DDN).  The controller itself is not accessible
E 5
I 5
.Nm ddn
device provides a
.Tn DDN
Standard Mode
.Tn X.25
interface to an
.Tn IMP
using
the
.Tn ACC ACP625
.Tn X.25
board.  It is normally used for connecting to
the Defense Data Network
.Pq Tn DDN .
The controller itself is not accessible
E 5
to users, but instead provides a network interface for the
Internet Protocol described in
D 2
.IR ip (4).
E 2
I 2
D 3
.IR ip (4P).
.SH SEE ALSO
intro(4N), ip(4P)
E 3
I 3
D 5
.IR ip (4).
E 3
E 2
.SH DIAGNOSTICS
.BR "ddn%d: not alive" .
E 5
I 5
.Xr ip 4 .
.Sh DIAGNOSTICS
.Bl -diag
.It ddn%d: not alive.
E 5
The initialization routine was entered even though the device
did not autoconfigure.  This indicates a system problem.
D 5
.PP
.BR "ddn%d: failed getting UBA resources for lcn %d" .
Insufficient UNIBUS resources existed to initialize the device.
This is likely to be a shortage of UNIBUS mapping registers.
.PP
.BR "ddn%d: couldn't get X25 init buffer" .
E 5
I 5
.Pp
.It ddn%d: failed getting UBA resources for lcn %d."
Insufficient
.Tn UNIBUS
resources existed to initialize the device.
This is likely to be a shortage of
.Tn UNIBUS
mapping registers.
.Pp
.It ddn%d: couldn't get X25 init buffer.
E 5
This indicates that an 
D 5
.I mbuf
E 5
I 5
.Em mbuf
E 5
could not be allocated for sending the initialization message to the
D 5
ACP625.
.PP
.BR "DDN: illegal X25 address length!"
.br
.BR "DDN: illegal X25 address format!"
.br
These errors indicate a problem with the called X.25 address received
from the IMP on an incoming call.
.PP
.BR "X25 RESET on lcn = %d" .
This indicates that an unexpected X.25 RESET was received on the
indicated LCN.
.PP
.BR "X25 INTERRUPT on lcn = %d, code = %d" .
This indicates that an unexpected X.25 INTERRUPT Packet was received on the
indicated LCN.
.PP
.BR "ddn%d: failed to get supr msg bfr!" .
E 5
I 5
.Tn ACP Ns 625.
.Pp
.It DDN: illegal X25 address length!
.It DDN: illegal X25 address format!
These errors indicate a problem with the called
.Tn X.25
address received
from the
.Tn IMP
on an incoming call.
.Pp
.It X25 RESET on lcn = %d.
This indicates that an unexpected
.Tn X.25
.Tn RESET
was received on the
indicated
.Tn LCN .
.Pp
.It X25 INTERRUPT on lcn = %d, code = %d.
This indicates that an unexpected
.Tn X.25
.Tn INTERRUPT
Packet was received on the
indicated
.Tn LCN .
.Pp
.It ddn%d: failed to get supr msg bfr!
E 5
This indicates that an 
D 5
.I mbuf
E 5
I 5
.Em mbuf
E 5
could not be allocated for sending a supervisor message to the
D 5
ACP625.
.PP
Any other error message from ddn%d: indicates a serious error
detected by either the driver or the ACP625 firmware.
I 3
.SH SEE ALSO
netintro(4), ip(4)
E 5
I 5
.Tn ACP625 .
.El
.Pp
Any other error message from
.Ql ddn%d:
indicates a serious error
detected by either the driver or the
.Tn ACP Ns 625
firmware.
.Sh SEE ALSO
.Xr netintro 4 ,
.Xr ip 4
.Sh HISTORY
The
.Nm
interface appeared in
.Bx 4.3 .
E 5
E 3
E 1
