share/man/man4/man4.vax/SCCS/s.de.4
h39353
s 00002/00002/00103
d D 8.1 93/06/05 13:44:04 bostic 6 5
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00072/00047/00033
d D 6.5 91/03/27 23:51:29 cael 5 4
c  macro and text revision (-mdoc version 3)
e
s 00001/00011/00079
d D 6.4 90/06/23 18:06:33 trent 4 3
c new copyright notice
e
s 00016/00005/00074
d D 6.3 89/02/14 17:34:24 bostic 3 2
c add Berkeley specific copyright notice
e
s 00006/00004/00073
d D 6.2 86/05/16 15:52:38 karels 2 1
c update trailers
e
s 00077/00000/00000
d D 6.1 86/02/17 17:26:04 sklower 1 0
c Manual Page for Digital Equipment UNIBUS Network Adapter(tm)[sic]
e
u
U
t
T
I 1
D 3
.\" Copyright (c) 1986 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 3
I 3
D 5
.\" Copyright (c) 1986 The Regents of the University of California.
E 5
I 5
D 6
.\" Copyright (c) 1986, 1991 The Regents of the University of California.
E 5
.\" All rights reserved.
E 6
I 6
.\" Copyright (c) 1986, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 6
E 3
.\"
I 3
D 4
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 4
I 4
.\" %sccs.include.redist.man%
E 4
.\"
E 3
D 5
.\"	%W% (Berkeley) %G%
E 5
I 5
.\"     %W% (Berkeley) %G%
E 5
.\"
D 5
.TH DE 4 "%Q%"
.UC 5
.SH NAME
de \- DEC DEUNA 10 Mb/s Ethernet interface
.SH SYNOPSIS
.B "device de0 at uba0 csr 174510 vector deintr"
.SH DESCRIPTION
E 5
I 5
.Dd %Q%
.Dt DE 4 vax
.Os BSD 4.2
.Sh NAME
.Nm de
.Nd
.Tn DEC DEUNA
10 Mb/s Ethernet interface
.Sh SYNOPSIS
.Cd "device de0 at uba0 csr 174510 vector deintr"
.Sh DESCRIPTION
E 5
The
D 5
.I de
E 5
I 5
.Nm de
E 5
interface provides access to a 10 Mb/s Ethernet network through
D 5
a Digital Equipment UNIBUS Network Adapter (DEUNA).
.PP
E 5
I 5
a Digital Equipment
.Tn UNIBUS
Network Adapter
.Pq Tn DEUNA .
.Pp
E 5
D 2
The host's Internet address is specified at boot time with an SIOCSIFADDR
E 2
I 2
Each of the host's network addresses
D 5
is specified at boot time with an SIOCSIFADDR
E 2
ioctl.  The
.I de
E 5
I 5
is specified at boot time with an
.Dv SIOCSIFADDR
.Xr ioctl 2 .
The
.Nm de
E 5
interface employs the address resolution protocol described in
D 3
.IR arp (4P)
E 3
I 3
D 5
.IR arp (4)
E 5
I 5
.Xr arp 4
E 5
E 3
to dynamically map between Internet and Ethernet addresses on the local
network.
D 5
.PP
The interface normally tries to use a ``trailer'' encapsulation
E 5
I 5
.Pp
The interface normally tries to use a
.Dq trailer
encapsulation
E 5
D 2
to minimize copying data on input and output.  This may be
disabled, on a per-interface basis, by setting the IFF_NOTRAILERS
E 2
I 2
to minimize copying data on input and output.
D 5
The use of trailers is negotiated with ARP.
E 5
I 5
The use of trailers is negotiated with
.Tn ARP .
E 5
This negotiation may be disabled, on a per-interface basis,
D 5
by setting the IFF_NOTRAILERS
E 2
flag with an SIOCSIFFLAGS ioctl.
.SH DIAGNOSTICS
\fBde%d: hardware address %s\fP.
E 5
I 5
by setting the
.Dv IFF_NOTRAILERS
flag with an 
.Dv SIOCSIFFLAGS
.Xr ioctl .
.Sh DIAGNOSTICS
.Bl -diag
.It de%d: hardware address %s.
E 5
This is a normal autoconfiguration message noting the 6 byte physical
ethernet address of the adapter.
D 5
.PP
\fBde%d: oerror, flags=%b tdrerr=%b (len=%d)\fP.
E 5
I 5
.Pp
.It de%d: oerror, flags=%b tdrerr=%b (len=%d).
E 5
The hardware indicated an error
in transmitting a packet to the cable.
The status and error flags are reported.
D 5
.PP
\fBde%d: ierror, flags=%b lenerr=%b (len=%d)\fP.
E 5
I 5
.Pp
.It de%d: ierror, flags=%b lenerr=%b (len=%d).
E 5
The hardware indicated an error
in reading a packet from the cable.
The status and error flags are reported.
D 5
.PP
\fBde%d: can't handle af%d\fP.  The interface was handed
E 5
I 5
.Pp
.It de%d: can't handle af%d.
The interface was handed
E 5
a message with addresses formatted in an unsuitable address
family; the packet was dropped.
D 5
.PP
\fBde%d: buffer unavailable\fP.  The interface received more packets
E 5
I 5
.Pp
.It de%d: buffer unavailable.
The interface received more packets
E 5
than it had buffers allocated to receive them.
D 5
.PP
\fBde%d: address change failed, csr0=%b csr1=%b\fP.
E 5
I 5
.Pp
.It de%d: address change failed, csr0=%b csr1=%b.
E 5
The interface was unable to reprogram
its physical ethernet address.
This may happen with very early models of the interface.
This facility is used only when
D 5
the controller is not the first network interface configured for XNS.
.PP
E 5
I 5
the controller is not the first network interface configured for
.Tn XNS .
.El
.Pp
E 5
The following messages indicate a probable hardware error performing
the indicated operation during autoconfiguration or initialization.
The two control and status registers
should indicate the nature of the failure.
See the hardware manual for details.
D 5
.PP
\fBde%d: reset failed, csr0=%b csr1=%b\fP.
.PP
\fBde%d: ppcb failed, csr0=%b csr1=%b\fP.
.PP
\fBde%d: read addr failed, csr0=%b csr1=%b\fP.
.PP
\fBde%d: wtring failed, csr0=%b csr1=%b\fP.
.PP
\fBde%d: wtmode failed, csr0=%b csr1=%b\fP.
.SH SEE ALSO
D 3
intro(4N), inet(4F), arp(4P)
E 3
I 3
netintro(4), inet(4), arp(4)
E 5
I 5
.Pp
.Bl -diag
.It de%d: reset failed, csr0=%b csr1=%b.
.It de%d: ppcb failed, csr0=%b csr1=%b.
.It de%d: read addr failed, csr0=%b csr1=%b.
.It de%d: wtring failed, csr0=%b csr1=%b.
.It de%d: wtmode failed, csr0=%b csr1=%b.
.El
.Sh SEE ALSO
.Xr netintro 4 ,
.Xr inet 4 ,
.Xr arp 4
.Sh HISTORY
The
.Nm
driver appeared in
.Bx 4.3 .
E 5
E 3
D 2
.SH BUGS
E 2
E 1
