share/man/man4/man4.vax/SCCS/s.dhu.4
h19027
s 00002/00002/00117
d D 8.1 93/06/05 13:44:18 bostic 4 3
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00108/00047/00011
d D 6.3 91/03/27 23:51:30 cael 3 2
c  macro and text revision (-mdoc version 3)
e
s 00004/00004/00054
d D 6.2 86/04/27 01:08:50 donn 2 1
c Make tty names correspond to MAKEDEV.
e
s 00058/00000/00000
d D 6.1 85/07/25 12:10:50 mckusick 1 0
c date and time created 85/07/25 12:10:50 by mckusick
e
u
U
t
T
I 1
D 3
.\" Copyright (c) 1985 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 3
I 3
D 4
.\" Copyright (c) 1985, 1991 Regents of the University of California.
.\" All rights reserved.
E 4
I 4
.\" Copyright (c) 1985, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 4
E 3
.\"
D 3
.\"	%W% (Berkeley) %G%
E 3
I 3
.\" %sccs.include.redist.man%
E 3
.\"
D 3
.TH DHU 4 "%Q%"
.UC 6
.SH NAME
dhu \- DHU-11 communications multiplexer
.SH SYNOPSIS
.B "device dhu0 at uba0 csr 0160440 vector dhurint dhuxint"
.SH DESCRIPTION
A DHU-11 provides 16 communication lines.
.PP
Each line attached to the DHU-11 communications multiplexer
behaves as described in
.IR tty (4).
Input and output for each line may independently
be set to run at any of 13 speeds (50, 200 and 38400 baud are not available);
E 3
I 3
.\"     %W% (Berkeley) %G%
.\"
.Dd %Q%
.Dt DHU 4 vax
.Os BSD 4.3
.Sh NAME
.Nm dhu
.Nd
.Tn DHU-11
communications multiplexer
.Sh SYNOPSIS
.Cd "device dhu0 at uba0 csr 0160440 vector dhurint dhuxint"
.Sh DESCRIPTION
A
.Tn DHU-11
provides 16 communication lines.
.Pp
An optional argument
.Ar flags
may be supplied with the device specification
in the config file indicating
that the line corresponding to
bit number
.Ar i
is not properly
connected, and should be treated as hard-wired with carrier
always present.  Thus specifying
.Ql flags 0x0004
for
.Li dhu0
would cause line
.Pa ttyS2
to be treated in this way.
.Pp
Normal I/O
control parameters for individual lines are managed by
.Xr ioctl 2
calls.
Individual
.Tn DHU-11
lines may be configured to run at any of 13 speeds
(50, 200 and 38400 baud are not available);
the speed may be set via
.Xr getty 8
or
.Xr stty 1
or may be communicated by other programs which
utilize
.Xr ioctl
such as
.Xr ifcongif 8 ,
E 3
see
D 3
.IR tty (4)
for the encoding.
.PP
Bit
.I i
of flags may be specified for a DHU-11 to say that a line is not properly
connected, and that the line should be treated as hard-wired with carrier
always present.  Thus specifying ``flags 0x0004'' in the specification of dhu0
D 2
would cause line ttyh2 to be treated in this way.
E 2
I 2
would cause line ttyS2 to be treated in this way.
E 2
.PP
The DHU-11 driver normally uses input silos
E 3
I 3
.Xr tty 4 .
.Pp
The
.Tn DHU-11
driver normally uses input silos
E 3
and delays receiver interrupts by 20 milliseconds
rather than taking an interrupt on each input character.
D 3
.SH FILES
D 2
/dev/tty[hi][0-9a-f]
E 2
I 2
/dev/tty[S-Z][0-9a-f]
E 2
.SH "SEE ALSO"
tty(4)
.SH DIAGNOSTICS
D 2
\fBdhu(%d,%d): NXM fault\fR.  No response from UNIBUS on a dma transfer
E 2
I 2
\fBdhu(%d,%d): NXM fault\fR.  No response from UNIBUS on a DMA transfer
E 2
within a timeout period.  This is often followed by a UNIBUS adapter
error.  This occurs most frequently when the UNIBUS is heavily loaded
D 2
and when devices which hog the bus (such as rk07's) are present.
E 2
I 2
and when devices which hog the bus (such as RK07s) are present.
E 3
I 3
.Sh FILES
.Bl -tag -width /dev/tty[S-Z][0-9a-f]xx -compact
.It Pa /dev/tty[S-Z][0-9a-f]
.El
.Sh DIAGNOSTICS
.Bl -diag
.It dhu(%d,%d): NXM fault.
No response from
.Tn UNIBUS
on a
.Tn DMA
transfer
within a timeout period.  This is often followed by a
.Tn UNIBUS
adapter
error.  This occurs most frequently when the
.Tn UNIBUS
is heavily loaded
and when devices which hog the bus (such as
.Tn RK07 Ns s )
are present.
E 3
E 2
It is not serious.
D 3
.PP
\fBdhu%d: silo overflow\fR.  The character input silo overflowed
E 3
I 3
.Pp
.It dhu%d: silo overflow.
The character input silo overflowed
E 3
before it could be serviced.  This can happen if a hard error occurs
D 3
when the CPU is running with elevated priority, as the system may
E 3
I 3
when the
.Tn CPU
is running with elevated priority, as the system may
E 3
then print a message on the console with interrupts disabled.
D 3
.SH NOTES
E 3
I 3
.El
.Sh NOTES
E 3
The driver currently does not make full use of the hardware
D 3
capabilities of the DHU-11, for dealing with XON/XOFF flow-control or hard-wired
E 3
I 3
capabilities of the
.Tn DHU-11 ,
for dealing with
.Tn XON/XOFF
flow-control or hard-wired
E 3
lines for example.
D 3
.PP
Although the devices are not the same, a DHU-11 can convince the
DH-11 autoconfiguration code that it is a DH-11.
.PP
E 3
I 3
.Pp
Although the devices are not the same, a
.Tn DHU-11
can convince the
.Tn DH-11
autoconfiguration code that it is a
.Tn DH-11 .
.Pp
E 3
The 4 40-way cables are a pain.
I 3
.Sh SEE ALSO
.Xr tty 4
.Sh HISTORY
The
.Nm
driver appeared in
.Bx 4.3 .
E 3
E 1
