share/man/man4/man4.vax/SCCS/s.dmv.4
h31703
s 00002/00002/00100
d D 8.1 93/06/05 13:44:39 bostic 3 2
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00080/00049/00022
d D 6.2 91/03/27 23:51:34 cael 2 1
c  macro and text revision (-mdoc version 3)
e
s 00071/00000/00000
d D 6.1 88/06/13 15:09:44 mckusick 1 0
c date and time created 88/06/13 15:09:44 by mckusick
e
u
U
t
T
I 1
D 2
.\" Copyright (c) 1988 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 2
I 2
D 3
.\" Copyright (c) 1988, 1991 Regents of the University of California.
.\" All rights reserved.
E 3
I 3
.\" Copyright (c) 1988, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 3
E 2
.\"
D 2
.\"	%W% (Berkeley) %G%
E 2
I 2
.\" %sccs.include.redist.man%
E 2
.\"
D 2
.TH DMV 4 "%Q%"
.UC 6
.SH NAME
dmv \- DEC DMV-11 point-to-point communications device
.SH SYNOPSIS
.B "device dmv0 at uba0 csr 167000 vector dmvrint dmvxint"
.SH DESCRIPTION
E 2
I 2
.\"     %W% (Berkeley) %G%
.\"
.Dd %Q%
.Dt DMV 4 vax
.Os BSD 4.3
.Sh NAME
.Nm dmv
.Nd
.Tn DEC
.Tn DMV-11
point-to-point communications device
.Sh SYNOPSIS
.Cd "device dmv0 at uba0 csr 167000 vector dmvrint dmvxint"
.Sh DESCRIPTION
E 2
The
D 2
.I dmv
E 2
I 2
.Nm dmv
E 2
interface provides access to a point-to-point communications
D 2
device which runs at up to 56 Kb/s.  DMV-11's communicate
using the DEC DDCMP link layer protocol.
.PP
The host's address must be specified with an SIOCSIFADDR ioctl,
and the destination address specified with a SIOCSIFDSTADDR ioctl,
E 2
I 2
device which runs at up to 56 Kb/s.
.Tn DMV-11 Ns s
communicate
using the
.Tn DEC
.Tn DDCMP
link layer protocol.
.Pp
The host's address must be specified with an
.Dv SIOCSIFADDR
.Xr ioctl 2 ,
and the destination address specified with a
.Dv SIOCSIFDSTADDR
.Xr ioctl ,
E 2
before the interface will transmit or receive any packets.
D 2
.SH ROUTING
The driver places a HOST entry in the kernel routing tables for the
address given in the SIOCSIFDSTADDR ioctl.  To use the DMV as a
E 2
I 2
.Sh ROUTING
The driver places a
.Tn HOST
entry in the kernel routing tables for the
address given in the
.Dv SIOCSIFDSTADDR
.Xr ioctl .
To use the
.Tn DMV
as a
E 2
link between local nets, the route to the remote net must be added manually
with the
D 2
.IR route (8)
E 2
I 2
.Xr route 8
E 2
command, or by the use of the routing process
D 2
.IR routed (8)
E 2
I 2
.Xr routed 8
E 2
on each end of the link.
D 2
.SH DIAGNOSTICS
.BR "dmvprobe: can't start device"
.BR "dmvprobe: device init failed, bsel4=%o, bsel6=%o"
E 2
I 2
.Sh DIAGNOSTICS
.Bl -diag
.It dmvprobe: can't start device.
.It "dmvprobe: device init failed, bsel4=%o, bsel6=%o."
E 2
The probe routine was unable to start the device.
D 2
.PP
.BR "dmvinit: dmv%d not running"
.BR "dmvrestart: can't start device"
.BR "dmv%d: device init failed, bsel4=%o, bsel6=%o"
E 2
I 2
.Pp
.It dmvinit: dmv%d not running.
.It dmvrestart: can't start device.
.It "dmv%d: device init failed, bsel4=%o, bsel6=%o."
E 2
The initialization/restart routine was unable to start the device.
D 2
.PP
.BR "dmv%d: far end on-line"
E 2
I 2
.Pp
.It dmv%d: far end on-line.
E 2
The other end of the connection has come online.
D 2
.PP
.BR "dmv%d: far end restart"
E 2
I 2
.Pp
.It dmv%d: far end restart.
E 2
The other end of the line has restarted.
D 2
.PP
.BR "dmv%d: bad control %o" .
E 2
I 2
.Pp
.It dmv%d: bad control %o.
E 2
A bad parameter was passed to the
D 2
.I dmvload
E 2
I 2
.Em dmvload
E 2
routine.
D 2
.PP
.BR "dmvxint: dmv%d bad rcv pkt addr 0x%x len 0x%x"
E 2
I 2
.Pp
.It "dmvxint: dmv%d bad rcv pkt addr 0x%x len 0x%x."
E 2
A bad packet was received.
D 2
.PP
.BR "dmv%d: bad packet address 0x%x"
E 2
I 2
.Pp
.It "dmv%d: bad packet address 0x%x."
E 2
An input packet was received which contained a type of
address unknown to the driver.
D 2
.PP
.BR "dmvxint: dmv%d unallocated packet 0x%x"
E 2
I 2
.Pp
.It "dmvxint: dmv%d unallocated packet 0x%x."
E 2
A protocol error has occured with the board.
D 2
.PP
.BR "dmvoutput, dmv%d can't handle af%d"
E 2
I 2
.Pp
.It "dmvoutput, dmv%d can't handle af%d."
E 2
A packet for an unsupported address family has been sent.
D 2
.PP
.BR "dmv%d: output timeout, bsel0=%b bsel2=%b"
E 2
I 2
.Pp
.It "dmv%d: output timeout, bsel0=%b bsel2=%b."
E 2
A device timeout occurred.
D 2
.PP
E 2
I 2
.El
.Pp
E 2
Numerous other device errors may be displayed.
D 2
.SH SEE ALSO
dmc(4), intro(4N), inet(4F)
E 2
I 2
.Sh SEE ALSO
.Xr dmc 4 ,
.Xr intro 4 ,
.Xr inet 4
.Sh HISTORY
The
.Nm
driver appeared in
.Bx 4.3 tahoe .
E 2
E 1
