share/man/man4/man4.vax/SCCS/s.dmz.4
h14352
s 00002/00002/00107
d D 8.1 93/06/05 13:44:53 bostic 5 4
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00089/00049/00020
d D 6.4 91/03/27 23:51:35 cael 4 3
c  macro and text revision (-mdoc version 3)
e
s 00008/00006/00061
d D 6.3 86/05/16 15:58:44 karels 3 2
c new silo handling
e
s 00000/00003/00067
d D 6.2 86/04/27 00:15:32 donn 2 1
c Prune irrelevant verbiage.
e
s 00070/00000/00000
d D 6.1 86/04/08 14:44:18 donn 1 0
c date and time created 86/04/08 14:44:18 by donn
e
u
U
t
T
I 1
D 4
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 4
I 4
D 5
.\" Copyright (c) 1983, 1991 Regents of the University of California.
.\" All rights reserved.
E 5
I 5
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 5
E 4
.\"
D 4
.\"	%W% (Berkeley) %G%
E 4
I 4
.\" %sccs.include.redist.man%
E 4
.\"
D 4
.TH DMZ 4 "April 7, 1986"
.UC 5
.SH NAME
dmz \- DMZ-32 terminal multiplexor
.SH SYNOPSIS
.B "device dmz0 at uba? csr 0160540"
.br
.ti +0.5i
.B "vector dmzrinta dmzxinta dmzrintb dmzxintb dmzrintc dmzxintc"
.SH DESCRIPTION
E 4
I 4
.\"     %W% (Berkeley) %G%
.\"
.Dd %Q%
.Dt DMZ 4 vax
.Os BSD 4.2
.Sh NAME
.Nm dmz
.Nd
.Tn DMZ-32
terminal multiplexor
.Sh SYNOPSIS
.Cd "device dmz0 at uba? csr 0160540" "vector dmzrinta dmzxinta dmzrintb dmzxintb dmzrintc dmzxintc"
.Sh DESCRIPTION
E 4
The 
D 4
.I dmz
E 4
I 4
.Nm dmz
E 4
device provides 24 lines of asynchronous serial line support.
D 2
The DMZ-32 is connected to an H3014 distribution panel
by a cable that may be up to a mile in length and
the two ends communicate using a T1 protocol.
E 2
Modem control on all ports is available
as an option for the H3014 distribution panel.
D 4
.PP
Each line attached to a DMZ-32 serial line port behaves as described
in
.IR tty (4).
Input and output for each line may independently be set to run at any
of 16 speeds; see
.IR tty (4)
for the encoding.
.PP
Bit
.I i
of flags may be specified for a
.I dmz
to to say that a line is not properly connected, and that the
line should be treated as hard-wired with carrier always present.
Thus specifying ``flags 0x000004'' in the specification of 
.IR dmz 0
E 4
I 4
.Pp
An optional argument
.Ar flags
may be supplied with the device specification for
.Nm dmz
in the config file indicating
that the line corresponding to
bit number
.Ar i
is not properly
connected, and should be treated as hard-wired with carrier
always present.  Thus specifying
.Ql flags 0x000004
for
.Li dmz0
E 4
would cause line
D 4
.I ttya2
E 4
I 4
.Pa ttya2
E 4
to be treated in this way.
D 4
.PP
E 4
I 4
.Pp
Normal
.Tn I/O
control parameters for individual lines are managed by
.Xr ioctl 2
calls.
Line speeds (there are 16 choices for the
.Tn DMZ )
may be initiated via
.Xr getty 8
and
.Xr stty 1
or may be communicated by other programs which
utilize
.Xr ioctl
such as
.Xr ifcongif 8 ,
see
.Xr tty 4  .
.Pp
E 4
The
D 4
.I dmz
E 4
I 4
.Nm dmz
E 4
D 3
driver normally uses input silos and polls for input at each clock
tick (10 milliseconds).
It uses an adaptive algorithm on output
to decide whether to use programmed I/O or DMA
based on the amount of data to send.
E 3
I 3
driver normally enables the input silos with a short timeout
(30 milliseconds); this allows multiple characters to be received
per interrupt during periods of high-speed input.
E 3
D 4
.SH FILES
D 3
/dev/tty[abc][0-9a-n]
E 3
I 3
/dev/tty[abcefg][0-9a-n]
E 3
.SH SEE ALSO
tty(4)
.SH DIAGNOSTICS
.BR "dmz%d: NXM line %d" .
No response from the UNIBUS on a DMA transfer
within a timeout period.  This is often followed by a UNIBUS adapter
error.  This occurs most frequently when the UNIBUS is heavily loaded
and when devices which hog the bus (such as RK07s) are present.
E 4
I 4
.Sh FILES
.Bl -tag -width /dev/tty[abcefg][0-9a-n] -compact
.It Pa /dev/tty[abcefg][0-9a-n]
.El
.Sh DIAGNOSTICS
.Bl -diag
.It dmz%d: NXM line %d.
No response from the
.Tn UNIBUS
on a
.Tn DMA
transfer
within a timeout period.  This is often followed by a
.Tn UNIBUS
adapter
error.  This occurs most frequently when the
.Tn UNIBUS
is heavily loaded
and when devices which hog the bus (such as
.Tn RK07 Ns s )
are present.
E 4
It is not serious.
D 4
.PP
.BR "dmz%d: silo overflow" .
E 4
I 4
.Pp
.It dmz%d: silo overflow.
E 4
The character input silo overflowed
before it could be serviced.  This can happen if a hard error occurs
D 4
when the CPU is running with elevated priority, as the system will
E 4
I 4
when the
.Tn CPU
is running with elevated priority, as the system will
E 4
then print a message on the console with interrupts disabled.
It is not serious.
I 3
D 4
.SH BUGS
E 4
I 4
.El
.Sh SEE ALSO
.Xr tty 4
.Sh HISTORY
The
.Nm
driver appeared in
.Bx 4.3 .
.Sh BUGS
E 4
It should be possible to set the silo timeout with a configuration file option,
as the value is a trade-off between efficiency and response time for flow
control and character echo.
E 3
E 1
