share/man/man4/man4.vax/SCCS/s.dmc.4
h60999
s 00002/00002/00130
d D 8.1 93/06/05 13:44:23 bostic 7 6
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00112/00061/00020
d D 6.5 91/03/27 23:51:31 cael 6 5
c  macro and text revision (-mdoc version 3)
e
s 00001/00001/00080
d D 6.4 87/01/30 13:33:33 bostic 5 4
c no
e
s 00002/00002/00079
d D 6.3 86/05/21 15:51:26 anne 4 3
c spelling corrections
e
s 00015/00006/00066
d D 6.2 86/05/16 15:58:53 karels 3 2
c new encapsulation
e
s 00028/00006/00044
d D 6.1 85/05/15 17:42:01 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00050/00000/00000
d D 5.1 85/05/15 17:41:54 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
D 6
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 6
I 6
D 7
.\" Copyright (c) 1983, 1991 Regents of the University of California.
.\" All rights reserved.
E 7
I 7
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 7
E 6
.\"
D 6
.\"	%W% (Berkeley) %G%
E 6
I 6
.\" %sccs.include.redist.man%
E 6
.\"
D 2
.TH DMC 4 "27 July 1983"
E 2
I 2
D 6
.TH DMC 4 "%Q%"
E 2
.UC 5
.SH NAME
dmc \- DEC DMC-11/DMR-11 point-to-point communications device
.SH SYNOPSIS
.B "device dmc0 at uba0 csr 167600 vector dmcrint dmcxint"
.SH DESCRIPTION
E 6
I 6
.\"     %W% (Berkeley) %G%
.\"
.Dd %Q%
.Dt DMC 4 vax
.Os BSD 4.2
.Sh NAME
.Nm dmc
.Nd
.Tn DEC
.Tn DMC-11 Ns / Tn DMR-11
point-to-point communications device
.Sh SYNOPSIS
.Cd "device dmc0 at uba0 csr 167600 vector dmcrint dmcxint"
.Sh DESCRIPTION
E 6
The
D 6
.I dmc
E 6
I 6
.Nm dmc
E 6
interface provides access to a point-to-point communications
D 6
device which runs at either 1 Mb/s or 56 Kb/s.  DMC-11's communicate
using the DEC DDCMP link layer protocol.
.PP
E 6
I 6
device which runs at either 1 Mb/s or 56 Kb/s.
.Tn DMC-11 Ns s
communicate
using the
.Tn DEC DDCMP
link layer protocol.
.Pp
E 6
The
D 6
.I dmc
interface driver also supports a DEC DMR-11 providing point-to-point
E 6
I 6
.Nm dmc
interface driver also supports a
.Tn DEC
.Tn DMR-11
providing point-to-point
E 6
communication running at data rates from 2.4 Kb/s to 1 Mb/s.
D 6
DMR-11's are a more recent design and thus are preferred over DMC-11's.
I 2
D 5
The NXMT and NRCV constants in the driver should be increased in this case,
E 5
I 5
The NXMT and NRCV constants in the driver may be increased in this case,
E 5
as the DMR can accept up to 64 transmit and receive buffers, as opposed
to 7 for the DMC.
E 2
.PP
D 2
The host's address must be specified with an SIOCSIFADDR ioctl
E 2
I 2
The configuration flags specify how to set up the device, 
.br
D 3
0 -- full duplex DDCMP
E 3
I 3
0 -- full duplex DDCMP (normal mode)
E 3
.br
1 -- DDCMP Maintence mode (generally useless)
.br
2 -- DDCMP Half Duplex, primary station
.br
3 -- DDCMP Half Duplex, secondary station
.ti
.PP
Several device error counters are available via "adb", for
more information see the adb script /usr/lib/adb/dmcstats, or the
DMC11 technical manual.
.PP
The host's address must be specified with an SIOCSIFADDR ioctl,
and the destination address specified with a SIOCSIFDSTADDR ioctl,
E 6
I 6
.Tn DMR-11 Ns s
are a more recent design and thus are preferred over
.Tn DMC-11 Ns s .
The
.Dv NXMT
and
.Dv NRCV
constants in the driver may be increased in this case,
as the
.Tn DMR
can accept up to 64 transmit and receive buffers, as opposed
to 7 for the
.Tn DMC .
.Pp
The configuration flags specify how to set up the device,
.Bl -column xxx -offset indent
0	full duplex DDCMP (normal mode)
1	DDCMP Maintence mode (generally useless)
2	DDCMP Half Duplex, primary station
3	DDCMP Half Duplex, secondary station
.El
.Pp
Several device error counters are available via
.Xr adb 1 ,
for
more information see the
.Xr adb
script
.Pa /usr/lib/adb/dmcstats ,
or the
.Tn DMC-11
technical manual.
.Pp
The host's address must be specified with an
.Dv SIOCSIFADDR
.Xr ioctl 2 ,
and the destination address specified with a
.Dv SIOCSIFDSTADDR
.Xr ioctl ,
E 6
E 2
D 3
before the interface will transmit or recive any packets.
E 3
I 3
before the interface will transmit or receive any packets.
E 3
I 2
D 6
.SH ROUTING
The driver places a HOST entry in the kernel routing tables for the
address given in the SIOCSIFDSTADDR ioctl.  To use the DMC as a
E 6
I 6
.Sh ROUTING
The driver places a
.Tn HOST
entry in the kernel routing tables for the
address given in the
.Dv SIOCSIFDSTADDR
.Xr ioctl.
To use the
.Tn DMC
as a
E 6
D 3
link between localnets, you must explicitly add the route with
the route(8) command.
E 3
I 3
link between local nets, the route to the remote net must be added manually
with the
D 6
.IR route (8)
E 6
I 6
.Xr route 8
E 6
command, or by the use of the routing process
D 6
.IR routed (8)
E 6
I 6
.Xr routed 8
E 6
on each end of the link.
E 3
E 2
D 6
.SH DIAGNOSTICS
.BR "dmc%d: bad control %o" .
E 6
I 6
.Sh DIAGNOSTICS
.Bl -diag
.It dmc%d: bad control %o.
E 6
A bad parameter was passed to the
D 6
.I dmcload
E 6
I 6
.Em dmcload
E 6
routine.
D 6
.PP
.BR "dmc%d: unknown address type %d" .
E 6
I 6
.Pp
.It dmc%d: unknown address type %d.
E 6
An input packet was received which contained a type of
address unknown to the driver.
D 6
.PP
D 3
.BR "DMC FATAL ERROR 0%o" .
E 3
I 3
.BR "DMC fatal error 0%o" .
E 3
I 2
D 4
A fatal error in DDMCP occured, causing the device to be restarted.
E 4
I 4
A fatal error in DDMCP occurred, causing the device to be restarted.
E 4
E 2
.PP
D 3
.BR "DMC SOFT ERROR 0%o" .
E 3
I 3
.BR "DMC soft error 0%o" .
E 3
I 2
D 4
A non-fatal error in DDMCP has occured. 
E 4
I 4
A non-fatal error in DDMCP has occurred. 
E 4
E 2
.PP
.BR "dmc%d: af%d not supported" . 
E 6
I 6
.Pp
.It DMC fatal error 0%o.
A fatal error in
.Tn DDMCP
occurred, causing the device to be restarted.
.Pp
.It DMC soft error 0%o.
A non-fatal error in
.Tn DDMCP
has occurred.
.Pp
.It dmc%d: af%d not supported.
E 6
The interface was handed a message which has
addresses formatted in an unsuitable address family.
D 6
.SH SEE ALSO
intro(4N), inet(4F)
I 3
.SH BUGS
E 6
I 6
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr inet 4
.Sh HISTORY
The
.Nm
driver appeared in
.Bx 4.2 .
.Sh BUGS
E 6
The current version of the driver uses a link-level encapsulation
so that multiple protocol types may be used.
It is thus incompatible with earlier drivers,
D 6
including the 4.2BSD version.
E 6
I 6
including the
.Bx 4.2
version.
E 6
E 3
D 2
.SH BUGS
Should allow multiple outstanding DMA requests, but due to
the design of the current UNIBUS support routines this is
very difficult.
E 2
E 1
