share/man/man4/man4.vax/SCCS/s.en.4
h57985
s 00002/00002/00118
d D 8.1 93/06/05 13:45:31 bostic 7 6
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00080/00047/00040
d D 6.5 91/03/27 23:51:39 cael 6 5
c  macro and text revision (-mdoc version 3)
e
s 00001/00011/00086
d D 6.4 90/06/23 18:06:24 trent 5 4
c new copyright notice
e
s 00015/00004/00082
d D 6.3 89/02/14 17:34:27 bostic 4 3
c add Berkeley specific copyright notice
e
s 00014/00014/00072
d D 6.2 86/05/16 15:52:28 karels 3 2
c update trailers
e
s 00001/00001/00085
d D 6.1 85/05/15 17:42:46 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00086/00000/00000
d D 5.1 85/05/15 17:42:38 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
D 4
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 4
I 4
D 6
.\" Copyright (c) 1983 The Regents of the University of California.
E 6
I 6
D 7
.\" Copyright (c) 1983, 1991 The Regents of the University of California.
E 6
.\" All rights reserved.
E 7
I 7
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 7
E 4
.\"
I 4
D 5
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 5
I 5
.\" %sccs.include.redist.man%
E 5
.\"
E 4
D 6
.\"	%W% (Berkeley) %G%
E 6
I 6
.\"     %W% (Berkeley) %G%
E 6
.\"
D 2
.TH EN 4 "27 July 1983"
E 2
I 2
D 6
.TH EN 4 "%Q%"
E 2
.UC 5
.SH NAME
en \- Xerox 3 Mb/s Ethernet interface
.SH SYNOPSIS
.B "device en0 at uba0 csr 161000 vector enrint enxint encollide"
.SH DESCRIPTION
E 6
I 6
.Dd %Q%
.Dt EN 4 vax
.Os BSD 4.2
.Sh NAME
.Nm en
.Nd Xerox 3 Mb/s Ethernet interface
.Sh SYNOPSIS
.Cd "device en0 at uba0 csr 161000 vector enrint enxint encollide"
.Sh DESCRIPTION
E 6
The
D 6
.I en
E 6
I 6
.Nm en
E 6
interface provides access to a 3 Mb/s Ethernet network.
D 6
Due to limitations in the hardware, DMA transfers
E 6
I 6
Due to limitations in the hardware,
.Tn DMA
transfers
E 6
to and from the network must take place in the lower 64K bytes
D 3
of the UNIBUS address space.
E 3
I 3
D 6
of the UNIBUS address space, and thus this must be among the first
UNIBUS devices enabled after boot.
E 3
.PP
E 6
I 6
of the
.Tn UNIBUS
address space, and thus this must be among the first
.Tn UNIBUS
devices enabled after boot.
.Pp
E 6
D 3
The network number is specified with a SIOCSIFADDR ioctl; the
host's address is discovered by probing the on-board Ethernet
address register.  No packets will be sent or accepted until 
a network number is supplied.
E 3
I 3
Each of the host's network addresses
D 6
is specified at boot time with an SIOCSIFADDR
ioctl.  The station address is discovered by probing the on-board Ethernet
E 6
I 6
is specified at boot time with an
.Dv SIOCSIFADDR
.Xr ioctl 2 .
The station address is discovered by probing the on-board Ethernet
E 6
address register, and is used to verify the protocol addresses.
No packets will be sent or accepted until 
a network address is supplied.
E 3
D 6
.PP
E 6
I 6
.Pp
E 6
The interface software implements an exponential backoff algorithm
when notified of a collision on the cable.  This algorithm utilizes
D 6
a 16-bit mask and the VAX-11's interval timer in calculating a series
E 6
I 6
a 16-bit mask and the
.Tn VAX-11 Ns 's
interval timer in calculating a series
E 6
of random backoff values.  The algorithm is as follows:
D 6
.TP 5
1.
E 6
I 6
.Pp
.Bl -enum -offset indent
.It
E 6
Initialize the mask to be all 1's.
D 6
.TP 5
2.
E 6
I 6
.It
E 6
If the mask is zero, 16 retries have been made and we give
up.
D 6
.TP 5
3.
E 6
I 6
.It
E 6
Shift the mask left one bit and formulate a backoff by
masking the interval timer with the mask (this is actually
the two's complement of the value).
D 6
.TP 5
4.
E 6
I 6
.It
E 6
Use the value calculated in step 3 to delay before retransmitting
the packet.
D 6
.PP
D 3
The interface handles both Internet and PUP protocol families,
with the interface address maintained in Internet format.
PUP addresses are converted to Internet addresses by subsituting
PUP network and host values for Internet network and local part
values.
.PP
The interface normally tries to use a ``trailer'' encapsulation
to minimize copying data on input and output.  This may be
disabled, on a per-interface basis, by setting the IFF_NOTRAILERS
E 3
I 3
The interface handles both Internet and NS protocol families.
It normally tries to use a ``trailer'' encapsulation
E 6
I 6
.El
.Pp
The interface handles both Internet and
.Tn NS
protocol families.
It normally tries to use a
.Dq trailer
encapsulation
E 6
to minimize copying data on input and output.
D 6
The use of trailers is negotiated with ARP.
E 6
I 6
The use of trailers is negotiated with
.Tn ARP .
E 6
This negotiation may be disabled, on a per-interface basis,
D 6
by setting the IFF_NOTRAILERS
E 3
flag with an SIOCSIFFLAGS ioctl.
.SH DIAGNOSTICS
.BR "en%d: output error" .
E 6
I 6
by setting the
.Dv IFF_NOTRAILERS
flag with an
.Dv SIOCSIFFLAGS
.Xr ioctl .
.Sh DIAGNOSTICS
.Bl -diag
.It en%d: output error.
E 6
The hardware indicated an error on
the previous transmission.
D 6
.PP
.BR "en%d: send error" .
E 6
I 6
.Pp
.It en%d: send error.
E 6
After 16 retransmissions using the
exponential backoff algorithm described above, the packet
was dropped.
D 6
.PP
.BR "en%d: input error" .
E 6
I 6
.Pp
.It en%d: input error.
E 6
The hardware indicated an error
in reading a packet off the cable.
D 6
.PP
.BR "en%d: can't handle af%d" .
E 6
I 6
.Pp
.It en%d: can't handle af%d.
E 6
The interface was handed
a message with addresses formatted in an unsuitable address
family; the packet was dropped.
D 6
.SH SEE ALSO
D 4
intro(4N), inet(4F)
E 4
I 4
netintro(4), inet(4)
E 4
.SH BUGS
E 6
I 6
.El
.Sh SEE ALSO
.Xr netintro 4 ,
.Xr inet 4
.Sh HISTORY
The
.Nm
driver appeared in
.Bx 4.2 .
.Sh BUGS
E 6
The device has insufficient buffering to handle back to
back packets.  This makes use in a production environment
painful.
D 6
.PP
The hardware does word at a time DMA without byte swapping.
E 6
I 6
.Pp
The hardware does word at a time
.Tn DMA
without byte swapping.
E 6
To compensate, byte swapping of user data must either be done 
by the user or by the system.  A kludge to byte swap only
D 6
IP packets is provided if the ENF_SWABIPS flag is defined in
the driver and set at boot time with an SIOCSIFFLAGS ioctl.
E 6
I 6
.Tn IP
packets is provided if the
.Dv ENF_SWABIPS
flag is defined in
the driver and set at boot time with an 
.Dv SIOCSIFFLAGS 
.Xr ioctl .
E 6
E 1
