share/man/man4/man4.vax/SCCS/s.ex.4
h31774
s 00002/00002/00080
d D 8.1 93/06/05 13:45:44 bostic 7 6
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00056/00034/00026
d D 6.6 91/03/27 23:51:40 cael 6 5
c  macro and text revision (-mdoc version 3)
e
s 00001/00011/00059
d D 6.5 90/06/23 18:06:19 trent 5 4
c new copyright notice
e
s 00016/00005/00054
d D 6.4 89/02/14 17:34:29 bostic 4 3
c add Berkeley specific copyright notice
e
s 00007/00005/00052
d D 6.3 86/05/16 15:52:32 karels 3 2
c update trailers
e
s 00001/00001/00056
d D 6.2 86/02/17 18:01:25 sklower 2 1
c correct config line.
e
s 00057/00000/00000
d D 6.1 86/02/17 17:59:27 sklower 1 0
c date and time created 86/02/17 17:59:27 by sklower
e
u
U
t
T
I 1
D 4
.\" Copyright (c) 1986 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 4
I 4
D 6
.\" Copyright (c) 1986 The Regents of the University of California.
E 6
I 6
D 7
.\" Copyright (c) 1986, 1991 The Regents of the University of California.
E 6
.\" All rights reserved.
E 7
I 7
.\" Copyright (c) 1986, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 7
E 4
.\"
I 4
D 5
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 5
I 5
.\" %sccs.include.redist.man%
E 5
.\"
E 4
D 6
.\"	%W% (Berkeley) %G%
E 6
I 6
.\"     %W% (Berkeley) %G%
E 6
.\"
D 6
.TH EX 4 "%Q%"
.UC 5
.SH NAME
ex \- Excelan 10 Mb/s Ethernet interface
.SH SYNOPSIS
D 2
.B "device ex0 at uba0 csr 164000 vector exrint excint"
E 2
I 2
.B "device ex0 at uba0 csr 164000 vector excdint"
E 2
.SH DESCRIPTION
E 6
I 6
.Dd %Q%
.Dt EX 4 vax
.Os BSD 4.2
.Sh NAME
.Nm ex
.Nd Excelan 10 Mb/s Ethernet interface
.Sh SYNOPSIS
.Cd "device ex0 at uba0 csr 164000 vector excdint"
.Sh DESCRIPTION
E 6
The
D 6
.I ex
E 6
I 6
.Nm ex
E 6
interface provides access to a 10 Mb/s Ethernet network through
D 3
an Excelan controller.
E 3
I 3
an Excelan controller used as a link-layer interface.
E 3
D 6
.PP
E 6
I 6
.Pp
E 6
D 3
The host's Internet address is specified at boot time with an SIOCSIFADDR
E 3
I 3
Each of the host's network addresses
D 6
is specified at boot time with an SIOCSIFADDR
E 3
ioctl.  The
.I ex
E 6
I 6
is specified at boot time with an
.Dv SIOCSIFADDR
.Xr ioctl 2 .
The
.Nm ex
E 6
interface employs the address resolution protocol described in
D 4
.IR arp (4P)
E 4
I 4
D 6
.IR arp (4)
E 6
I 6
.Xr arp 4
E 6
E 4
to dynamically map between Internet and Ethernet addresses on the local
network.
D 6
.PP
The interface normally tries to use a ``trailer'' encapsulation
E 6
I 6
.Pp
The interface normally tries to use a
.Dq trailer
encapsulation
E 6
D 3
to minimize copying data on input and output.  This may be
disabled, on a per-interface basis, by setting the IFF_NOTRAILERS
E 3
I 3
to minimize copying data on input and output.
D 6
The use of trailers is negotiated with ARP.
E 6
I 6
The use of trailers is negotiated with
.Tn ARP .
E 6
This negotiation may be disabled, on a per-interface basis,
D 6
by setting the IFF_NOTRAILERS
E 3
flag with an SIOCSIFFLAGS ioctl.
.SH DIAGNOSTICS
\fBex%d: HW %c.%c, NX %c.%c, hardware address %s\fP.
E 6
I 6
by setting the
.Dv IFF_NOTRAILERS
flag with an
.Dv SIOCSIFFLAGS
.Xr ioctl .
.Sh DIAGNOSTICS
.Bl -diag
.It "ex%d: HW %c.%c, NX %c.%c, hardware address %s."
E 6
This provides firmware revisions levels, and is expected during
autoconfiguration.
D 6
.PP
\fBex%d: can't initialize\fP.
E 6
I 6
.Pp
.It ex%d: can't initialize.
E 6
There was a failure in allocating unibus resources for the device.
D 6
.PP
\fBex%d: configuration failed; cc = %x\fP.
E 6
I 6
.Pp
.It "ex%d: configuration failed; cc = %x."
E 6
The hardware indicated an error when trying to initalize itself.
The error code returned is described at length in the device
Reference Manual.
D 6
.PP
\fBex%d: receive error %b\fP.  The hardware indicated an error
E 6
I 6
.Pp
.It ex%d: receive error %b.
The hardware indicated an error
E 6
in reading a packet from the cable.
Specific Error bits are provided
D 6
.PP
\fBex%d: transmit error %b\fP.  The hardware indicated an error
E 6
I 6
.Pp
.It ex%d: transmit error %b.
The hardware indicated an error
E 6
in transmitting a packet to the cable or an illegally sized packet.
Specific Error bits are provided
D 6
.PP
\fBex%d: can't handle af%d\fP.  The interface was handed
E 6
I 6
.Pp
.It ex%d: can't handle af%d.
The interface was handed
E 6
a message with addresses formatted in an unsuitable address
family; the packet was dropped.
D 6
.SH SEE ALSO
D 4
intro(4N), inet(4F), arp(4P)
E 4
I 4
netintro(4), inet(4), arp(4)
E 6
I 6
.El
.Sh SEE ALSO
.Xr netintro 4 ,
.Xr inet 4 ,
.Xr arp 4
.Sh HISTORY
The
.Nm
driver appeared in
.Bx 4.3 .
E 6
E 4
D 3
.SH BUGS
E 3
E 1
