share/man/man4/man4.vax/SCCS/s.fl.4
h00500
s 00002/00002/00045
d D 8.1 93/06/05 13:45:53 bostic 6 5
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00037/00021/00010
d D 6.3 91/03/27 23:51:40 cael 5 4
c  macro and text revision (-mdoc version 3)
e
s 00001/00001/00030
d D 6.2 86/05/21 15:55:19 anne 4 3
c spelling
e
s 00001/00001/00030
d D 6.1 85/05/15 17:20:10 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00004/00005/00027
d D 5.1 85/05/15 17:20:02 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00032/00000/00000
d D 4.1 85/05/15 17:19:55 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
D 5
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 5
I 5
D 6
.\" Copyright (c) 1980, 1991 Regents of the University of California.
.\" All rights reserved.
E 6
I 6
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 6
E 5
.\"
D 5
.\"	%W% (Berkeley) %G%
E 5
I 5
.\" %sccs.include.redist.man%
E 5
.\"
D 2
.TH FL 4 5/11/81
E 2
I 2
D 3
.TH FL 4 "27 July 1983"
E 3
I 3
D 5
.TH FL 4 "%Q%"
E 3
E 2
.UC 4
.SH NAME
D 2
fl \- floppy interface
E 2
I 2
fl \- console floppy interface
E 2
.SH DESCRIPTION
D 2
.PP
This is a simple interface to the D.E.C. RX01
E 2
I 2
This is a simple interface to the DEC RX01
E 5
I 5
.\"     %W% (Berkeley) %G%
.\"
.Dd %Q%
.Dt FL 4 vax
.Os BSD 4
.Sh NAME
.Nm fl
.Nd console floppy interface
.Sh DESCRIPTION
This is a simple interface to the
.Tn DEC
.Tn RX01
E 5
E 2
floppy disk unit, which is part of the console
D 4
LSI-11 subsytem for VAX-11/780's.
E 4
I 4
D 5
LSI-11 subsystem for VAX-11/780's.
E 5
I 5
.Tn LSI-11
subsystem for
.Tn VAX-11/780 Ns s .
E 5
E 4
Access is given to the entire
floppy consisting of 77 tracks of 26 sectors of 128 bytes.
D 5
.PP
All i/o is raw; the seek addresses in raw transfers should be a multiple
E 5
I 5
.Pp
All I/O is raw; the seek addresses in raw transfers should be a multiple
E 5
of 128 bytes and a multiple of 128 bytes should be transferred,
D 5
as in other ``raw'' disk interfaces.
.SH FILES
/dev/floppy
.SH SEE ALSO
D 2
arff(8)
E 2
I 2
arff(8V)
E 2
.SH DIAGNOSTICS
E 5
I 5
as in other
.Dq raw
disk interfaces.
.Sh FILES
.Bl -tag -width /dev/floppy -compact
.It Pa /dev/floppy
.El
.Sh DIAGNOSTICS
E 5
None.
D 5
.SH BUGS
E 5
I 5
.Sh SEE ALSO
.Xr arff 8
.Sh HISTORY
The
.Nm
driver appeared in
.Bx 4.0 .
.Sh BUGS
E 5
Multiple console floppies are not supported.
D 5
.PP
E 5
I 5
.Pp
E 5
If a write is given with a count not a multiple of 128 bytes then
the trailing portion of the last sector will be zeroed.
E 1
