share/man/man4/man4.vax/SCCS/s.hdh.4
h54366
s 00002/00002/00096
d D 8.1 93/06/05 13:46:00 bostic 5 4
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00087/00051/00011
d D 6.4 91/03/27 23:51:41 cael 4 3
c  macro and text revision (-mdoc version 3)
e
s 00001/00011/00061
d D 6.3 90/06/23 18:06:15 trent 3 2
c new copyright notice
e
s 00017/00000/00055
d D 6.2 89/02/14 17:34:31 bostic 2 1
c add Berkeley specific copyright notice
e
s 00055/00000/00000
d D 6.1 85/08/08 18:55:40 mckusick 1 0
c date and time created 85/08/08 18:55:40 by mckusick
e
u
U
t
T
I 2
D 4
.\" Copyright (c) 1983 The Regents of the University of California.
E 4
I 4
D 5
.\" Copyright (c) 1983, 1991 The Regents of the University of California.
E 4
.\" All rights reserved.
E 5
I 5
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 5
.\"
D 3
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 3
I 3
.\" %sccs.include.redist.man%
E 3
.\"
E 2
I 1
D 4
.\"	%W% (Berkeley) %G%
E 4
I 4
.\"     %W% (Berkeley) %G%
E 4
.\"
D 4
.TH HDH 4 "%Q%"
.UC 6
.SH NAME
hdh \- ACC IF-11/HDH IMP interface
.SH SYNOPSIS
.B "pseudo-device imp"
.br
.B "device hdh0 at uba0 csr 166740 vector hdhintr"
.SH DESCRIPTION
E 4
I 4
.Dd %Q%
.Dt HDH 4 vax
.Os BSD 4.3
.Sh NAME
.Nm hdh
.Nd
.Tn ACC
.Tn IF-11/HDH 
.Tn IMP
interface
.Sh SYNOPSIS
.Cd "pseudo-device imp"
.Cd "device hdh0 at uba0 csr 166740 vector hdhintr"
.Sh DESCRIPTION
E 4
The 
D 4
.I hdh
device provides an HDLC Host (HDH)
interface to an IMP.  It is normally used when participating
in the DARPA Internet.  The controller itself is not accessible
to users, but instead provides the hardware support to the IMP
E 4
I 4
.Nm hdh
device provides an
.Tn HDLC
Host
.Pq Tn HDH
interface to an
.Tn IMP .
It is normally used when participating
in the
.Tn DARPA
Internet.  The controller itself is not accessible
to users, but instead provides the hardware support to the
.Tn IMP
E 4
interface described in
D 4
.IR imp (4).
When configuring, the 
.I imp
pseudo-device must also be included.
.SH DIAGNOSTICS
.BR "hdh%d: not alive" .
E 4
I 4
.Xr imp 4 .
The configuration entry for the
.Tn IMP
must also include the
.Em pseudo-device
as shown above in the
.Sx SYNOPSIS .
.Sh DIAGNOSTICS
.Bl -diag
.It hdh%d: not alive.
E 4
The initialization routine was entered even though the device
did not autoconfigure.  This indicates a system problem.
D 4
.PP
.BR "hdh%d: cannot get chan %d uba resources" .
Insufficient UNIBUS resources existed to initialize the device.
This is likely to be a shortage of UNIBUS mapping registers.
.PP
.BR "hdh%d: LINE UP" .
This indicates that both the HDLC and HDH protocols have declared the
link to the IMP alive.
.PP
.BR "hdh%d: LINE DOWN" .
This indicates that the link to the IMP has died.
.PP
.BR "hdh%d: HOST SEQUENCE ERROR"
.br
.BR "hdh%d: IMP SEQUENCE ERROR"
.br
.BR "hdh%d: HOST DATA ERROR"
.br
.BR "hdh%d: TIMEOUT"
.br
These errors indicate that an HDH protocol error has been detected.
.PP
.BR "hdh%d: cannot get supervisor cmnd buffer" .
E 4
I 4
.Pp
.It hdh%d: cannot get chan %d uba resources.
Insufficient
.Tn UNIBUS
resources existed to initialize the device.
This is likely to be a shortage of
.Tn UNIBUS
mapping registers.
.Pp
.It hdh%d: LINE UP.
This indicates that both the
.Tn HDLC
and
.Tn HDH
protocols have declared the
link to the
.Tn IMP
alive.
.Pp
.It hdh%d: LINE DOWN.
This indicates that the link to the
.Tn IMP
has died.
.Pp
.It hdh%d: TIMEOUT.
.It hdh%d: HOST DATA ERROR.
.It hdh%d: IMP SEQUENCE ERROR.
.It hdh%d: HOST SEQUENCE ERROR.
These errors indicate that an
.Tn HDH
protocol error has been detected.
.Pp
.It hdh%d: cannot get supervisor cmnd buffer.
E 4
This error indicates that an
D 4
.I mbuf
could not be allocated to send a command to the IF-11/HDH.
.PP
E 4
I 4
.Em mbuf
could not be allocated to send a command to the
.Tn IF-11/HDH .
.El
.Pp
E 4
Any other error message from hdh%d: indicates a serious error
D 4
detected by either the driver or the IF-11/HDH firmware.
I 2
.SH "SEE ALSO"
netintro(4)
E 4
I 4
detected by either the driver or the
.Tn IF-11/HDH
firmware.
.Sh SEE ALSO
.Xr netintro 4
.Sh HISTORY
The
.Nm
driver appeared in
.Bx 4.3 .
E 4
E 2
E 1
