share/man/man4/man4.vax/SCCS/s.hy.4
h49355
s 00002/00002/00108
d D 8.1 93/06/05 13:46:34 bostic 6 5
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00062/00043/00048
d D 6.4 91/03/27 23:51:45 cael 5 4
c  macro and text revision (-mdoc version 3)
e
s 00001/00011/00090
d D 6.3 90/06/23 18:06:11 trent 4 3
c new copyright notice
e
s 00015/00004/00086
d D 6.2 89/02/14 17:34:33 bostic 3 2
c add Berkeley specific copyright notice
e
s 00001/00001/00089
d D 6.1 85/05/15 17:43:03 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00090/00000/00000
d D 5.1 85/05/15 17:42:56 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
D 3
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 3
I 3
D 5
.\" Copyright (c) 1983 The Regents of the University of California.
E 5
I 5
D 6
.\" Copyright (c) 1983, 1991 The Regents of the University of California.
E 5
.\" All rights reserved.
E 6
I 6
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 6
E 3
.\"
I 3
D 4
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 4
I 4
.\" %sccs.include.redist.man%
E 4
.\"
E 3
D 5
.\"	%W% (Berkeley) %G%
E 5
I 5
.\"     %W% (Berkeley) %G%
E 5
.\"
D 2
.TH HY 4 "27 July 1983"
E 2
I 2
D 5
.TH HY 4 "%Q%"
E 2
.UC 5
.SH NAME
hy \- Network Systems Hyperchannel interface
.SH SYNOPSIS
.B "device hy0 at uba0 csr 0172410 vector hyint"
.SH DESCRIPTION
E 5
I 5
.Dd %Q%
.Dt HY 4 vax
.Os BSD 4.2
.Sh NAME
.Nm hy
.Nd Network Systems Hyperchannel interface
.Sh SYNOPSIS
.Cd "device hy0 at uba0 csr 0172410 vector hyint"
.Sh DESCRIPTION
E 5
The
D 5
.I hy
E 5
I 5
.Nm hy
E 5
interface provides access to a Network
Systems Corporation Hyperchannel Adapter.
D 5
.PP
E 5
I 5
.Pp
E 5
The network to which the interface is attached
D 5
is specified at boot time with an SIOCSIFADDR ioctl.  
E 5
I 5
is specified at boot time with an
.Dv SIOCSIFADDR
.Xr ioctl 2 .  
E 5
The host's address is discovered by reading the adapter status
register.  The interface will not transmit or receive
packets until the network number is known.
D 5
.SH DIAGNOSTICS
\fBhy%d: unit number 0x%x port %d type %x microcode level 0x%x\fP.
E 5
I 5
.Sh DIAGNOSTICS
.Bl -diag
.It "hy%d: unit number 0x%x port %d type %x microcode level 0x%x."
E 5
Identifies the device during autoconfiguration.
D 5
.PP
\fBhy%d: can't handle af%d\fP.  The interface was handed
E 5
I 5
.Pp
.It hy%d: can't handle af%d.
The interface was handed
E 5
a message with addresses formatted in an unsuitable address
family; the packet was dropped.
D 5
.PP
\fBhy%d: can't initialize\fP.
The interface was unable to allocate UNIBUS resources. This
E 5
I 5
.Pp
.It hy%d: can't initialize.
The interface was unable to allocate
.Tn UNIBUS
resources. This
E 5
is usually due to having too many network devices on an 11/750
where there are only 3 buffered data paths.
D 5
.PP
\fBhy%d: NEX - Non Existent Memory\fP.
E 5
I 5
.Pp
.It hy%d: NEX - Non Existent Memory.
E 5
Non existent memory error returned from hardware.
D 5
.PP
\fBhy%d:  BAR overflow\fP.  Bus address register
E 5
I 5
.Pp
.It hy%d:  BAR overflow.
Bus address register
E 5
overflow error returned from hardware.
D 5
.PP
\fBhy%d: Power Off bit set, trying to reset\fP.
E 5
I 5
.Pp
.It hy%d: Power Off bit set, trying to reset.
E 5
Adapter has lost power, driver will reset the bit
and see if power is still out in the adapter.
D 5
.PP
\fBhy%d: Power Off Error, network shutdown\fP.
E 5
I 5
.Pp
.It hy%d: Power Off Error, network shutdown.
E 5
Power was really off in the adapter, network
connections are dropped.
Software does not shut down the network unless
power has been off for a while.
D 5
.PP
\fBhy%d: RECVD MP > MPSIZE (%d)\fP.
E 5
I 5
.Pp
.It hy%d: RECVD MP > MPSIZE (%d).
E 5
A message proper was received that is too big.
Probable a driver bug.
Shouldn't happen.
D 5
.PP
\fBhy%d: xmit error \- len > hy_olen [%d > %d]\fP.
E 5
I 5
.Pp
.It "hy%d: xmit error \- len > hy_olen [%d > %d]."
E 5
Probable driver error.
Shouldn't happen.
D 5
.PP
\fBhy%d: DRIVER BUG \- INVALID STATE %d\fP.
E 5
I 5
.Pp
.It hy%d: DRIVER BUG \- INVALID STATE %d.
E 5
The driver state machine reached a non-existent state.
Definite driver bug.
D 5
.PP
\fBhy%d: watchdog timer expired\fP.
E 5
I 5
.Pp
.It hy%d: watchdog timer expired.
E 5
A command in the adapter has taken too long to complete.
Driver will abort and retry the command.
D 5
.PP
\fBhy%d: adapter power restored\fP.
E 5
I 5
.Pp
.It hy%d: adapter power restored.
E 5
Software was able to reset the power off bit,
indicating that the power has been restored.
D 5
.SH SEE ALSO
D 3
intro(4N), inet(4F)
E 3
I 3
netintro(4), inet(4)
E 3
.SH BUGS
E 5
I 5
.El
.Sh SEE ALSO
.Xr netintro 4 ,
.Xr inet 4
.Sh HISTORY
The
.Nm
interface appeared in
.Bx 4.2 .
.Sh BUGS
E 5
If the adapter does not respond to the status command
issued during autoconfigure, the adapter is assumed down.
A reboot is required to recognize it.
D 5
.PP
E 5
I 5
.Pp
E 5
The adapter power fail interrupt seems to occur
sporadically when power has, in fact, not failed.
The driver will believe that power has failed
only if it can not reset the power fail latch after
D 5
a ``reasonable'' time interval.
E 5
I 5
a
.Dq reasonable
time interval.
E 5
These seem to appear about 2-4 times a day on some machines.
There seems to be no correlation with adapter
rev level, number of ports used etc. and whether a
D 5
machine will get these ``bogus powerfails''.
E 5
I 5
machine will get these
.Dq bogus powerfails .
E 5
They don't seem to cause any real problems so they have
been ignored.
E 1
