share/man/man4/man4.vax/SCCS/s.ik.4
h50510
s 00002/00002/00060
d D 8.1 93/06/05 13:46:43 bostic 4 3
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00044/00022/00018
d D 6.2 91/03/27 23:51:46 cael 3 2
c  macro and text revision (-mdoc version 3)
e
s 00001/00001/00039
d D 6.1 85/05/15 17:43:17 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00040/00000/00000
d D 5.1 85/05/15 17:43:12 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
D 3
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 3
I 3
D 4
.\" Copyright (c) 1983, 1991 Regents of the University of California.
.\" All rights reserved.
E 4
I 4
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 4
E 3
.\"
D 3
.\"	%W% (Berkeley) %G%
E 3
I 3
.\" %sccs.include.redist.man%
E 3
.\"
D 2
.TH IK 4 "27 July 1983"
E 2
I 2
D 3
.TH IK 4 "%Q%"
E 2
.UC 5
.SH NAME
ik \- Ikonas frame buffer, graphics device interface
.SH SYNOPSIS
.B "device ik0 at uba? csr 0172460 vector ikintr"
.SH DESCRIPTION
.I Ik
E 3
I 3
.\"     %W% (Berkeley) %G%
.\"
.Dd %Q%
.Dt IK 4 vax
.Os BSD 4.2
.Sh NAME
.Nm ik
.Nd "Ikonas frame buffer, graphics device interface"
.Sh SYNOPSIS
.Cd "device ik0 at uba? csr 0172460 vector ikintr"
.Sh DESCRIPTION
The
.Nm ik
driver
E 3
provides an interface to an Ikonas frame buffer graphics device.
Each minor device is a different frame buffer interface board.
When the device is opened, its interface registers are mapped,
via virtual memory, into the user processes address space.
This allows the user process very high bandwidth to the frame buffer
with no system call overhead.
D 3
.PP
Bytes written or read from the device are DMA'ed from or to the interface.
The frame buffer XY address, its addressing mode, etc. must be set up by the
E 3
I 3
.Pp
Bytes written or read from the device are
.Tn DMA Ns 'ed
from or to the interface.
The frame buffer
.Tn XY
address, its addressing mode, etc. must be set up by the
E 3
user process before calling write or read.
D 3
.PP
E 3
I 3
.Pp
E 3
Other communication with the driver is via ioctls.
D 3
The IK_GETADDR ioctl returns the virtual address where the user process can
E 3
I 3
The
.Dv IK_GETADDR
.Xr ioctl 2
returns the virtual address where the user process can
E 3
find the interface registers.
D 3
The IK_WAITINT ioctl suspends the user process until the ikonas device
E 3
I 3
The
.Dv IK_WAITINT
.Xr ioctl
suspends the user process until the ikonas device
E 3
has interrupted (for whatever reason \(em the user process has to set
the interrupt enables).
D 3
.SH FILES
/dev/ik
.SH DIAGNOSTICS
E 3
I 3
.Sh FILES
.Bl -tag -width /dev/ikxx -compact
.It Pa /dev/ik
.El
.Sh DIAGNOSTICS
E 3
None.
D 3
.SH BUGS
E 3
I 3
.Sh HISTORY
The
.Nm
driver appeared in
.Bx 4.2 .
.Sh BUGS
E 3
An invalid access (e.g., longword) to a mapped interface register
can cause the system to crash with a machine check.
A user process could possibly cause infinite interrupts hence
bringing things to a crawl.
E 1
