share/man/man4/man4.vax/SCCS/s.il.4
h42376
s 00002/00002/00081
d D 8.1 93/06/05 13:46:49 bostic 9 8
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00057/00042/00026
d D 6.7 91/03/27 23:51:47 cael 8 7
c  macro and text revision (-mdoc version 3)
e
s 00001/00011/00067
d D 6.6 90/06/23 18:06:07 trent 7 6
c new copyright notice
e
s 00016/00005/00062
d D 6.5 89/02/14 17:34:35 bostic 6 5
c add Berkeley specific copyright notice
e
s 00005/00001/00062
d D 6.4 86/06/01 00:46:13 mis 5 4
c added diagnostics.
e
s 00008/00006/00055
d D 6.3 86/05/16 15:52:35 karels 4 3
c update trailers
e
s 00022/00002/00039
d D 6.2 86/02/17 17:31:55 sklower 3 2
c Document additional diagnostics, note XNS support and caution, specify board model # to distinguish from NP100.
e
s 00001/00001/00040
d D 6.1 85/05/15 17:43:33 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00041/00000/00000
d D 5.1 85/05/15 17:43:27 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
D 6
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 6
I 6
D 8
.\" Copyright (c) 1983 The Regents of the University of California.
E 8
I 8
D 9
.\" Copyright (c) 1983, 1991 The Regents of the University of California.
E 8
.\" All rights reserved.
E 9
I 9
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 9
E 6
.\"
I 6
D 7
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 7
I 7
.\" %sccs.include.redist.man%
E 7
.\"
E 6
D 8
.\"	%W% (Berkeley) %G%
E 8
I 8
.\"     %W% (Berkeley) %G%
E 8
.\"
D 2
.TH IL 4 "27 July 1983"
E 2
I 2
D 8
.TH IL 4 "%Q%"
E 2
.UC 5
.SH NAME
D 3
il \- Interlan 10 Mb/s Ethernet interface
E 3
I 3
il \- Interlan NI1010 10 Mb/s Ethernet interface
E 3
.SH SYNOPSIS
D 4
.B "device il0 at uba0 csr 161000 vector ilrint ilcint"
E 4
I 4
.B "device il0 at uba0 csr 164000 vector ilrint ilcint"
E 4
.SH DESCRIPTION
E 8
I 8
.Dd %Q%
.Dt IL 4 vax
.Os BSD 4.2
.Sh NAME
.Nm il
.Nd Interlan NI1010 10 Mb/s Ethernet interface
.Sh SYNOPSIS
.Cd "device il0 at uba0 csr 164000 vector ilrint ilcint"
.Sh DESCRIPTION
E 8
The
D 8
.I il
E 8
I 8
.Nm il
E 8
interface provides access to a 10 Mb/s Ethernet network through
D 4
an Interlan controller.
E 4
I 4
an Interlan 1010 or 1010A controller.
E 4
D 8
.PP
E 8
I 8
.Pp
E 8
D 4
The host's Internet address is specified at boot time with an SIOCSIFADDR
E 4
I 4
Each of the host's network addresses
D 8
is specified at boot time with an SIOCSIFADDR
E 4
ioctl.  The
.I il
E 8
I 8
is specified at boot time with an
.Dv SIOCSIFADDR
.Xr ioctl 2 .
The
.Nm il
E 8
interface employs the address resolution protocol described in
D 6
.IR arp (4P)
E 6
I 6
D 8
.IR arp (4)
E 8
I 8
.Xr arp 4
E 8
E 6
to dynamically map between Internet and Ethernet addresses on the local
network.
D 8
.PP
E 8
I 8
.Pp
E 8
The interface normally tries to use a ``trailer'' encapsulation
D 4
to minimize copying data on input and output.  This may be
disabled, on a per-interface basis, by setting the IFF_NOTRAILERS
E 4
I 4
to minimize copying data on input and output.
D 8
The use of trailers is negotiated with ARP.
E 8
I 8
The use of trailers is negotiated with
.Tn ARP .
E 8
This negotiation may be disabled, on a per-interface basis,
D 8
by setting the IFF_NOTRAILERS
E 4
flag with an SIOCSIFFLAGS ioctl.
.SH DIAGNOSTICS
\fBil%d: input error\fP.  The hardware indicated an error
E 8
I 8
by setting the
.Dv IFF_NOTRAILERS
flag with an
.Dv SIOCSIFFLAGS
.Xr ioctl .
.Sh DIAGNOSTICS
.Bl -diag
.It il%d: input error.
The hardware indicated an error
E 8
in reading a packet off the cable or an illegally sized packet.
D 8
.PP
\fBil%d: can't handle af%d\fP.  The interface was handed
E 8
I 8
.Pp
.It il%d: can't handle af%d.
The interface was handed
E 8
a message with addresses formatted in an unsuitable address
family; the packet was dropped.
I 3
D 8
.PP
D 5
\fBil%d: setaddr failed\fP.  The interface was unable to reprogram
E 5
I 5
\fBil%d: setaddr didn't work\fP.  The interface was unable to reprogram
E 8
I 8
.Pp
.It il%d: setaddr didn't work.
The interface was unable to reprogram
E 8
E 5
its physical ethernet address.
This may happen with very early models of the interface.
This facility is used only when
D 8
the controller is not the first network interface configured for XNS.
E 8
I 8
the controller is not the first network interface configured for
.Tn XNS .
E 8
The oldest interface tested (2.7.1.0.1.45) has never failed in this way.
D 8
.PP
The following messages indicate a probable hardware error performing
E 8
I 8
.Pp
.It il%d: reset failed, csr=%b.
.It il%d: status failed, csr=%b.
.It il%d: hardware diag failed, csr=%b.
.It il%d: verifying setaddr, csr=%b.
.It il%d: stray xmit interrupt, csr=%b.
.It il%d: can't initialize.
The above messages indicate a probable hardware error performing
E 8
the indicated operation during autoconfiguration or initialization.
The status field in the control and status register (the low-order four bits)
should indicate the nature of the failure.
See the hardware manual for details.
D 8
.PP
\fBil%d: reset failed, csr=%b\fP.
.PP
\fBil%d: status failed, csr=%b\fP.
.PP
\fBil%d: hardware diag failed, csr=%b\fP.
.PP
\fBil%d: verifying setaddr, csr=%b\fP.
I 5
.PP
\fBil%d: stray xmit interrupt, csr=%b\fP.
.PP
\fBil%d: can't initialize\fP.
E 5
E 3
.SH SEE ALSO
D 6
intro(4N), inet(4F), arp(4P)
E 6
I 6
netintro(4), inet(4), arp(4)
E 8
I 8
.El
.Sh SEE ALSO
.Xr netintro 4 ,
.Xr inet 4 ,
.Xr arp 4
.Sh HISTORY
The
.Nm
interface appeared in
.Bx 4.2 .
E 8
E 6
D 4
.SH BUGS
E 4
D 3
The PUP protocol family should be added.
E 3
E 1
