share/man/man4/man4.vax/SCCS/s.kg.4
h21643
s 00002/00002/00041
d D 8.1 93/06/05 13:47:05 bostic 4 3
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00033/00016/00010
d D 6.2 91/03/27 23:51:50 cael 3 2
c  macro and text revision (-mdoc version 3)
e
s 00001/00001/00025
d D 6.1 85/05/15 17:45:07 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00026/00000/00000
d D 5.1 85/05/15 17:45:02 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
D 3
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 3
I 3
D 4
.\" Copyright (c) 1983, 1991 Regents of the University of California.
.\" All rights reserved.
E 4
I 4
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 4
E 3
.\"
D 3
.\"	%W% (Berkeley) %G%
E 3
I 3
.\" %sccs.include.redist.man%
E 3
.\"
D 2
.TH KG 4 "27 July 1983"
E 2
I 2
D 3
.TH KG 4 "%Q%"
E 2
.UC 5
.SH NAME
kg \- KL-11/DL-11W line clock
.SH SYNOPSIS
.B "device kg0 at uba0 csr 0176500 vector kglock"
.SH DESCRIPTION
A kl-11 or dl-11w can be used as an alternate real
E 3
I 3
.\"     %W% (Berkeley) %G%
.\"
.Dd %Q%
.Dt KG 4 vax
.Os BSD 4.2
.Sh NAME
.Nm kg
.Nd
.Tn KL-11 Ns / Tn DL-11W
line clock
.Sh SYNOPSIS
.Cd "device kg0 at uba0 csr 0176500 vector kglock"
.Sh DESCRIPTION
A
.Tn KL-11
or
.Tn DL-11W
can be used as an alternate real
E 3
time clock
source.  When configured, certain system
statistics and, optionally, system profiling work
will be collected each time the clock interrupts.  For
D 3
optimum accuracy in profiling, the dl-11w should be
E 3
I 3
optimum accuracy in profiling, the
.Tn DL-11W
should be
E 3
configured to interrupt at the highest possible priority
level.  The 
D 3
.I kg
E 3
I 3
.Nm kg
E 3
device driver automatically calibrates itself to the
line clock frequency.
D 3
.SH "SEE ALSO"
kgmon(8), config(8)
E 3
I 3
.Sh SEE ALSO
.Xr kgmon 8 ,
.Xr config 8
.Sh HISTORY
The
.Nm
driver appeared in
.Bx 4.2 .
E 3
E 1
