share/man/man4/man4.vax/SCCS/s.lp.4
h39083
s 00002/00002/00057
d D 8.1 93/06/05 13:47:16 bostic 5 4
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00053/00061/00006
d D 6.2 91/03/27 23:51:51 cael 4 3
c  macro and text revision (-mdoc version 3)
e
s 00001/00001/00066
d D 6.1 85/05/15 17:22:43 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00006/00009/00061
d D 5.1 85/05/15 17:22:35 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00070/00000/00000
d D 4.1 85/05/15 17:22:27 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
D 4
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 4
I 4
D 5
.\" Copyright (c) 1980, 1991 Regents of the University of California.
.\" All rights reserved.
E 5
I 5
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 5
E 4
.\"
D 4
.\"	%W% (Berkeley) %G%
E 4
I 4
.\" %sccs.include.redist.man%
E 4
.\"
D 2
.TH LP 4 4/1/81
E 2
I 2
D 3
.TH LP 4 "27 July 1983"
E 3
I 3
D 4
.TH LP 4 "%Q%"
E 3
E 2
.UC 4
.SH NAME
lp \- line printer
.SH SYNOPSIS
D 2
device lp0 at uba0 csr 0177514 vector lpintr
E 2
I 2
.B "device lp0 at uba0 csr 0177514 vector lpintr"
E 2
.SH DESCRIPTION
.I Lp
provides the interface to any of the standard
D 2
DEC line printers.
E 2
I 2
DEC line printers on an LP-11 parallel interface.
E 2
When it is opened or closed, a suitable number
of page ejects is generated.
Bytes written are printed.
.PP
E 4
I 4
.\"     %W% (Berkeley) %G%
.\"
.Dd %Q%
.Dt LP 4 vax
.Os BSD 4
.Sh NAME
.Nm lp
.Nd line printer
.Sh SYNOPSIS
.Cd "device lp0 at uba0 csr 0177514 vector lpintr"
.Sh DESCRIPTION
The
.Nm lp
device
supports
.Tn DEC
and
.Tn DEC
compatible printers
on the
.Tn LP-11
parallel interface.
.Pp
E 4
The unit number of the printer is specified by the minor device
after removing the low 3 bits, which act as per-device parameters.
Currently only the lowest of the low three bits is interpreted:
D 4
if it is set, the device is treated as having a 64-character set,
E 4
I 4
if it is set, the device is assumed to have a 64-character set or
.Pf half Tn -ASCII
mode,
E 4
rather than a full 96-character set.
D 4
In the resulting half-ASCII mode, lower case letters are turned
into upper case and certain characters are escaped according to
the following table:
.PP
.br
.ns
.TP 10
{
\o"-("
.br
.ns
.TP 10
}
\o"-)"
.br
.ns
.TP 10
\`
\o"-\'"
.br
.ns
.TP 10
|
\o"\-!"
.br
.ns
.TP 10
~
\o"\-^"
..
.PP
The driver correctly interprets
carriage returns, backspaces, tabs, and form feeds.
D 2
Lines longer than 132 characters are truncated
(This is a parameter in the driver).
E 2
I 2
Lines longer than the maximum page width are truncated.
The default page width is 132 columns.
This may be overridden by specifying, for example, ``flags 256'' .
E 2
.SH FILES
/dev/lp
.SH "SEE ALSO"
lpr(1)
.SH DIAGNOSTICS
None.
E 4
I 4
.Pp
If the 64-character set is assumed,
any lower case characters are mapped to upper case; left curly and
right curly braces are mapped to left and right parentheses over
laid with a hyphen; grave accents are mapped to acute accents
with overlaid with a hyphen; the pipe bar character is mapped
to an exclamation sign overlaid with a hyphen; and the tilde
character is mapped to a carat overlaid with a hyphen.
.Pp
The default page width is 132 columns; longer lines are
truncated.
This may be overridden by specifying, for example,
.Ql flags 256 .
.Sh FILES
.Bl -tag -width Pa -compact
.It Pa /dev/lp
.El
.Sh SEE ALSO
.Xr lpr 1
.Sh HISTORY
A
.Nm
driver appeared in
.At v6 .
E 4
D 2
.SH BUGS
Although the driver supports multiple printers this has never
been tried.  In any case user-level software support for multiple printers
is not available.
E 2
E 1
