share/man/man4/man4.vax/SCCS/s.mem.4
h14162
s 00002/00002/00076
d D 8.1 93/06/05 13:47:22 bostic 6 5
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00073/00046/00005
d D 6.3 91/03/27 23:51:51 cael 5 4
c  macro and text revision (-mdoc version 3)
e
s 00016/00016/00035
d D 6.2 86/05/16 15:55:18 karels 4 3
c updates
e
s 00001/00001/00050
d D 6.1 85/05/15 17:23:07 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00004/00003/00047
d D 5.1 85/05/15 17:22:57 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00050/00000/00000
d D 4.1 85/05/15 17:22:49 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
D 5
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 5
I 5
D 6
.\" Copyright (c) 1980, 1991 Regents of the University of California.
.\" All rights reserved.
E 6
I 6
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 6
E 5
.\"
D 5
.\"	%W% (Berkeley) %G%
E 5
I 5
.\" %sccs.include.redist.man%
E 5
.\"
D 2
.TH MEM 4 
E 2
I 2
D 3
.TH MEM 4 "9 February 1983"
E 3
I 3
D 5
.TH MEM 4 "%Q%"
E 3
E 2
.UC 4
.SH NAME
mem, kmem \- main memory
.SH DESCRIPTION
.lg
.I Mem
is a special file that is an image of the main memory
of the computer.
It may be used, for example, to examine
(and even to patch) the system.
.PP
Byte addresses in
.I mem
are interpreted as physical memory addresses.
References to non-existent locations cause errors to be returned.
.PP
E 5
I 5
.\"     %W% (Berkeley) %G%
.\"
.Dd %Q%
.Dt MEM 4 vax
.Os BSD 4
.Sh NAME
.Nm mem ,
.Nm kmem ,
.Nm kUmem
.Nd memory files
.Sh DESCRIPTION
The special file
.Nm /dev/mem
is an interface to the physical memory of the computer.
Byte offsets in this file are interpreted as physical memory addresses.
Reading and writing this file is equivalent to reading and writing
memory itself.
Only offsets within the bounds of
.Nm /dev/mem
are allowed.
.Pp
Kernel virtual memory is accessed through the interface
.Nm /dev/kmem
in the same manner as
.Nm /dev/mem .
Only kernel virtual addresses that are currently mapped to memory are allowed.
.Pp
E 5
D 4
Examining and patching device registers is likely
to lead to unexpected results when read-only or write-only
bits are present.
.PP
E 4
The file
D 5
.I kmem
is the same as 
.I mem
except that kernel virtual memory
rather than physical memory is accessed.
I 4
Only kernel virtual addresses that are mapped to memory are allowed.
The file
.I kUmem
E 5
I 5
.Nm /dev/kUmem
E 5
also refers to kernel virtual memory,
D 5
but may be used to access areas mapped to UNIBUS address space
and other I/O areas.
E 5
I 5
but may be used to access areas mapped to
.Tn UNIBUS
address space
and other
.Tn I/O
areas.
E 5
It forces all accesses to use word (short integer) accesses.
D 5
Examining and patching device registers is likely
to lead to unexpected results when read-only or write-only
bits are present.
E 4
.PP
D 4
On PDP11's, the I/O page
begins at location 0160000 of
.I kmem
and per-process data for the current process
begins at 0140000.
E 4
On VAX 11/780 the I/O space begins at physical address 20000000(16);
D 4
on an 11/750 I/O space addresses are of the form fxxxxx(16); on all VAX'en
per-process data f\&or the current process is at virtual
7f\&f\&f\&f\&000(16).
E 4
I 4
on an 11/750 I/O space addresses are of the form fxxxxx(16).
On all VAX'en
per-process data for the current process is UPAGES long, and ends at virtual
address 80000000(16).
E 4
.SH FILES
D 2
/dev/mem,
E 2
I 2
/dev/mem
.br
E 2
/dev/kmem
D 4
.SH BUGS
On PDP11's and VAX's, memory files are accessed one byte
D 2
at a time, an inappropiate method for some
E 2
I 2
at a time, an inappropriate method for some
E 2
device registers.
E 4
I 4
.br
/dev/kUmem
E 5
I 5
.Pp
On the
.Tn VAX
11/780,
the
.Tn I/O
space base address is
20000000(16);
on an 11/750
the
.Tn I/O space addresses are of the form fxxxxx(16).
On all
.Tn VAX Ns 'en
the
per-process data
size
for the current process
is
.Dv UPAGES
long and ends at the virtual address 80000000(16).
.Sh FILES
.Bl -tag -width Pa -compact
.It Pa /dev/mem
.It Pa /dev/kmem
.It Pa /dev/kUmem
.El
.Sh HISTORY
The
.Nm mem ,
.Nm kmem
files appeared in
.At v6 .
The file
.Nm kUmem
appeared in
.Bx 3.0 .
E 5
E 4
E 1
