share/man/man4/man4.vax/SCCS/s.mt.4
h36846
s 00002/00002/00088
d D 8.1 93/06/05 13:47:27 bostic 7 6
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00072/00044/00018
d D 6.4 91/03/27 23:51:52 cael 6 5
c  macro and text revision (-mdoc version 3)
e
s 00001/00001/00061
d D 6.3 86/06/01 00:43:50 mis 5 4
c corrected a printf.
e
s 00004/00000/00058
d D 6.2 86/05/16 15:59:07 karels 4 3
c bugs
e
s 00001/00001/00057
d D 6.1 85/05/15 17:23:30 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00026/00017/00032
d D 5.1 85/05/15 17:23:20 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00049/00000/00000
d D 4.1 85/05/15 17:23:13 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
D 6
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 6
I 6
D 7
.\" Copyright (c) 1980, 1991 Regents of the University of California.
.\" All rights reserved.
E 7
I 7
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 7
E 6
.\"
D 6
.\"	%W% (Berkeley) %G%
E 6
I 6
.\" %sccs.include.redist.man%
E 6
.\"
D 2
.TH MT 4 10/8/81
E 2
I 2
D 3
.TH MT 4 "27 July 1983"
E 3
I 3
D 6
.TH MT 4 "%Q%"
E 3
E 2
.UC 4
.SH NAME
D 2
mt \- TM-78/TU-78 MASSBUS magtape interface
E 2
I 2
mt \- TM78/TU-78 MASSBUS magtape interface
E 2
.SH SYNOPSIS
D 2
formatter mt0 at mba? drive ?
E 2
I 2
.B master mt0 at mba? drive ?
E 2
.br
D 2
tape mu0 at mt0 slave 0
E 2
I 2
.B tape mu0 at mt0 slave 0
E 2
.SH DESCRIPTION
D 2
The tm-78/transport combination provides a standard tape drive
E 2
I 2
The tm78/tu-78 combination provides a standard tape drive
E 6
I 6
.\"     %W% (Berkeley) %G%
.\"
.Dd %Q%
.Dt MT 4 vax
.Os BSD 4
.Sh NAME
.Nm mt
.Nd
.Tn TM78 Ns / Tn TU-78
.Tn MASSBUS
magtape interface
.Sh SYNOPSIS
.Cd "master mt0 at mba? drive ? tape mu0 at mt0 slave 0"
.Sh DESCRIPTION
The
.Tn TM78 Ns / Tn TU-78
combination provides a standard tape drive
E 6
E 2
interface as described in
D 2
.IR mtop (4).
The TU78 provides both 1600 and 6250 bpi,
runs at 125 ips, and autoloads tapes.
E 2
I 2
D 6
.IR mtio (4).
Only 1600 and 6250 bpi are supported; the
TU-78 runs at 125 ips and autoloads tapes.
E 2
.SH "SEE ALSO"
D 2
mt(1), tar(1), tp(1), mtop(4), ht(4), tm(4), ts(4)
E 2
I 2
mt(1),
tar(1),
tp(1),
mtio(4),
tm(4),
ts(4),
ut(4)
E 2
.SH DIAGNOSTICS
\fBmu%d: no write ring\fR.  An attempt was made to write on the tape drive
E 6
I 6
.Xr mtio 4 .
Only 1600 and 6250
.Tn BPI
are supported; the
.Tn TU-78
runs at 125
.Tn IPS
and autoloads tapes.
.Sh DIAGNOSTICS
.Bl -diag
.It mu%d: no write ring.
An attempt was made to write on the tape drive
E 6
when no write ring was present; this message is written on the terminal of
the user who tried to access the tape.
D 6
.PP
\fBmu%d: not online\fR.  An attempt was made to access the tape while it
E 6
I 6
.Pp
.It mu%d: not online.
An attempt was made to access the tape while it
E 6
was offline; this message is written on the terminal of the user
who tried to access the tape.
D 6
.PP
D 5
\fBmu%d: can't switch density in mid-tape\fR.  An attempt was made to write
E 5
I 5
\fBmu%d: can't change density in mid-tape\fR.  An attempt was made to write
E 6
I 6
.Pp
.It "mu%d: can't change density in mid-tape."
An attempt was made to write
E 6
E 5
on a tape at a different density than is already recorded on the tape.
This message is written on the terminal of the user who tried to switch
the density.
D 6
.PP
D 2
\fBmu%d: hard error bn%d mbsr=%b er=%o ds=%b\fR.   A tape error occurred
E 2
I 2
\fBmu%d: hard error bn%d mbsr=%b er=%x ds=%b\fR.   A tape error occurred
E 2
at block \fIbn\fR; the mt error register and drive status register are
E 6
I 6
.Pp
.It "mu%d: hard error bn%d mbsr=%b er=%x ds=%b."
A tape error occurred
at block
.Em bn ;
the mt error register and drive status register are
E 6
D 2
printed in octal with the drive status bits symbolically decoded.  Any error is
E 2
I 2
printed in octal with the bits symbolically decoded.  Any error is
E 2
fatal on non-raw tape; when possible the driver will have retried
the operation which failed several times before reporting the error.
D 6
.PP
D 2
\fBmu%d: blank tape\fR.  An attempt was made to read or space a blank tape.
.SH BUGS
If any non-data error is encountered on non-raw tape, it refuses to do anything
more until closed.
E 2
I 2
\fBmu%d: blank tape\fP.
E 6
I 6
.Pp
.It mu%d: blank tape.
E 6
An attempt was made to read a blank tape (a tape without even
end-of-file marks).
E 2
D 6
.PP
D 2
The system should remember which controlling terminal has the tape drive
open and write error messages to that terminal rather than on the console.
E 2
I 2
\fBmu%d: offline\fP.
E 6
I 6
.Pp
.It mu%d: offline.
E 6
During an i/o operation the device was set offline.  If a
non-raw tape was used in the access it is closed.
D 6
.SH BUGS
If any non-data error is encountered on non-raw tape,
it refuses to do anything more until closed.
I 4
.PP
Because 800 bpi tapes are not supported, the numbering of minor devices
E 6
I 6
.El
.Sh SEE ALSO
.Xr mt 1 ,
.Xr tar 1 ,
.Xr tp 1 ,
.Xr mtio 4 ,
.Xr tm 4 ,
.Xr ts 4 ,
.Xr ut 4
.Sh HISTORY
The
.Nm
driver appeared in
.Bx 4.1 .
.Sh BUGS
If a physical error (non-data) occurs,
.Nm
may hang ungracefully.
.Pp
Because 800
.Tn BPI
tapes are not supported, the numbering of minor devices
E 6
is inconsistent with triple-density tape units.
D 6
Unit 0 is drive 0, 1600 bpi.
E 6
I 6
Unit 0 is drive 0, 1600
.Tn BPI.
E 6
E 4
E 2
E 1
