share/man/man4/man4.vax/SCCS/s.np.4
h27750
s 00002/00002/00107
d D 8.1 93/06/05 13:47:40 bostic 7 6
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00073/00060/00036
d D 6.6 91/03/27 23:51:54 cael 6 5
c  macro and text revision (-mdoc version 3)
e
s 00001/00011/00095
d D 6.5 90/06/23 18:05:58 trent 5 4
c new copyright notice
e
s 00015/00004/00091
d D 6.4 89/02/14 17:34:39 bostic 4 3
c add Berkeley specific copyright notice
e
s 00003/00003/00092
d D 6.3 86/05/21 15:50:07 anne 3 2
c spelling corrections
e
s 00005/00008/00090
d D 6.2 86/05/16 15:55:38 karels 2 1
c updates
e
s 00098/00000/00000
d D 6.1 86/02/17 17:28:02 sklower 1 0
c Manual Pages for MICOM interlan NP100 unibus 10MB/s intelligent ethernet controller for downloading (np) and operation(ix)
e
u
U
t
T
I 1
D 4
.\" Copyright (c) 1986 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 4
I 4
D 6
.\" Copyright (c) 1986 The Regents of the University of California.
E 6
I 6
D 7
.\" Copyright (c) 1986, 1991 The Regents of the University of California.
E 6
.\" All rights reserved.
E 7
I 7
.\" Copyright (c) 1986, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 7
E 4
.\"
I 4
D 5
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 5
I 5
.\" %sccs.include.redist.man%
E 5
.\"
E 4
D 6
.\"	%W% (Berkeley) %G%
E 6
I 6
.\"     %W% (Berkeley) %G%
E 6
.\"
D 6
.TH NP 4 "%Q%"
.UC 5
.SH NAME
np \- Interlan Np100 10 Mb/s Ethernet interface
.SH SYNOPSIS
.B "device np0 at uba0 csr 166000 vector npintr"
.SH DESCRIPTION
E 6
I 6
.Dd %Q%
.Dt NP 4 vax
.Os BSD 4.2
.Sh NAME
.Nm np
.Nd Interlan Np100 10 Mb/s Ethernet interface
.Sh SYNOPSIS
.Cd "device np0 at uba0 csr 166000 vector npintr"
.Sh DESCRIPTION
E 6
The
D 6
.I NP
E 6
I 6
.Nm np
E 6
D 2
device provides access to an Interlan Np100 ethernet interface
E 2
I 2
device provides access to an Interlan Np100 Ethernet interface
E 2
for control functions.
D 6
.PP
E 6
I 6
.Pp
E 6
This interface is unusual in that it requires loading firmware
D 2
into the controller before it may be used as a network interface.
E 2
I 2
into the controller before it may be used as a network link-level interface.
E 2
This is accomplished by opening a character special device,
and writing data to it.
It is also possible to do post-mortem debugging of firmware failures
by reading the local memory of the device.
D 6
.PP
A program to load the image is provided in /usr/src/new/np100.
The sequence of commands would be:
.nf

	# ./npload np.image [/dev/np00]
	# sleep 10
	# ifconfig ix0 ...
.fi
.PP
E 6
I 6
.\" .Pp
.\" A program to load the image is provided in
.\" .Pa /usr/src/new/np100 .
.\" The sequence of commands would be:
.\" .Bd -literal -offset indent
.\" # ./npload np.image [/dev/np00]
.\" # sleep 10
.\" # ifconfig ix0 ...
.\" .Ed
.Pp
E 6
D 2
Multiple control process are allowed by opening separate
E 2
I 2
Multiple control processes are allowed by opening separate
E 2
minor devices; secondary interfaces are specified by shifting
the interface number by 4 bits.
D 6
.PP
E 6
I 6
.Pp
E 6
The device also responds to commands passed through the driver
D 6
by the following ioctls:
.TP
NPRESET
.br
E 6
I 6
by the following
.Xr ioctl 2 Ns s :
.Bl -tag -width NPNETBOOT
.It Dv NPRESET
E 6
D 2
kills off all active network process.
E 2
I 2
kills off all active network processes.
E 2
D 6
.TP
NPSTART
.br
begins execution of the board at the specified address (usually 0x400).
.TP
NPNETBOOT
.br
E 6
I 6
.It Dv NPSTART
begins execution of the board at the specified address (usually
.Li 0x400 ) .
.It Dv NPNETBOOT
E 6
downloads the image from a server on the network.
D 6
[Contact MICOM-INTERLAN for details.]
.SH DIAGNOSTICS
\fBnp%d: Bad Maintenance command: %x!\fP.
An invalid ioctl was passed to the np driver.
.PP
\fBnp%d: Panic NP100 bad buffer chain\fP.
E 6
I 6
[Contact
.Tn MICOM-INTERLAN
for details.]
.El
.Sh DIAGNOSTICS
.Bl -diag
.It np%d: Bad Maintenance command: %x!
An invalid
.Xr ioctl
was passed to the np driver.
.Pp
.It np%d: Panic NP100 bad buffer chain.
E 6
An error occurred in an read or write operation causing it to
run out of buffers before it finished the operation.
This indicates a kernel failure rather than a device failure.
D 6
.PP
\fBNP100 unit %d not found!\fP.
E 6
I 6
.Pp
.It NP100 unit %d not found!
E 6
D 3
A failure occured during initialization, such that the unibus
E 3
I 3
A failure occurred during initialization, such that the unibus
E 3
address expected for the board was found to be bad.
Probably indicates hardware problems with the board, as do the following:
D 6
\fB
.nf

NP100 Unit %d timed out!

NP100 Unit %d Failed diagnostics!
Status from CSR0: %x.\fP
.fi
.PP
\fBPanic from NP100 unit %d!\\nPanic Message: %s\fP.
E 6
I 6
.Pp
.Bd -filled -offset indent -compact
.It NP100 Unit %d timed out!
.It NP100 Unit %d Failed diagnostics!
.It Status from CSR0: %x.
.Ed
.Pp
.It "Panic from NP100 unit %d!"
.It "Panic Message: %s."
E 6
D 3
An occurance on the board was deemed serious enough
E 3
I 3
An occurrence on the board was deemed serious enough
E 3
to have the vax print it out.  
D 6
.PP
\fBNP100 unit #%d available!\fP.
E 6
I 6
.Pp
.It NP100 unit #%d available!
E 6
D 3
The board was succesfully loaded and started.
E 3
I 3
The board was successfully loaded and started.
E 3
D 6
.PP
\fBnp%d: Bad Req: %x.\fP.
E 6
I 6
.Pp
.It np%d: Bad Req: %x.
E 6
The board made a maintenance request to the vax that it did not
understand.
D 6
.PP
\fBnp%d: No more room on Command Queue!\fP.
E 6
I 6
.Pp
.It np%d: No more room on Command Queue!
E 6
The np driver allowed an internal resource to be exhausted.
This should never happen.
D 6
.PP
E 6
I 6
.El
.Pp
E 6
There are 110 other diagnostic messages that can be enabled
by setting bits in a debugging mask.
Consult the driver for details.
D 6
.SH SEE ALSO
D 2
intro(4N), inet(4F), arp(4P), ix(4).
.SH BUGS
There should be a direct path to an intelligent controller
via a protocol family using the socket mechanism.
E 2
I 2
D 4
intro(4N), inet(4F), arp(4P), ix(4)
E 4
I 4
netintro(4), inet(4), arp(4), ix(4)
E 6
I 6
.Sh SEE ALSO
.Xr netintro 4 ,
.Xr inet 4 ,
.Xr arp 4 ,
.Xr ix 4
.Sh HISTORY
The
.Nm
driver appeared in
.Bx 4.3 .
E 6
E 4
E 2
E 1
