share/man/man4/man4.vax/SCCS/s.pcl.4
h26140
s 00002/00002/00104
d D 8.1 93/06/05 13:47:47 bostic 5 4
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00080/00042/00026
d D 6.3 91/03/27 23:51:55 cael 4 3
c  macro and text revision (-mdoc version 3)
e
s 00001/00001/00067
d D 6.2 86/05/21 15:53:19 anne 3 2
c spelling
e
s 00001/00001/00067
d D 6.1 85/05/15 17:45:50 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00068/00000/00000
d D 5.1 85/05/15 17:45:44 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
D 4
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 4
I 4
D 5
.\" Copyright (c) 1983, 1991 Regents of the University of California.
.\" All rights reserved.
E 5
I 5
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 5
E 4
.\"
D 4
.\"	%W% (Berkeley) %G%
E 4
I 4
.\" %sccs.include.redist.man%
E 4
.\"
D 2
.TH PCL 4 "27 July 1983"
E 2
I 2
D 4
.TH PCL 4 "%Q%"
E 2
.UC 5
.SH NAME
pcl \- DEC CSS PCL-11 B Network Interface
.SH SYNOPSIS
.B "device pcl0 at uba? csr 164200 vector pclxint pclrint"
.SH DESCRIPTION
E 4
I 4
.\"     %W% (Berkeley) %G%
.\"
.Dd %Q%
.Dt PCL 4 vax
.Os BSD 4.2
.Sh NAME
.Nm pcl
.Nd
.Tn DEC CSS
.Tn PCL-11 B
Network Interface
.Sh SYNOPSIS
.Cd "device pcl0 at uba? csr 164200 vector pclxint pclrint"
.Sh DESCRIPTION
E 4
The 
D 4
.I pcl
device provides an IP-only interface to the DEC CSS PCL-11
E 4
I 4
.Nm pcl
device provides an
.Tn IP Ns -only
interface to the
.Tn DEC CSS
.Tn PCL-11
E 4
time division multiplexed network bus.
The controller itself is not accessible to users.
D 4
.PP
The hosts's address is specified with the SIOCSIFADDR ioctl.
E 4
I 4
.Pp
The hosts's address is specified with the
.Dv SIOCSIFADDR
.Xr ioctl 2 .
E 4
The interface will not transmit or receive any data before
its address is defined.
D 4
.PP
As the PCL-11 hardware is only capable of having 15 interfaces per network,
E 4
I 4
.Pp
As the
.Tn PCL-11
hardware is only capable of having 15 interfaces per network,
E 4
a single-byte host-on-network number is used, with range [1..15] to match
D 4
the TDM bus addresses of the interfaces.
.PP
E 4
I 4
the
.Tn TDM
bus addresses of the interfaces.
.Pp
E 4
The interface currently only supports the Internet protocol family
D 4
and only provides ``natural'' (header) encapsulation.
.SH DIAGNOSTICS
.BR "pcl%d: can't init" .
Insufficient UNIBUS resources existed to initialize the device.
E 4
I 4
and only provides
.Dq natural
(header) encapsulation.
.Sh DIAGNOSTICS
.Bl -diag
.It pcl%d: can't init.
Insufficient
.Tn UNIBUS
resources existed to initialize the device.
E 4
This is likely to occur when the device is run on a buffered
data path on an 11/750 and other network interfaces are also
configured to use buffered data paths, or when it is configured
to use buffered data paths on an 11/730 (which has none).
D 4
.PP
.BR "pcl%d: can't handle af%d" .
E 4
I 4
.Pp
.It pcl%d: can't handle af%d.
E 4
The interface was handed a message with addresses formatted in an
unsuitable address family;  the packet was dropped.
D 4
.PP
.BR "pcl%d: stray xmit interrupt" .
E 4
I 4
.Pp
.It pcl%d: stray xmit interrupt.
E 4
D 3
An interrupt occured when no output had previously been started.
E 3
I 3
An interrupt occurred when no output had previously been started.
E 3
D 4
.PP
.BR "pcl%d: master" .
The TDM bus had no station providing ``bus master'' timing signals,
E 4
I 4
.Pp
.It pcl%d: master.
The
.Tn TDM
bus had no station providing ``bus master'' timing signals,
E 4
so this interface has assumed the ``master'' role.  This message should
D 4
only appear at most once per UNIBUS INIT on a single system.
E 4
I 4
only appear at most once per
.Tn UNIBUS INIT
on a single system.
E 4
Unless there is a hardware failure, only one station may be master at at time.
D 4
.PP
.BR "pcl%d: send error, tcr=%b, tsr=%b" .
E 4
I 4
.Pp
.It pcl%d: send error, tcr=%b, tsr=%b.
E 4
The device indicated a problem sending data on output.
If a ``receiver offline'' error is detected, it is not normally logged
D 4
unless the option PCL_TESTING has been selected, as this causes a lot
E 4
I 4
unless the option
.Dv PCL_TESTING
has been selected, as this causes a lot
E 4
of console chatter when sending to a down machine.  However, this option
D 4
is quite useful when debugging problems with the PCL interfaces.
.PP
.BR "pcl%d: rcv error, rcr=%b rsr=%b" .
E 4
I 4
is quite useful when debugging problems with the
.Tn PCL
interfaces.
.Pp
.It pcl%d: rcv error, rcr=%b rsr=%b.
E 4
The device indicated a problem receiving data on input.
D 4
.PP
.BR "pcl%d: bad len=%d" .
E 4
I 4
.Pp
.It pcl%d: bad len=%d.
E 4
An input operation resulted in a data transfer of less than
0 or more than 1008 bytes of
data into memory (according to the word count register).
D 4
This should never happen as the maximum size of a PCL message
E 4
I 4
This should never happen as the maximum size of a
.Tn PCL
message
E 4
has been agreed upon to be 1008 bytes (same as ArpaNet message).
D 4
.SH "SEE ALSO"
intro(4N), inet(4F)
E 4
I 4
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr inet 4
.Sh HISTORY
The
.Nm
interface appeared in
.Bx 4.2 .
E 4
E 1
