share/man/man4/man4.vax/SCCS/s.qe.4
h13736
s 00002/00002/00057
d D 8.1 93/06/05 13:47:59 bostic 5 4
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00046/00023/00013
d D 6.4 91/03/27 23:51:57 cael 4 3
c  macro and text revision (-mdoc version 3)
e
s 00001/00011/00035
d D 6.3 90/06/23 18:05:54 trent 3 2
c new copyright notice
e
s 00017/00007/00029
d D 6.2 89/02/14 17:34:40 bostic 2 1
c add Berkeley specific copyright notice
e
s 00036/00000/00000
d D 6.1 86/06/03 16:31:22 mckusick 1 0
c first released with 4.3BSD
e
u
U
t
T
I 1
D 2
.\" Copyright (c) 1986 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 2
I 2
D 4
.\" Copyright (c) 1983 The Regents of the University of California.
E 4
I 4
D 5
.\" Copyright (c) 1983, 1991 The Regents of the University of California.
E 4
.\" All rights reserved.
E 5
I 5
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 5
E 2
.\"
I 2
D 3
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 3
I 3
.\" %sccs.include.redist.man%
E 3
.\"
E 2
D 4
.\"	%W% (Berkeley) %G%
E 4
I 4
.\"     %W% (Berkeley) %G%
E 4
.\"
D 4
.TH QE 4 "%Q%"
.UC 6
.SH NAME
qe \- DEC DEQNA Q-bus 10 Mb/s Ethernet interface
.SH SYNOPSIS
.B "device qe0 at uba? csr 174440 vector qeintr"
.SH DESCRIPTION
E 4
I 4
.Dd %Q%
.Dt QE 4 vax
.Os BSD 4.3
.Sh NAME
.Nm qe
.Nd
.Tn DEC DEQNA
.Tn Q-bus
10 Mb/s Ethernet interface
.Sh SYNOPSIS
.Cd "device qe0 at uba? csr 174440 vector qeintr"
.Sh DESCRIPTION
E 4
The
D 4
.B qe
E 4
I 4
.Nm qe
E 4
interface provides access to a 10 Mb/s Ethernet network through
D 4
the DEC DEQNA Q-bus controller.
.PP
E 4
I 4
the
.Tn DEC DEQNA
.Tn Q-bus
controller.
.Pp
E 4
Each of the host's network addresses
D 4
is specified at boot time with an SIOCSIFADDR
ioctl.  The
.B qe
E 4
I 4
is specified at boot time with an
.Dv SIOCSIFADDR
.Xr ioctl 2 .
The
.Nm qe
E 4
interface employs the address resolution protocol described in
D 2
arp(4P)
E 2
I 2
D 4
arp(4)
E 4
I 4
.Xr arp 4
E 4
E 2
to map dynamically  between Internet and Ethernet addresses on the local
network.
D 4
.PP
The interface normally tries to use a ``trailer'' encapsulation
E 4
I 4
.Pp
The interface normally tries to use a
.Dq trailer
encapsulation
E 4
to minimize copying data on input and output.
D 4
The use of trailers is negotiated with ARP.
E 4
I 4
The use of trailers is negotiated with
.Tn ARP .
E 4
This negotiation may be disabled, on a per-interface basis,
D 4
by setting the IFF_NOTRAILERS
flag with an SIOCSIFFLAGS ioctl.
D 2
.SH DIAGNOSTICS
.SH SEE ALSO
inet(4F), intro(4N), arp(4P)
E 2
I 2
.SH "SEE ALSO"
netintro(4), inet(4), arp(4)
E 4
I 4
by setting the
.Dv IFF_NOTRAILERS
flag with an
.Dv SIOCSIFFLAGS
.Xr ioctl .
.Sh SEE ALSO
.Xr netintro 4 ,
.Xr inet 4 ,
.Xr arp 4
.Sh HISTORY
The
.Nm
driver appeared in
.Bx 4.3 .
E 4
E 2
E 1
