share/man/man4/man4.vax/SCCS/s.rx.4
h59319
s 00002/00002/00226
d D 8.1 93/06/05 13:48:05 bostic 4 3
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00159/00099/00069
d D 6.2 91/03/27 23:51:58 cael 3 2
c  macro and text revision (-mdoc version 3)
e
s 00010/00007/00158
d D 6.1 85/05/15 17:47:02 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00165/00000/00000
d D 5.1 85/05/15 17:46:54 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
D 3
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 3
I 3
D 4
.\" Copyright (c) 1983, 1991 Regents of the University of California.
.\" All rights reserved.
E 4
I 4
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 4
E 3
.\"
D 3
.\"	%W% (Berkeley) %G%
E 3
I 3
.\" %sccs.include.redist.man%
E 3
.\"
D 2
.TH RX 4 "27 July 1983"
E 2
I 2
D 3
.TH RX 4 "%Q%"
E 2
.UC 5
.SH NAME
rx \- DEC RX02 floppy disk interface
.SH SYNOPSIS
.B "controller fx0 at uba0 csr 0177170  vector rxintr"
.br
D 2
.B "disk rx0 at fx0 slave 0"
E 2
I 2
.B "disk rx0 at fx0 drive 0"
E 2
.br
D 2
.B "disk rx1 at fx0 slave 1"
E 2
I 2
.B "disk rx1 at fx0 drive 1"
E 2
.SH DESCRIPTION
E 3
I 3
.\"     %W% (Berkeley) %G%
.\"
.Dd %Q%
.Dt RX 4 vax
.Os BSD 4.2
.Sh NAME
.Nm rx
.Nd
.Tn DEC
.Tn RX02
floppy disk interface
.Sh SYNOPSIS
.Cd "controller fx0 at uba0 csr 0177170  vector rxintr"
.Cd "disk rx0 at fx0 drive 0"
.Cd "disk rx1 at fx0 drive 1"
.Sh DESCRIPTION
E 3
The
D 3
.I rx
device provides access to a DEC RX02 floppy disk
unit with M8256 interface module (RX211 configuration). 
The RX02 uses 8-inch, single-sided, soft-sectored floppy
E 3
I 3
.Nm rx
device provides access to a
.Tn DEC
.Tn RX02
floppy disk
unit with M8256 interface module
.Pf ( Tn RX211
configuration). 
The
.Tn RX02
uses 8-inch, single-sided, soft-sectored floppy
E 3
disks (with pre-formatted industry-standard headers) in
either single or double density.
D 3
.PP
Floppy disks handled by the RX02 contain 77 tracks, each with 26
E 3
I 3
.Pp
Floppy disks handled by the
.Tn RX02
contain 77 tracks, each with 26
E 3
sectors (for a total of 2,002 sectors).  The sector size is 128
bytes for single density, 256 bytes for double density.  Single 
D 3
density disks are compatible with the RX01 floppy disk unit and with
IBM 3740 Series Diskette 1 systems.  
.PP
In addition to normal (`block' and `raw') i/o, the driver supports
E 3
I 3
density disks are compatible with the
.Tn RX01
floppy disk unit and with
.Tn IBM
3740 Series Diskette 1 systems.  
.Pp
In addition to normal (`block' and `raw')
.Tn I/O ,
the driver supports
E 3
formatting of disks for either density and
the ability to invoke a 2 for 1 interleaved sector mapping
D 3
compatible with the DEC operating system RT-11.
.PP
E 3
I 3
compatible with the
.Tn DEC
operating system
.Tn RT-11 .
.Pp
E 3
The minor device number is interpreted as follows:
D 3
.PP
.nf
.ta \w'Bit      'u
\fBBit	Description\fP
E 3
I 3
.Pp
.Bl -column Otherx -offset indent
.Sy Bit	Description
E 3
0	Sector interleaving  (1 disables interleaving)
1	Logical sector 1 is on track 1 (0 no, 1 yes)
2	Not used, reserved
Other	Drive number
D 3
.fi
.PP
The two drives in a single RX02 unit are treated as
E 3
I 3
.El
.Pp
The two drives in a single
.Tn RX02
unit are treated as
E 3
two disks attached to a single controller.  Thus, if there are two
D 3
RX02's on a system, the drives on the first RX02 are ``rx0'' and ``rx1'',
while the drives on the second are ``rx2'' and ``rx3''. 
.PP
E 3
I 3
.Tn RX02 Ns 's
on a system, the drives on the first
.Tn RX02
are
.Dq Li rx0
and
.Dq Li rx1 ,
while the drives on the second are
.Dq Li rx2
and
.Dq Li rx3 . 
.Pp
E 3
When the device is opened, the density of the disk
currently in the drive is automatically determined. If there
is no floppy in the device, open will fail.
D 3
.PP
E 3
I 3
.Pp
E 3
The interleaving parameters are represented in raw device
D 3
names by the letters `a' through `d'.  Thus, unit 0, drive 0 is
E 3
I 3
names by the letters
.Ql a
through
.Ql d .
Thus, unit 0, drive 0 is
E 3
called by one of the following names:
D 3
.PP
.nf
.ta \w'interleaved   'u +\w'Device name   'u
\fBMapping	Device name	Starting track\fP
E 3
I 3
.Pp
.Bl -column interleavedxx "Device namexx" "Starting Track" -offset indent
.Sy Mapping	Device name	Starting track
E 3
interleaved	/dev/rrx0a	0
direct	/dev/rrx0b	0
interleaved	/dev/rrx0c	1
direct	/dev/rrx0d	1
D 3
.fi
.PP
The mapping used on the `c' device is compatible with the
DEC operating system RT-11.  The `b' device accesses the
E 3
I 3
.El
.Pp
The mapping used on the
.Ql c
device is compatible with the
.Tn DEC
operating system
.Tn RT-11 .
The
.Ql b
device accesses the
E 3
sectors of the disk in strictly sequential order.  
D 3
The `a' device is the most efficient for disk-to-disk copying.
E 3
I 3
The
.Ql a
device is the most efficient for disk-to-disk copying.
E 3
I 2
This mapping is always used by the block device.
E 2
D 3
.PP
I/O requests must start on a sector boundary, involve an integral
E 3
I 3
.Pp
.Tn I/O
requests must start on a sector boundary, involve an integral
E 3
number of complete sectors, and not go off the end of the disk.
D 3
.SH NOTES
E 3
I 3
.Sh NOTES
E 3
Even though the storage capacity on a floppy disk is quite
small, it is possible to make filesystems on 
double density disks. 
For example, the command
D 3
.nf
.RS
E 3
I 3
.Bd -literal -offset indent
E 3
% mkfs /dev/rx0 1001 13 1 4096 512 32 0 4
D 3
.RE
.fi
E 3
I 3
.Ed
.Pp
E 3
makes a file system on the double density disk in rx0 with 
436 kbytes available for file storage.
D 3
Using \fItar\fP(1) gives a more efficient utilization of the available
E 3
I 3
Using
.Xr tar 1
gives a more efficient utilization of the available
E 3
space for file storage.
Single density diskettes do not provide sufficient storage capacity to
hold file systems.
D 3
.PP
A number of \fIioctl\fP(2) calls apply to the rx devices, and
E 3
I 3
.Pp
A number of
.Xr ioctl 2
calls apply to the rx devices, and
E 3
have the form
D 3
.RS
.nf
.ft B
E 3
I 3
.Bd -literal -offset indent
E 3
#include <vaxuba/rxreg.h>
ioctl(fildes, code, arg)
int *arg;
D 3
.ft R
.fi
.RE
E 3
I 3
.Ed
.Pp
E 3
The applicable codes are:
D 3
.IP RXIOC_FORMAT 18
E 3
I 3
.Bl -tag -width RXIOC_GETDENS
.It Dv RXIOC_FORMAT
E 3
Format the diskette. The density to use is specified
by the 
D 3
.I arg
E 3
I 3
.Ar arg
E 3
D 2
argument, 0 gives single density while non-zero
E 2
I 2
argument, zero gives single density while non-zero
E 2
gives double density.
D 3
.IP RXIOC_GETDENS
E 3
I 3
.It Dv RXIOC_GETDENS
E 3
D 2
Return the density of the diskette (0 or !=0 as above).
E 2
I 2
Return the density of the diskette (zero or non-zero as above).
E 2
D 3
.IP RXIOC_WDDMK
On the next write, include a \fIdeleted data address mark\fP in 
E 3
I 3
.It Dv RXIOC_WDDMK
On the next write, include a
.Em deleted data address mark
in 
E 3
the header of the first sector.
D 3
.IP RXIOC_RDDMK
E 3
I 3
.It Dv RXIOC_RDDMK
E 3
Return non-zero if the last sector read contained a
D 3
\fIdeleted data address mark\fP in its header, otherwise
E 3
I 3
.Em deleted data address mark
in its header, otherwise
E 3
return 0.
D 3
.SH ERRORS
E 3
I 3
.El
.Sh FILES
.Bl -tag -width /dev/rx?xx -compact
.It Pa /dev/rx?
.It Pa /dev/rrx?[a-d]
.El
.Sh DIAGNOSTICS
.Bl -diag
.It "rx%d: hard error, trk %d psec %d cs=%b, db=%b, err=%x, %x, %x, %x."
An unrecoverable error was encountered.  The 
track and physical sector numbers, the device registers and the 
extended error status are displayed.
.Pp
.It rx%d: state %d (reset).
The driver entered a bogus state.  This should not happen.
.El
.Sh ERRORS
E 3
D 2
The following errors may be returned by the above ioctl calls:
E 2
I 2
The following errors may be returned by the driver:
E 2
D 3
.TP 12
[ENODEV]
E 3
I 3
.Bl -tag -width [ENODEV]
.It Bq Er ENODEV
E 3
Drive not ready; usually because no disk is in the drive or
the drive door is open.
D 3
.TP
[ENXIO]
E 3
I 3
.It Bq Er ENXIO
E 3
Nonexistent drive (on open); 
offset is too large or not on a sector boundary or
byte count is not a multiple of the sector size (on read or write);
or bad (undefined) ioctl code.
D 3
.TP
[EIO]
E 3
I 3
.It Bq Er EIO
E 3
A physical error other than ``not ready'', probably bad media or 
unknown format.
D 3
.TP
[EBUSY]
E 3
I 3
.It Bq Er EBUSY
E 3
Drive has been opened for exclusive access.
D 3
.IP [EBADF] 12
E 3
I 3
.It Bq Er EBADF
E 3
No write access (on format), or wrong density; the latter
D 2
can only happen if the disk is changed without closing the device
E 2
I 2
can only happen if the disk is changed without 
D 3
.I closing 
E 3
I 3
.Em closing
E 3
the device
E 2
D 3
(i.e., calling \fIclose\fP(2) ).
.SH FILES
/dev/rx?
.br
/dev/rrx?[a-d]
.SH SEE ALSO
rxformat(8V), newfs(8), mkfs(8), tar(1), arff(8V)
.SH DIAGNOSTICS
.BR "rx%d: hard error, trk %d psec %d cs=%b, db=%b, err=%x, %x, %x, %x".
An unrecoverable error was encountered.  The 
track and physical sector numbers, the device registers and the 
extended error status are displayed.
.PP
.BR "rx%d: state %d (reset)" .
The driver entered a bogus state.  This should not happen.
.SH BUGS
E 3
I 3
(i.e., calling
.Xr close 2 ) .
.El
.Sh SEE ALSO
.Xr rxformat 8 ,
.Xr newfs 8 ,
.Xr mkfs 8 ,
.Xr tar 1 ,
.Xr arff 8
.Sh HISTORY
The
.Nm
driver appeared in
.Bx 4.2 .
.Sh BUGS
E 3
A floppy may not be formatted if the
header info on sector 1, track 0 has been damaged.  Hence, it is not
possible to format completely degaussed disks or disks with other
formats than the two known by the hardware. 
D 3
.PP
E 3
I 3
.Pp
E 3
If the drive subsystem is powered down when the machine is booted, the
controller won't interrupt.
E 1
