share/man/man4/man4.vax/SCCS/s.tb.4
h30217
s 00002/00002/00080
d D 8.1 93/06/05 13:48:20 bostic 5 4
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00054/00038/00028
d D 6.4 91/03/27 23:51:59 cael 4 3
c  macro and text revision (-mdoc version 3)
e
s 00004/00004/00062
d D 6.3 86/06/01 00:44:11 mis 3 2
c spelling errors fixed.
e
s 00001/00001/00065
d D 6.2 86/04/19 23:26:20 sam 2 1
c leftover network-ism
e
s 00066/00000/00000
d D 6.1 86/04/15 16:44:53 mckusick 1 0
c 4.3BSD manual page from sam
e
u
U
t
T
I 1
D 4
.\" Copyright (c) 1986 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 4
I 4
D 5
.\" Copyright (c) 1986, 1991 Regents of the University of California.
.\" All rights reserved.
E 5
I 5
.\" Copyright (c) 1986, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 5
E 4
.\"
D 4
.\"	%W% (Berkeley) %G%
E 4
I 4
.\" %sccs.include.redist.man%
E 4
.\"
D 4
.TH TB 4 "%Q%"
.UC 6
.SH NAME
tb \- line discipline for digitizing devices
.SH SYNOPSIS
.B pseudo-device tb
.SH DESCRIPTION
E 4
I 4
.\"     %W% (Berkeley) %G%
.\"
.Dd %Q%
.Dt TB 4 vax
.Os BSD 4.3
.Sh NAME
.Nm tb
.Nd line discipline for digitizing devices
.Sh SYNOPSIS
.Cd pseudo-device tb
.Sh DESCRIPTION
E 4
This line discipline provides a polled interface to many common
digitizing devices which are connected to a host through a serial line.
When these devices stream data at high speed, the use of the
D 3
line discpline is critical in minimizing the number of samples
E 3
I 3
line discipline is critical in minimizing the number of samples
E 3
that would otherwise be lost due to buffer exhaustion in the
D 4
.IR tty (4)
E 4
I 4
.Xr tty 4
E 4
handler.
D 4
.PP
E 4
I 4
.Pp
E 4
The line discipline is enabled by a sequence:
D 4
.PP
.nf
.ft B
	#include <sys/tablet.h>
	int ldisc = TBLDISC, fildes; ...
	ioctl(fildes, TIOCSETD, &ldisc);
.fi
.ft R
.PP
E 4
I 4
.Bd -literal -offset indent
#include <sys/tablet.h>
int ldisc = TBLDISC, fildes; ...
ioctl(fildes, TIOCSETD, &ldisc);
.Ed
.Pp
E 4
A typical application program then polls the digitizing device by
reading a binary data structure which contains: the current X and
Y positions (in the device coordinate space),
up-down status of the buttons or pen stylus,
proximity information (when available), and a count
of the number of samples received from the input device
since it was opened.  In addition, devices such as the
D 4
GTCO append tilt and pressure information to the end of
E 4
I 4
.Tn GTCO
append tilt and pressure information to the end of
E 4
D 3
the aforementioned structure.  For the Polehmus 3-D digitizer
the structure read is completely different, refer to the
E 3
I 3
the aforementioned structure.  For the Polhemus 3-D digitizer
the structure read is completely different. Refer to the
E 3
include file for a complete description.
D 4
.PP
E 4
I 4
.Pp
E 4
While in tablet mode, normal teletype input and output functions take place.
Thus, if an 8 bit output data path is desired, it is necessary
D 4
to prepare the output line by putting it into RAW mode using
.IR ioctl (2).
E 4
I 4
to prepare the output line by putting it into
.Tn RAW
mode using
.Xr ioctl 2 .
E 4
This must be done
D 4
.B before
changing the discipline with TIOCSETD, as most
.IR ioctl (2)
E 4
I 4
.Em before
changing the discipline with
.Dv TIOCSETD ,
as most
.Xr ioctl 2
E 4
D 2
calls are disabled while in network line-discipline mode.
E 2
I 2
calls are disabled while in tablet line-discipline mode.
E 2
D 4
.PP
E 4
I 4
.Pp
E 4
The line discipline supports
D 4
.IR ioctl (2)
E 4
I 4
.Xr ioctl 2
E 4
requests to get/set the operating mode, and to get/set the tablet type
D 4
and operating mode by \fIor\fP-ing the two values together.
.PP
E 4
I 4
and operating mode by
.Em or Ns -ing
the two values together.
.Pp
E 4
D 3
The line discpline supports digitizing devices which are
E 3
I 3
The line discipline supports digitizing devices which are
E 3
D 4
compatible with Hitachi, GTCO, or Polhemus protocol formats.
E 4
I 4
compatible with Hitachi,
.Tn GTCO ,
or Polhemus protocol formats.
E 4
For Hitachi there are several formats with that used in the
D 4
newer model HDG-1111B the most common.
.SH "SEE ALSO"
tty(4)
.SH DIAGNOSTICS
E 4
I 4
newer model
.Tn HDG-1111B
the most common.
.Sh DIAGNOSTICS
E 4
None.
I 4
.Sh SEE ALSO
.Xr tty 4
.Sh HISTORY
The
.Nm
interface appeared in
.Bx 4.3 .
E 4
E 1
