share/man/man4/man4.vax/SCCS/s.tmscp.4
h51317
s 00002/00002/00103
d D 8.1 93/06/05 13:48:35 bostic 3 2
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00086/00056/00019
d D 6.2 91/03/27 23:52:00 cael 2 1
c  macro and text revision (-mdoc version 3)
e
s 00075/00000/00000
d D 6.1 86/06/04 15:27:04 mckusick 1 0
c first distributed with 4.3BSD
e
u
U
t
T
I 1
D 2
.\" Copyright (c) 1986 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 2
I 2
D 3
.\" Copyright (c) 1986, 1991 Regents of the University of California.
.\" All rights reserved.
E 3
I 3
.\" Copyright (c) 1986, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 3
E 2
.\"
D 2
.\"	%W% (Berkeley) %G%
E 2
I 2
.\" %sccs.include.redist.man%
E 2
.\"
D 2
.TH TMSCP 4 "%Q%"
.UC 6
.SH NAME
tmscp \- DEC TMSCP magtape interface
.SH SYNOPSIS
.B "controller tmscp0 at uba? csr 0174500 vector tmscpintr"
.br
.B "tape tms0 at tmscp0 drive 0"
.SH DESCRIPTION
Tape controllers compatible with the DEC
Tape Mass Storage Control Protocol (TMSCP) architecture
such as the TU81 and the TK50
E 2
I 2
.\"     %W% (Berkeley) %G%
.\"
.Dd %Q%
.Dt TMSCP 4 vax
.Os BSD 4.3
.Sh NAME
.Nm tmscp
.Nd
.Tn DEC TMSCP
magtape interface
.Sh SYNOPSIS
.Cd "controller tmscp0 at uba? csr 0174500 vector tmscpintr"
.Cd "tape tms0 at tmscp0 drive 0"
.Sh DESCRIPTION
Tape controllers compatible with the
.Tn DEC
Tape Mass Storage Control Protocol
.Pq Tn TMSCP
architecture
such as the
.Tn TU81
and the
.Tn TK50
E 2
provide a standard tape drive interface 
as described in
D 2
.IR mtio (4).
E 2
I 2
.Xr mtio 4 .
E 2
The controller communicates with the host through a packet
oriented protocol.
Consult the file
D 2
.IR < vax/tmscp.h >
E 2
I 2
.Aq Pa vax/tmscp.h
E 2
for a detailed 
description of this protocol.
D 2
.SH DIAGNOSTICS
.BR "tmscp controller failed to init" .
E 2
I 2
.Sh DIAGNOSTICS
.Bl -diag
.It tmscp controller failed to init.
E 2
The controller initialization procedure failed.
This probably indicates a hardware problem.
D 2
.PP
.BR "tmscp%d: sa 0%o, state %d" .
(Additional status information given after a hard I/O error.)
E 2
I 2
.Pp
.It tmscp%d: sa 0%o, state %d.
(Additional status information given after a hard
.Tn I/O
error.)
E 2
The values of the controller status register and the internal
driver state are printed.
D 2
.PP
.BR "tmscp%d: random interrupt ignored" .
An unexpected interrupt was received (e.g. when no i/o was
E 2
I 2
.Pp
.It tmscp%d: random interrupt ignored.
An unexpected interrupt was received (e.g. when no
.Tn I/O
was
E 2
pending).  The interrupt is ignored.
D 2
.PP
.BR "tmscp%d:  interrupt in unknown state %d ignored" .
E 2
I 2
.Pp
.It tmscp%d:  interrupt in unknown state %d ignored.
E 2
An interrupt was received when the driver was in an unknown
internal state.  Indicates a hardware problem or a driver bug.
D 2
.PP
.BR "tmscp%d:  fatal error (0%o)" .
E 2
I 2
.Pp
.It tmscp%d:  fatal error (0%o).
E 2
The controller detected a ``fatal error'' in the status returned
to the host.  The contents of the status register are displayed.
D 2
.PP
.BR OFFLINE .
(Additional status information given after a hard I/O error.)
A hard I/O error occurred because the drive was not on-line.
.PP
The following errors are interpretations of TMSCP error messages
E 2
I 2
.Pp
.It OFFLINE.
(Additional status information given after a hard
.Tn I/O
error.)
A hard
.Tn I/O
error occurred because the drive was not on-line.
.Pp
.It tmscp%d: hard error
.It tmscp%d: soft error.
These errors precede an interpretation of a
.Tn TMSCP
error message
E 2
returned by the controller to the host.
D 2
Each is preceded by either
.B "tmscp%d: hard error"
or
.BR "tmscp%d: soft error" .
.PP
.BR "controller error, event 0%o" .
.PP
.BR "host memory access error, event 0%o, addr 0%o" .
.PP
.BR "tape transfer error, unit %d, grp 0x%x, event 0%o" .
.PP
.BR "STI error, unit %d, event 0%o" .
.PP
.BR "STI Drive Error Log, unit %d, event 0%o" .
.PP
.BR "STI Formatter Error Log, unit %d, event 0%o" .
.PP
.BR "unknown error, unit %d, format 0%o, event 0%o" .
.SH "SEE ALSO"
mt(1), tar(1), tp(1), mtio(4), tm(4), ts(4), ut(4), dmesg(8)
E 2
I 2
.Tn TMSCP
errors may be:
.Pp
.Bd -filled -offset indent -compact
.It controller error, event 0%o.
.It host memory access error, event 0%o, addr 0%o.
.It tape transfer error, unit %d, grp 0x%x, event 0%o.
.It STI error, unit %d, event 0%o.
.It STI Drive Error Log, unit %d, event 0%o.
.It STI Formatter Error Log, unit %d, event 0%o.
.It unknown error, unit %d, format 0%o, event 0%o.
.Ed
.El
.Sh SEE ALSO
.Xr mt 1 ,
.Xr tar 1 ,
.Xr tp 1 ,
.Xr mtio 4 ,
.Xr tm 4 ,
.Xr ts 4 ,
.Xr ut 4 ,
.Xr dmesg 8
.Sh HISTORY
The
.Nm
driver appeared in
.Bx 4.3 .
E 2
E 1
