share/man/man4/man4.vax/SCCS/s.ts.4
h65469
s 00002/00002/00081
d D 8.1 93/06/05 13:48:43 bostic 5 4
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00073/00041/00010
d D 6.2 91/03/27 23:52:01 cael 4 3
c  macro and text revision (-mdoc version 3)
e
s 00001/00001/00050
d D 6.1 85/05/15 17:24:15 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00013/00009/00038
d D 5.1 85/05/15 17:24:06 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00047/00000/00000
d D 4.1 85/05/15 17:23:56 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
D 4
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 4
I 4
D 5
.\" Copyright (c) 1980, 1991 Regents of the University of California.
.\" All rights reserved.
E 5
I 5
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 5
E 4
.\"
D 4
.\"	%W% (Berkeley) %G%
E 4
I 4
.\" %sccs.include.redist.man%
E 4
.\"
D 2
.TH TS 4 5/10/81
E 2
I 2
D 3
.TH TS 4 "27 July 1983"
E 3
I 3
D 4
.TH TS 4 "%Q%"
E 3
E 2
.UC 4
.SH NAME
ts \- TS-11 magtape interface
.SH SYNOPSIS
D 2
controller zs0 at uba? csr 0172520 vector tsintr
E 2
I 2
.B "controller zs0 at uba? csr 0172520 vector tsintr"
E 2
.br
D 2
tape ts0 at zs0 drive 0
E 2
I 2
.B "tape ts0 at zs0 drive 0"
E 2
.SH DESCRIPTION
The ts-11 combination provides a standard tape drive
E 4
I 4
.\"     %W% (Berkeley) %G%
.\"
.Dd %Q%
.Dt TS 4 vax
.Os BSD 4
.Sh NAME
.Nm ts
.Nd
.Tn TS-11
magtape interface
.Sh SYNOPSIS
.Cd "controller zs0 at uba? csr 0172520 vector tsintr"
.Cd "tape ts0 at zs0 drive 0"
.Sh DESCRIPTION
The
.Tn TS-11
combination provides a standard tape drive
E 4
interface as described in
D 2
.IR mt (4).
E 2
I 2
D 4
.IR mtio (4).
E 2
The ts-11 operates only at 1600 bpi, and only one transport
E 4
I 4
.Xr mtio 4 .
The
.Tn TS-11
operates only at 1600
.Tn BPI ,
and only one transport
E 4
is possible per controller.
D 4
.SH "SEE ALSO"
D 2
mt(1), tar(1), tp(1), ht(4), mt(4), tm(4), ut(4)
E 2
I 2
mt(1),
tar(1),
tp(1),
mtio(4),
ht(4),
tm(4),
mt(4),
ut(4)
E 2
.SH DIAGNOSTICS
\fBts%d: no write ring\fR.  An attempt was made to write on the tape drive
E 4
I 4
.Sh DIAGNOSTICS
.Bl -diag
.It ts%d: no write ring.
An attempt was made to write on the tape drive
E 4
when no write ring was present; this message is written on the terminal of
the user who tried to access the tape.
D 4
.PP
\fBts%d: not online\fR.  An attempt was made to access the tape while it
E 4
I 4
.Pp
.It ts%d: not online.
An attempt was made to access the tape while it
E 4
was offline; this message is written on the terminal of the user
who tried to access the tape.
D 4
.PP
\fBts%d: hard error bn%d xs0=%b\fR.  A hard error occurred on the tape
at block \fIbn\fR; status register 0 is printed in octal and symbolically
E 4
I 4
.Pp
.It ts%d: hard error bn%d xs0=%b.
A hard error occurred on the tape
at block
.Em bn ;
status register 0 is printed in octal and symbolically
E 4
decoded as bits.
D 4
.SH BUGS
If any non-data error is encountered on non-raw tape, it refuses to do anything
more until closed.
.PP
The device lives at the same address as a tm-11
.IR tm (4);
E 4
I 4
.El
.Sh SEE ALSO
.Xr mt 1 ,
.Xr tar 1 ,
.Xr tp 1 ,
.Xr mtio 4 ,
.Xr ht 4 ,
.Xr tm 4 ,
.Xr mt 4 ,
.Xr ut 4
.Sh HISTORY
The
.Nm
driver appeared in
.Bx 4.1 .
.Sh BUGS
May hang ungracefully if a physical error (non-data) occurs.
.Pp
The device lives at the same address as a
.Tn TM-11
.Pq Xr tm 4 ;
E 4
as it is very difficult to get this device to interrupt, a generic
D 4
system assumes that a ts is present whenever no tm-11 exists but
the csr responds and a ts-11 is configured.
D 2
This does no harm as long as a non-existant ts-11 is not accessed.
.PP
The system should remember which controlling terminal has the tape drive
open and write error messages to that terminal rather than on the console.
E 2
I 2
This does no harm as long as a non-existent ts-11 is not accessed.
E 4
I 4
system assumes that a
.Nm ts
is present whenever no
.Tn TM-11
exists but
the
.Tn CSR
responds and a
.Tn TS-11
is configured.
This does no harm as long as a non-existent
.Tn TS-11
is not accessed.
E 4
E 2
E 1
