share/man/man4/man4.vax/SCCS/s.tu.4
h06657
s 00002/00002/00137
d D 8.1 93/06/05 13:48:48 bostic 5 4
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00105/00050/00034
d D 6.2 91/03/27 23:52:02 cael 4 3
c  macro and text revision (-mdoc version 3)
e
s 00001/00001/00083
d D 6.1 85/05/15 17:24:39 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00070/00019/00014
d D 5.1 85/05/15 17:24:28 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00033/00000/00000
d D 4.1 85/05/15 17:24:22 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
D 4
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 4
I 4
D 5
.\" Copyright (c) 1980, 1991 Regents of the University of California.
.\" All rights reserved.
E 5
I 5
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 5
E 4
.\"
D 4
.\"	%W% (Berkeley) %G%
E 4
I 4
.\" %sccs.include.redist.man%
E 4
.\"
D 2
.TH TU 4 10/8/81
E 2
I 2
D 3
.TH TU 4 "27 July 1983"
E 3
I 3
D 4
.TH TU 4 "%Q%"
E 3
E 2
.UC 4
.SH NAME
D 2
tu \- console TU58 interface
E 2
I 2
tu \- VAX-11/730 and VAX-11/750 TU58 console cassette interface
.SH SYNOPSIS
.B "options MRSP"
(for VAX-11/750's with an MRSP prom)
E 2
.SH DESCRIPTION
E 4
I 4
.\"     %W% (Berkeley) %G%
.\"
.Dd %Q%
.Dt TU 4 vax
.Os BSD 4
.Sh NAME
.Nm tu
.Nd
.Tn VAX-11/730
and
.Tn VAX-11/750
.Tn TU58
console cassette interface
.Sh SYNOPSIS
.Cd "options MRSP"
(for
.Tn VAX-11/750 Ns 's
with an
.Tn MRSP
prom)
.Sh DESCRIPTION
E 4
I 2
The
D 4
.I tu
interface provides access to the VAX 11/730 and 11/750 TU58 console
E 4
I 4
.Nm tu
interface provides access to the
.Tn VAX
11/730 and 11/750
.Tn TU58
console
E 4
cassette drive(s).  
E 2
D 4
.PP
D 2
This is a simple interface to the TU58
cassette tape unit, which is part of the console
subsytem for VAX-11/750's.
Access is given to the entire
tape consisting of 1024 blocks of 512 bytes.
E 2
I 2
The interface supports only block i/o to the TU58 cassettes.
E 4
I 4
.Pp
The interface supports only block
.Tn I/O
to the
.Tn TU58
cassettes.
E 4
The devices are normally manipulated with the 
D 4
.IR arff (8V)
E 4
I 4
.Xr arff 8
E 4
program using the ``f'' and ``m'' options.
E 2
D 4
.PP
E 4
I 4
.Pp
E 4
D 2
The TU58 behaves like a disk but has only a block interface (no raw).
The cassette is commonly accessed via the
.IR arff (8)
command, using the `m' flag.
E 2
I 2
The device driver is automatically included when a
system is configured to run on an 11/730 or 11/750.
D 4
.PP
The TU58 on an 11/750 uses the Radial Serial Protocol (RSP)
E 4
I 4
.Pp
The
.Tn TU58
on an 11/750 uses the Radial Serial Protocol
.Pq Tn RSP
E 4
to communicate with the cpu over a serial line.  This 
protocol is inherently unreliable as it has no flow
control measures built in.  On an 11/730 the Modified
Radial Serial Protocol is used.  This protocol incorporates
flow control measures which insure reliable data transfer
between the cpu and the device.  Certain 11/750's have
D 4
been modified to use the MRSP prom used in the 11/730.
To reliably use the console TU58 on an 11/750 under UNIX,
the MRSP prom is required.  For those 11/750's without
an MRSP prom, an unreliable but often
E 4
I 4
been modified to use the
.Tn MRSP
prom used in the 11/730.
To reliably use the console
.Tn TU58
on an 11/750 under
.Tn UNIX ,
the
.Tn MRSP
prom is required.  For those 11/750's without
an
.Tn MRSP
prom, an unreliable but often
E 4
useable interface has been developed.
This interface uses an assembly language ``pseudo-dma'' routine
to minimize the receiver interrupt service latency.
To include this code in
D 4
the system, the configuration must \fBnot\fP specify the
system will run on an 11/730 or use an MRSP prom.
E 4
I 4
the system, the configuration must
.Em not
specify the
system will run on an 11/730 or use an
.Tn MRSP
prom.
E 4
This unfortunately makes it impossible to configure a
D 4
single system which will properly handle TU58's on both an 11/750
and an 11/730 (unless both machines have MRSP proms).
E 2
.SH FILES
D 2
/dev/floppy
.SH SEE ALSO
arff(8)
E 2
I 2
.nf
.DT
/dev/tu0
/dev/tu1	(only on a VAX-11/730)
.fi
.SH "SEE ALSO"
arff(8V)
E 2
.SH DIAGNOSTICS
D 2
Lots, mostly cryptic.  Read the driver.
E 2
I 2
.BR "tu%d: no bp, active %d" .
E 4
I 4
single system which will properly handle
.Tn TU58 Ns 's
on both an 11/750
and an 11/730 (unless both machines have
.Tn MRSP
proms).
.Sh FILES
.Bl -tag -width /dev/tu0xx -compact
.It Pa /dev/tu0
.It Pa /dev/tu1
(only on a
.Tn VAX Ns \-11/730)
.El
.Sh DIAGNOSTICS
.Bl -diag
.It tu%d: no bp, active %d.
E 4
A transmission complete interrupt was received with no outstanding
D 4
i/o request.  This indicates a hardware problem.
.PP
.BR "tu%d protocol error, state=%s, op=%x, cnt=%d, block=%d" .
E 4
I 4
.Tn I/O
request.  This indicates a hardware problem.
.Pp
.It "tu%d protocol error, state=%s, op=%x, cnt=%d, block=%d."
E 4
The driver entered an illegal state.  The information printed
indicates the illegal state, operation currently being executed,
D 4
the i/o count, and the block number on the cassette.
.PP
.BR "tu%d receive state error, state=%s, byte=%x" .
E 4
I 4
the
.Tn I/O
count, and the block number on the cassette.
.Pp
.It "tu%d receive state error, state=%s, byte=%x."
E 4
The driver entered an illegal state in the receiver finite
state machine.  The state is shown along with the control
byte of the received packet.
D 4
.PP
.BR "tu%d: read stalled" .
E 4
I 4
.Pp
.It tu%d: read stalled.
E 4
A timer watching the controller detected no interrupt for
an extended period while an operation was outstanding.
This usually indicates that one or more receiver interrupts
were lost and the transfer is restarted (11/750 only).
D 4
.PP
.BR "tu%d: hard error bn%d, pk_mod %o" .
E 4
I 4
.Pp
.It tu%d: hard error bn%d, pk_mod %o.
E 4
The device returned a status code indicating a hard error. The
actual error code is shown in octal. No retries are attempted
by the driver.
E 2
D 4
.SH BUGS
D 2
The driver is very unreliable due to the nature of the TU58 interface.
The TU58 should be used only when the system is in single-user mode,
since it is often necessary to reboot the system to unhang the process
accessing the TU58.
E 2
I 2
The VAX-11/750 console interface without MRSP prom is unuseable
E 4
I 4
.El
.Sh SEE ALSO
.Xr arff 8
.Sh HISTORY
The
.Nm
driver appeared in
.Bx 4.1 .
.Sh BUGS
The
.Tn VAX Ns \-11/750
console interface without
.Tn MRSP
prom is unuseable
E 4
while the system is multi-user; it should be used only with
the system running single-user and, even then, with caution.
E 2
E 1
