share/man/man4/man4.vax/SCCS/s.ut.4
h57998
s 00002/00002/00079
d D 8.1 93/06/05 13:49:07 bostic 4 3
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00053/00037/00028
d D 6.2 91/03/27 23:52:07 cael 3 2
c  macro and text revision (-mdoc version 3)
e
s 00001/00001/00064
d D 6.1 85/05/15 17:51:41 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00065/00000/00000
d D 5.1 85/05/15 17:51:35 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
D 3
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 3
I 3
D 4
.\" Copyright (c) 1983, 1991 Regents of the University of California.
.\" All rights reserved.
E 4
I 4
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 4
E 3
.\"
D 3
.\"	%W% (Berkeley) %G%
E 3
I 3
.\" %sccs.include.redist.man%
E 3
.\"
D 2
.TH UT 4 "27 July 1983"
E 2
I 2
D 3
.TH UT 4 "%Q%"
E 2
.UC 5
.SH NAME
ut \- UNIBUS TU45 tri-density tape drive interface
.SH SYNOPSIS
.B "controller ut0 at uba0 csr 0172440 vector utintr"
.br
.B "tape tj0 at ut0 drive 0"
.SH DESCRIPTION
E 3
I 3
.\"     %W% (Berkeley) %G%
.\"
.Dd %Q%
.Dt UT 4 vax
.Os BSD 4.2
.Sh NAME
.Nm ut
.Nd
.Tn UNIBUS TU45
tri-density tape drive interface
.Sh SYNOPSIS
.Cd "controller ut0 at uba0 csr 0172440 vector utintr"
.Cd "tape tj0 at ut0 drive 0"
.Sh DESCRIPTION
E 3
The 
D 3
.I ut
E 3
I 3
.Nm ut
E 3
interface provides access to a standard tape drive interface as
describe in 
D 3
.IR mtio (4).
Hardware implementing this on the VAX is typified by the System
Industries SI 9700 tape subsystem.  Tapes may be read or written
at 800, 1600, and 6250 bpi.
.SH "SEE ALSO"
mt(1),
mtio(4)
.SH DIAGNOSTICS
.BR "tj%d: no write ring" .
E 3
I 3
.Xr mtio 4 .
Hardware implementing this on the
.Tn VAX
is typified by the System
Industries
.Tn SI
9700 tape subsystem.  Tapes may be read or written
at 800, 1600, and 6250
.Tn BPI .
.Sh DIAGNOSTICS
.Bl -diag
.It tj%d: no write ring.
E 3
An attempt was made to write on the tape drive
when no write ring was present; this message is written on the terminal of
the user who tried to access the tape.
D 3
.PP
.BR "tj%d: not online" .
E 3
I 3
.Pp
.It tj%d: not online.
E 3
An attempt was made to access the tape while it
was offline; this message is written on the terminal of the user
who tried to access the tape.
D 3
.PP
.BR "tj%d: can't change density in mid-tape" .
E 3
I 3
.Pp
.It tj%d: can't change density in mid-tape.
E 3
An attempt was made to write
on a tape at a different density than is already recorded on the tape.
This message is written on the terminal of the user who tried to switch
the density.
D 3
.PP
.BR "ut%d: soft error bn%d cs1=%b er=%b cs2=%b ds=%b" .
E 3
I 3
.Pp
.It "ut%d: soft error bn%d cs1=%b er=%b cs2=%b ds=%b."
E 3
The formatter indicated a corrected error at a density other
than 800bpi.  The data transferred is assumed to be correct.
D 3
.PP
.BR "ut%d: hard error bn%d cs1=%b er=%b cs2=%b ds=%b" .
E 3
I 3
.Pp
.It "ut%d: hard error bn%d cs1=%b er=%b cs2=%b ds=%b."
E 3
A tape error occurred
at block
D 3
.IR bn .
E 3
I 3
.Pp
.It bn.
E 3
Any error is
fatal on non-raw tape; when possible the driver will have retried
the operation which failed several times before reporting the error.
D 3
.PP
.BR "tj%d: lost interrupt" .
E 3
I 3
.Pp
.It tj%d: lost interrupt.
E 3
A tape operation did not complete
within a reasonable time, most likely because the tape was taken
off-line during rewind or lost vacuum.  The controller should, but does not,
give an interrupt in these cases.  The device will be made available
again after this message, but any current open reference to the device
will return an error as the operation in progress aborts.
D 3
.SH BUGS
If any non-data error is encountered on non-raw tape, it refuses to do anything
more until closed.
E 3
I 3
.El
.Sh SEE ALSO
.Xr mt 1 ,
.Xr mtio 4
.Sh HISTORY
The
.Nm
driver appeared in
.Bx 4.2 .
.Sh BUGS
May hang if a physical error (non-data) occurs.
E 3
E 1
