share/man/man4/man4.vax/SCCS/s.uu.4
h47489
s 00002/00002/00128
d D 8.1 93/06/05 13:49:20 bostic 4 3
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00103/00060/00027
d D 6.2 91/03/27 23:52:08 cael 3 2
c  macro and text revision (-mdoc version 3)
e
s 00001/00001/00086
d D 6.1 85/05/15 17:51:58 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00087/00000/00000
d D 5.1 85/05/15 17:51:48 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
D 3
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 3
I 3
D 4
.\" Copyright (c) 1983, 1991 Regents of the University of California.
.\" All rights reserved.
E 4
I 4
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 4
E 3
.\"
D 3
.\"	%W% (Berkeley) %G%
E 3
I 3
.\" %sccs.include.redist.man%
E 3
.\"
D 2
.TH UU 4 "27 July 1983"
E 2
I 2
D 3
.TH UU 4 "%Q%"
E 2
.UC 5
.SH NAME
uu \- TU58/DECtape II UNIBUS cassette interface 
.SH SYNOPSIS
.B "options UUDMA"
.br
.B "device uu0 at uba0 csr 0176500 vector uurintr uuxintr"
.SH DESCRIPTION
E 3
I 3
.\"     %W% (Berkeley) %G%
.\"
.Dd %Q%
.Dt UU 4 vax
.Os BSD 4.2
.Sh NAME
.Nm uu
.Nd
.Tn TU58 Ns / Tn DECtape II UNIBUS
cassette interface 
.Sh SYNOPSIS
.Cd "options UUDMA"
.Cd "device uu0 at uba0 csr 0176500 vector uurintr uuxintr"
.Sh DESCRIPTION
E 3
The
D 3
.I uu
device provides access to dual DEC TU58 tape cartridge drives
connected to the UNIBUS via a DL11-W interface module.
.PP
The interface supports only block i/o to the TU58 cassettes.
E 3
I 3
.Nm uu
device provides access to dual
.Tn DEC
.Tn TU58
tape cartridge drives
connected to the
.Tn UNIBUS
via a
.Tn DL11-W
interface module.
.Pp
The interface supports only block
.Tn I/O
to the
.Tn TU58
cassettes (see
.Xr physio 4 ) .
E 3
The drives are normally manipulated with the
D 3
.IR arff (8V)
E 3
I 3
.Xr arff 8
E 3
program using the ``m'' and ``f'' options.
D 3
.PP
E 3
I 3
.Pp
E 3
The driver provides for an optional write and verify 
(read after write) mode that is activated by specifying the
``a'' device.
D 3
.PP
The TU58 is treated as a single device by the system even
though it has two separate drives, ``uu0'' and ``uu1''. If there is 
more than one TU58 unit on a system, the extra drives
are named ``uu2'', ``uu3'' etc.
.SH NOTES
E 3
I 3
.Pp
The
.Tn TU58
is treated as a single device by the system even
though it has two separate drives,
.Sq Li uu0
and
.Sq Li uu1 .
If there is 
more than one
.Tn TU58
unit on a system, the extra drives
are named
.Sq Li uu2 ,
.Sq Li uu3
etc.
.Sh NOTES
E 3
Assembly language code to assist the driver in handling
the receipt of data (using a pseudo-dma approach) should
D 3
be included when using this driver; specify ``options UUDMA''
E 3
I 3
be included when using this driver; specify
.Sq Li options UUDMA
E 3
in the configuration file.
D 3
.SH ERRORS
The following errors may be returned:
.TP 12
[ENXIO]
Nonexistent drive (on open); 
offset is too large or bad (undefined) ioctl code.
.TP
[EIO]
Open failed, the device could not be reset.
.TP
[EBUSY]
Drive in use.
.SH FILES
/dev/uu?
.br
/dev/uu?a
.SH SEE ALSO
tu(4), arff(8V)
.SH DIAGNOSTICS
.BR "uu%d: no bp, active %d" .
E 3
I 3
.Sh FILES
.Bl -tag -width /dev/uu?a -compact
.It Pa /dev/uu?
.It Pa /dev/uu?a
.El
.Sh DIAGNOSTICS
.Bl -diag
.It uu%d: no bp, active %d.
E 3
A transmission complete interrupt was received with no outstanding
D 3
i/o request. This indicates a hardware problem.
.PP
.BR "uu%d protocol error, state=%s, op=%x, cnt=%d, block=%d" .
E 3
I 3
.Tn I/O
request. This indicates a hardware problem.
.Pp
.It uu%d protocol error, state=%s, op=%x, cnt=%d, block=%d.
E 3
The driver entered an illegal state.  The information printed
indicates the illegal state, the 
operation currently being executed,
D 3
the i/o count, and the block number on the cassette.
.PP
.BR "uu%d: break received, transfer restarted" .
The TU58 was sending a continuous break signal and had
E 3
I 3
the
.Tn I/O
count, and the block number on the cassette.
.Pp
.It uu%d: break received, transfer restarted.
The
.Tn TU58
was sending a continuous break signal and had
E 3
to be reset. This may indicate a hardware problem, but
the driver will attempt to recover from the error.
D 3
.PP
.BR "uu%d receive state error, state=%s, byte=%x" .
E 3
I 3
.Pp
.It uu%d receive state error, state=%s, byte=%x.
E 3
The driver entered an illegal state in the receiver finite
state machine.  The state is shown along with the control
byte of the received packet.
D 3
.PP
.BR "uu%d: read stalled" .
E 3
I 3
.Pp
.It uu%d: read stalled.
E 3
A timer watching the controller detected no interrupt for
an extended period while an operation was outstanding.
This usually indicates that one or more receiver interrupts
were lost and the transfer is restarted.
D 3
.PP
.BR "uu%d: hard error bn%d, pk_mod %o" .
E 3
I 3
.Pp
.It uu%d: hard error bn%d, pk_mod %o.
E 3
The device returned a status code indicating a hard error. The
actual error code is shown in octal. No retries are attempted
by the driver.
I 3
.El
.Sh ERRORS
The following errors may be returned:
.Bl -tag -width [ENXIO]
.It Bq Er ENXIO
Nonexistent drive (on open); 
offset is too large or bad (undefined)
.Xr ioctl 2
code.
.It Bq Er EIO
Open failed, the device could not be reset.
.It Bq Er EBUSY
Drive in use.
.El
.Sh SEE ALSO
.Xr tu 4 ,
.Xr arff 8
.Sh HISTORY
The
.Nm
driver appeared in
.Bx 4.2 .
E 3
E 1
