share/man/man4/man4.vax/SCCS/s.vp.4
h64502
s 00002/00002/00093
d D 8.1 93/06/05 13:49:29 bostic 6 5
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00062/00049/00033
d D 6.3 91/03/27 23:52:10 cael 5 4
c  macro and text revision (-mdoc version 3)
e
s 00004/00026/00078
d D 6.2 86/05/14 18:41:39 bloom 4 3
c delete outdated cruft
e
s 00001/00001/00103
d D 6.1 85/05/15 17:26:14 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00032/00046/00072
d D 5.1 85/05/15 17:25:57 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00118/00000/00000
d D 4.1 85/05/15 17:25:47 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
D 5
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 5
I 5
D 6
.\" Copyright (c) 1980, 1991 Regents of the University of California.
.\" All rights reserved.
E 6
I 6
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 6
E 5
.\"
D 5
.\"	%W% (Berkeley) %G%
E 5
I 5
.\" %sccs.include.redist.man%
E 5
.\"
D 2
.TH VP 4 5/10/81
E 2
I 2
D 3
.TH VP 4 "27 July 1983"
E 3
I 3
D 5
.TH VP 4 "%Q%"
E 3
E 2
.UC 4
.SH NAME
vp \- Versatec interface
.SH SYNOPSIS
D 2
device vp0 at uba? csr 0177510 vector vpintr vpintr
E 2
I 2
.B "device vp0 at uba0 csr 0177510 vector vpintr vpintr"
E 2
.SH DESCRIPTION
E 5
I 5
.\"     %W% (Berkeley) %G%
.\"
.Dd %Q%
.Dt VP 4 vax
.Os BSD 4
.Sh NAME
.Nm vp
.Nd Versatec interface
.Sh SYNOPSIS
.Cd "device vp0 at uba0 csr 0177510 vector vpintr vpintr"
.Sh DESCRIPTION
E 5
D 4
The Versatec printer/plotter is normally used with the programs
.IR vpr (1),
.IR vprint (1)
or
.IR vtroff (1).
E 4
I 4
The Versatec printer/plotter is normally used with the
line printer system.
E 4
This description is designed for those who wish to drive the Versatec directly.
D 5
.PP
E 5
I 5
.Pp
E 5
D 2
The Versatec at Berkeley is 36\*(rq wide, and has 440 characters per line
and 7040 dots per line in plot mode (this is actually slightly less than
36\*(rq of dots.)
The paper used is continuous roll paper, and comes in 500' rolls.
.PP
E 2
To use the Versatec yourself, you must realize that you cannot open the
device,
D 5
.I /dev/vp0
E 5
I 5
.Pa /dev/vp0
E 5
if there is a daemon active.
You can see if there is a daemon active by doing a
D 2
.IR ps (1),
or by looking in the directory
.I /usr/spool/vpd.
If there is a file
.I lock
there, then there is probably a daemon
.IR /usr/lib/vpd
running.
If not, you should remove the
.I lock.
E 2
I 2
D 5
.IR lpq (1),
E 5
I 5
.Xr lpq 1 ,
E 5
and seeing if there are any files being sent.
I 4
Printing should be turned off using
D 5
.IR lpc (8).
E 4
E 2
.PP
E 5
I 5
.Xr lpc 8 .
.Pp
E 5
D 2
In any case, when your program tries to open the device
.I /dev/vp0
you may get one of two errors.
The first of these
ENXIO
indicates that the Versatec is already in use.
Your program can then
.IR sleep (2)
and try again in a while, or give up.
The second is
EIO
and indicates that the Versatec is offline.
.PP
To set the Versatec into plot mode you should include <vcmd.h> and use the
E 2
I 2
To set the Versatec into plot mode you should include
D 5
.RI < sys/vcmd.h >
E 5
I 5
.Aq Pa sys/vcmd.h
E 5
and use the
E 2
D 5
.IR ioctl (2)
E 5
I 5
.Xr ioctl 2
E 5
call
D 5
.IP
E 5
I 5
.Bd -literal -offset indent
E 5
ioctl(fileno(vp), VSETSTATE, plotmd);
D 5
.PP
E 5
I 5
.Ed
.Pp
E 5
where
D 2
.B plotmd
E 2
I 2
D 5
.I plotmd
E 5
I 5
.Em plotmd
E 5
E 2
is defined to be
D 5
.IP
\fBint\fR plotmd[] = { VPLOT, 0, 0 };
.PP
E 5
I 5
.Bd -literal -offset indent
int plotmd[] = { VPLOT, 0, 0 };
.Ed
.Pp
E 5
and
D 5
.I vp
E 5
I 5
.Em vp
E 5
is the result of a call to
D 5
.I fopen
E 5
I 5
.Xr fopen
E 5
on stdio.
When you finish using the Versatec in plot mode you should eject paper
D 5
by sending it a EOT after putting it back into print mode, i.e. by
.PP
'nf
	\fBint\fR prtmd[] = { VPRINT, 0, 0 };
	\&...
	fflush(vp);
	ioctl(fileno(vp), VSETSTATE, prtmd);
	write(fileno(vp), "\e04", 1);
.fi
D 4
.PP
D 2
.IR N.B. :
E 2
I 2
.BR N.B. :
E 2
If you use the standard I/O library with the Versatec you
.B must
do
.IP
setbuf(vp, vpbuf);
.PP
where
.I vpbuf
is declared
.IP
\fBchar\fR vpbuf[BUFSIZ];
.PP
otherwise the standard I/O library, thinking that the Versatec
D 2
is a terminal (since it is a character special file) will not adequately buffer
E 2
I 2
is a terminal (since it is a character special file) will
not adequately buffer
E 2
the data you are sending to the Versatec.
This will cause it to run
.B extremely
slowly and tends to grind the system to a halt.
E 4
.SH FILES
/dev/vp0
.SH SEE ALSO
D 2
vfont(5), vpr(1), vtroff(1), va(4)
E 2
I 2
vfont(5),
lpr(1),
lpd(8),
vtroff(1),
va(4)
E 2
.SH DIAGNOSTICS
E 5
I 5
by sending it a
.Tn EOT
after putting it back into print mode, i.e. by
.Bd -literal -offset indent
int prtmd[] = { VPRINT, 0, 0 };
\&...
fflush(vp);
ioctl(fileno(vp), VSETSTATE, prtmd);
write(fileno(vp), "\e04", 1);
.Ed
.Sh FILES
.Bl -tag -width /dev/vp0xx -compact
.It Pa /dev/vp0
.El
.Sh DIAGNOSTICS
E 5
D 2
None.
E 2
I 2
The following error numbers are significant at the
time the device is opened.
D 5
.TP 10
[ENXIO]
E 5
I 5
.Bl -tag -width [ENXIO]
.It Bq Er ENXIO
E 5
The device is already in use.
D 5
.TP
[EIO]
E 5
I 5
.It Bq Er EIO
E 5
The device is offline.
E 2
D 5
.SH BUGS
E 5
I 5
.El
.Sh SEE ALSO
.Xr lpr 1 ,
.Xr vtroff 1 ,
.Xr va 4
.Xr font 5 ,
.Xr lpd 8 ,
.Sh HISTORY
A
.Nm
driver appeared in
.At v7 .
.Sh BUGS
E 5
D 2
The configuration part of the driver assumes that the device is setup to
vector print mode through 0174 and plot mode through 0200.  Since the
driver doesn't care whether the device considers the interrupt to be
a print or a plot interrupt, it would be preferable to have these be
the same.  This since the configuration program can't be sure at boot
time which vector interrupted and where the interrupt vectors actually are.
For the time being, since our versatec is vectored as described above,
we specify that it has two interrupt vectors and are careful to detect
an interrupt through 0200 at boot time and (manually) pretend the interrupt
came through 0174.
E 2
I 2
The configuration part of the driver assumes that the device is set up to
vector print mode through 0174 and plot mode through 0200.
As the configuration program can't be sure
which vector interrupted at boot time,
we specify that it has two interrupt vectors,
and if an interrupt comes through 0200 it is reset to 0174.
This is safe for devices with one or two vectors at these two addresses.
Other configurations with 2 vectors may require changes in the driver.
E 2
E 1
