share/man/man4/man4.vax/SCCS/s.vv.4
h23020
s 00002/00002/00111
d D 8.1 93/06/05 13:49:35 bostic 7 6
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00086/00044/00027
d D 6.5 91/03/27 23:52:11 cael 6 5
c  macro and text revision (-mdoc version 3)
e
s 00001/00011/00070
d D 6.4 90/06/23 18:05:48 trent 5 4
c new copyright notice
e
s 00015/00004/00066
d D 6.3 89/02/14 17:34:41 bostic 4 3
c add Berkeley specific copyright notice
e
s 00005/00005/00065
d D 6.2 86/05/16 15:54:56 karels 3 2
c new trailers
e
s 00016/00024/00054
d D 6.1 85/05/15 17:52:14 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00078/00000/00000
d D 5.1 85/05/15 17:52:07 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
D 4
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 4
I 4
D 6
.\" Copyright (c) 1983 The Regents of the University of California.
E 6
I 6
D 7
.\" Copyright (c) 1983, 1991 The Regents of the University of California.
E 6
.\" All rights reserved.
E 7
I 7
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 7
E 4
.\"
I 4
D 5
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 5
I 5
.\" %sccs.include.redist.man%
E 5
.\"
E 4
D 6
.\"	%W% (Berkeley) %G%
E 6
I 6
.\"     %W% (Berkeley) %G%
E 6
.\"
D 2
.TH VV 4 "27 July 1983"
E 2
I 2
D 6
.TH VV 4 "%Q%"
E 2
.UC 5
.SH NAME
vv \- Proteon proNET 10 Megabit ring
.SH SYNOPSIS
D 2
.B "device vv0 at uba0 csr 161000 vector vvrint vvxint"
E 2
I 2
.B "device vv0 at uba0 csr 0161000 vector vvrint vvxint"
E 2
.SH DESCRIPTION
E 6
I 6
.Dd %Q%
.Dt VV 4 vax
.Os BSD 4.2
.Sh NAME
.Nm vv
.Nd Proteon proNET 10 Megabit ring
.Sh SYNOPSIS
.Cd "device vv0 at uba0 csr 0161000 vector vvrint vvxint"
.Sh DESCRIPTION
E 6
The
D 6
.I vv
interface provides access to a 10 Mb/s Proteon proNET ring network.
.PP
E 6
I 6
.Nm vv
interface provides access to a 10 Mb/s Proteon
.Tn proNET
ring network.
.Pp
E 6
D 2
The network number to which the interface is attached must
be specified with an SIOCSIFADDR ioctl before data can be
transmitted or received.
The host's address is discovered by putting the interface in
digital loopback mode (not joining the ring)
and sending a broadcast packet from which the source
address is extracted.
the Internet address of the interface would be 128.3.0.24.
E 2
I 2
The network address of the interface must be specified with an
D 6
an SIOCSIFADDR ioctl before data can be transmitted or received.
E 6
I 6
an
.Dv SIOCSIFADDR
.Xr ioctl 2
before data can be transmitted or received.
E 6
It is only permissible to change the network address while the
D 6
interface is marked "down".
E 2
.PP
E 6
I 6
interface is marked
.Dq down .
.Pp
E 6
D 2
The interface software implements error-rate limiting on
the input side.
This provides a defense against situations where other hosts
or interface hardware failures cause a machine to be
inundated with garbage packets.
The scheme involves an exponential backoff where the input
side of the interface is disabled for longer and longer periods.
In the limiting case,
the interface is turned on every two minutes or so to see
if operation can resume.
E 2
I 2
The host's hardware address is discovered by putting the interface in
digital loopback mode (not joining the ring) and sending a broadcast
packet from which the hardware address is extracted.
E 2
D 6
.PP
E 6
I 6
.Pp
E 6
I 2
Transmit timeouts are detected through use of a watchdog routine.
Lost input interrupts are checked for when packets are sent out.
D 6
.PP
E 2
If the installation is running CTL boards which use the old broadcast
address of 0 instead of the new address of 0xff, the define OLD_BROADCAST
E 6
I 6
.Pp
If the installation is running
.Tn CTL
boards which use the old broadcast
address of
.Ql 0
instead of the new address of
.Ql 0xff ,
the define
.Dv OLD_BROADCAST
E 6
should be specified in the driver.
D 6
.PP
D 3
If the installation has a Wirecenter, the define WIRECENTER should
be specified in the driver.
.BR N.B. :
Incorrect definition of WIRECENTER can cause hardware damage.
.PP
E 3
D 2
The interface normally tries to use a ``trailer'' encapsulation
to minimize copying data on input and output.  This may be
disabled, on a per-interface basis, by setting the IFF_NOTRAILERS
flag with an SIOCSIFFLAGS ioctl.
E 2
I 2
The driver can use ``trailer'' encapsulation to minimize copying
E 6
I 6
.Pp
The driver can use
.Dq trailer
encapsulation to minimize copying
E 6
data on input and output.
This may be disabled, on a per-interface basis,
D 6
by setting the IFF_NOTRAILERS flag with an SIOCSIFFLAGS ioctl.
E 2
.SH DIAGNOSTICS
.PP
\fBvv%d: host %d\fP.  The software announces the host
E 6
I 6
by setting the
.Dv IFF_NOTRAILERS
flag with an
.Dv SIOCSIFFLAGS 
.Xr ioctl .
.Sh DIAGNOSTICS
.Bl -diag
.It vv%d: host %d.
The software announces the host
E 6
address discovered during autoconfiguration.
D 6
.PP
\fBvv%d: can't initialize\fP. The software was unable to
E 6
I 6
.Pp
.It vv%d: can't initialize.
The software was unable to
E 6
discover the address of this interface, so it deemed
"dead" will not be enabled.
D 6
.PP
\fBvv%d: error vvocsr=%b\fP.  The hardware indicated an error on
E 6
I 6
.Pp
.It vv%d: error vvocsr=%b.
The hardware indicated an error on
E 6
the previous transmission.
D 6
.PP
\fBvv%d: output timeout\fP.  The token timer has fired and the
E 6
I 6
.Pp
.It vv%d: output timeout.
The token timer has fired and the
E 6
token will be recreated.
D 6
.PP
\fBvv%d: error vvicsr=%b\fP.  The hardware indicated an error
E 6
I 6
.Pp
.It vv%d: error vvicsr=%b.
The hardware indicated an error
E 6
in reading a packet off the ring.
D 6
.PP
\fBen%d: can't handle af%d\fP.  The interface was handed
E 6
I 6
.Pp
.It en%d: can't handle af%d.
The interface was handed
E 6
a message with addresses formatted in an unsuitable address
family; the packet was dropped.
D 6
.PP
\fBvv%d: vs_olen=%d\fP.  The ring output routine has been
E 6
I 6
.Pp
.It vv%d: vs_olen=%d.
The ring output routine has been
E 6
handed a message with a preposterous length.  This results in
an immediate 
D 6
.IR "panic: vs_olen" .
.SH SEE ALSO
D 4
intro(4N), inet(4F)
E 4
I 4
netintro(4), inet(4)
E 4
I 3
.SH BUGS
The encapsulation of trailer packets in the 4.2BSD version of this driver
was incorrect (the packet type was in VAX byte order).
E 6
I 6
.Em panic: vs_olen .
.El
.Sh SEE ALSO
.Xr netintro 4 ,
.Xr inet 4
.Sh HISTORY
The
.Nm
driver appeared in
.Bx 4.2 .
.Sh BUGS
The encapsulation of trailer packets in the
.Bx 4.2
version of this driver
was incorrect (the packet type was in
.Tn VAX
byte order).
E 6
As a result, the trailer encapsulation in this version is not compatible
D 6
with the 4.2BSD VAX version.
E 6
I 6
with the
.Bx 4.2
.Tn VAX
version.
E 6
E 3
E 1
