share/man/man7/SCCS/s.environ.7
h43523
s 00001/00001/00152
d D 8.3 94/04/19 08:18:00 bostic 12 11
c spell
e
s 00010/00000/00143
d D 8.2 93/11/17 07:10:46 bostic 11 10
c add TZ
e
s 00002/00002/00141
d D 8.1 93/06/05 13:52:25 bostic 10 9
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00007/00000/00136
d D 6.8 92/11/04 08:56:06 bostic 9 8
c add TGMPDIR
e
s 00013/00001/00123
d D 6.7 92/03/01 16:52:26 bostic 8 7
c document BLOCKSIZE environmental variable
e
s 00017/00015/00107
d D 6.6 91/07/19 19:56:23 cael 7 6
c version three modc
e
s 00089/00067/00033
d D 6.5 90/06/24 19:01:48 cael 6 5
c converted man page
e
s 00005/00008/00095
d D 6.4 87/10/14 16:58:18 bostic 5 4
c don't underline "etc."
e
s 00053/00036/00050
d D 6.3 87/10/14 16:15:12 jak 4 3
c added TERMPATH, reordered, rephrased awkward parts (still needs work)
e
s 00002/00008/00084
d D 6.2 87/04/13 16:58:30 bostic 3 2
c add execle(3) to SEE ALSO
e
s 00001/00001/00091
d D 6.1 85/05/20 20:44:00 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00092/00000/00000
d D 5.1 85/05/20 20:43:46 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
D 6
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 6
I 6
D 10
.\" Copyright (c) 1983, 1990 The Regents of the University of California.
.\" All rights reserved.
E 10
I 10
.\" Copyright (c) 1983, 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 10
E 6
.\"
D 6
.\"	%W% (Berkeley) %G%
E 6
I 6
D 7
.\" %sccs.include.redist.man%
E 7
I 7
.\" %sccs.include.redist.roff%
E 7
E 6
.\"
D 2
.TH ENVIRON 7 "5 February 1983"
E 2
I 2
D 6
.TH ENVIRON 7 "%Q%"
E 2
.UC 5
.SH NAME
environ \- user environment
.SH SYNOPSIS
.B extern char **environ;
.SH DESCRIPTION
E 6
I 6
D 7
.\"     %W% (Berkeley) %G%
E 7
I 7
.\"	%W% (Berkeley) %G%
E 7
.\"
.Dd %Q%
.Dt ENVIRON 7
.Os BSD 4.2
.Sh NAME
.Nm environ
.Nd user environment
.Sh SYNOPSIS
.Ar extern char **environ ;
.Sh DESCRIPTION
E 6
D 4
An array of strings called the `environment' is made available by
E 4
I 4
An array of strings called the
D 6
.I environment
E 6
I 6
.Ar environment
E 6
is made available by
E 4
D 6
.IR execve (2)
E 6
I 6
.Xr execve  2
E 6
when a process begins.  By convention these strings have the form
D 4
.RI ` name = value '.
E 4
I 4
D 5
.IR name = value .
E 4
The following names are used by various commands:
E 5
I 5
D 6
``\fIname=value\fP''.  The following names are used by various commands:
E 5
D 4
.TP "\w'TERMCAP 'u"
PATH
The sequence of directory prefixes that
.I sh, time,
.IR nice (1),
etc., apply in searching for a file known by an incomplete path name.
The prefixes are separated by `:'.
.IR Login (1)
sets PATH=:/usr/ucb:/bin:/usr/bin.
E 4
I 4
.TP "\w'TERMPATH 'u"
EXINIT
E 6
I 6
.Dq Ar name=value .
The following names are used by various commands:
D 7
.Tw Fl
.Tp Ev EXINIT
E 7
I 7
D 8
.Bl -tag -width Fl
E 8
I 8
.Bl -tag -width BLOCKSIZE
.It Ev BLOCKSIZE
The size of the block units used by several commands, most notably
.Xr df 1 ,
.Xr du 1
and
.Xr ls 1 .
BLOCKSIZE may be specified in units of a byte by specifying a number, 
in units of a kilobyte by specifying a number followed by ``K'' or
``k'', in units of a megabyte by specifying a number followed by ``M''
or ``m'' and in units of a gigabyte by specifying a number followed
by ``G'' or ``g''.
Sizes less than 512 bytes or greater than a gigabyte are ignored.
E 8
.It Ev EXINIT
E 7
E 6
A startup list of commands read by
D 6
.IR ex (1),
.IR edit (1),
E 6
I 6
.Xr ex  1  ,
.Xr edit  1 ,
E 6
and
D 6
.IR vi (1).
E 4
.TP
HOME
E 6
I 6
.Xr vi  1  .
D 7
.Tp Ev HOME
E 7
I 7
.It Ev HOME
E 7
E 6
A user's login directory, set by
D 6
.IR login (1)
E 6
I 6
.Xr login  1
E 6
from the password file
D 6
.IR passwd (5).
.TP
I 4
PATH
E 6
I 6
.Xr passwd  5  .
D 7
.Tp Ev PATH
E 7
I 7
.It Ev PATH
E 7
E 6
The sequence of directories, separated by colons, searched by
D 6
.IR csh (1),
.IR sh (1),
.IR system (3),
.IR execvp (3),
E 6
I 6
.Xr csh  1  ,
.Xr sh  1 ,
.Xr system  3  ,
.Xr execvp  3 ,
E 6
D 5
.IR etc ,
when looking for an executable file.
PATH is set to :/usr/ucb:/bin:/usr/bin initially by
E 5
I 5
etc, when looking for an executable file.
PATH is set to ``:/usr/ucb:/bin:/usr/bin'' initially by
E 5
D 6
.IR login (1).
.TP
PRINTER
E 6
I 6
.Xr login  1  .
D 7
.Tp Ev PRINTER
E 7
I 7
.It Ev PRINTER
E 7
E 6
The name of the default printer to be used by
D 6
.IR lpr (1),
.IR lpq (1),
E 6
I 6
.Xr lpr  1  ,
.Xr lpq  1 ,
E 6
and
D 6
.IR lprm (1).
.TP
SHELL
E 6
I 6
.Xr lprm  1  .
D 7
.Tp Ev SHELL
E 7
I 7
.It Ev SHELL
E 7
E 6
The full pathname of the user's login shell.
D 6
.TP
E 4
TERM
E 6
I 6
D 7
.Tp Ev TERM
E 7
I 7
.It Ev TERM
E 7
E 6
The kind of terminal for which output is to be prepared.
This information is used by commands, such as
D 4
.I nroff
E 4
I 4
D 6
.IR nroff (1)
E 6
I 6
.Xr nroff  1
E 6
E 4
or
D 6
.IR plot (1G),
E 6
I 6
.Xr plot 1
E 6
which may exploit special terminal capabilities.  See
D 6
.I /etc/termcap
.RI ( termcap (5))
E 6
I 6
.Pa /usr/share/misc/termcap
D 12
.Pq Xr tmercap 5
E 12
I 12
.Pq Xr termcap 5
E 12
E 6
for a list of terminal types.
D 6
.TP
D 4
SHELL
The file name of the users login shell.
.TP
E 4
TERMCAP
E 6
I 6
D 7
.Tp Ev TERMCAP
E 7
I 7
.It Ev TERMCAP
E 7
E 6
D 4
The string describing the terminal in TERM, or the name of the termcap file, see
.IR termcap (5), termcap (3X).
.TP
EXINIT
A startup list of commands read by
.IR ex (1),
.IR edit (1),
E 4
I 4
The string describing the terminal in TERM, or, if
it begins with a '/', the name of the termcap file.
D 6
See TERMPATH below, 
.IR termcap (5),
E 6
I 6
See
.Ev TERMPATH
below,
.Xr termcap  5  ,
E 6
E 4
and
D 4
.IR vi (1).
E 4
I 4
D 6
.IR termcap (3X).
E 4
.TP
I 4
TERMPATH
E 6
I 6
.Xr termcap  .
D 7
.Tp Ev TERMPATH
E 7
I 7
.It Ev TERMPATH
E 7
E 6
A sequence of pathnames of termcap files, separated by colons or spaces,
D 5
which are searched for terminal descriptions in the order listed.
Having no TERMPATH is equivalent to a TERMPATH of
$HOME/.termcap:/etc/termcap.
E 5
I 5
which are searched for terminal descriptions in the order listed.  Having
D 6
no TERMPATH is equivalent to a TERMPATH of ``$HOME/.termcap:/etc/termcap''.
E 5
TERMPATH is ignored if TERMCAP contains a full pathname.
.TP
E 4
USER
E 6
I 6
no
.Ev TERMPATH
is equivalent to a
.Ev TERMPATH
of
.Dq Pa $HOME/.termcap:/etc/termcap .
.Ev TERMPATH
is ignored if
.Ev TERMCAP
contains a full pathname.
I 9
.It Ev TMPDIR
The directory in which to store temporary files.
Most applications use either
.Dq /tmp
or
.Dq /var/tmp .
Setting this variable will make them use another directory.
I 11
.It Ev TZ
The timezone to use when displaying dates.
The normal format is a pathname relative to
.Dq /usr/share/zoneinfo .
For example, the command
.Dq env TZ=US/Pacific date
displays the current time in California.
See
.Xr tzset 3
for more information.
E 11
E 9
D 7
.Tp Ev USER
E 7
I 7
.It Ev USER
E 7
E 6
The login name of the user.
D 4
.TP
PRINTER
The name of the default printer to be used by
.IR lpr (1),
.IR lpq (1),
and
.IR lprm (1).
E 4
D 6
.PP
E 6
I 6
D 7
.Tp
E 7
I 7
.El
E 7
.Pp
E 6
Further names may be placed in the environment by the
D 6
.I export
E 6
I 6
.Xr export
E 6
D 4
command and `name=value' arguments in
E 4
I 4
command and
D 6
.IR name = value
E 6
I 6
.Ar name=value
E 6
arguments in
E 4
D 6
.IR sh (1),
E 6
I 6
.Xr sh  1  ,
E 6
or by the
D 6
.I setenv
E 6
I 6
.Xr setenv
E 6
command if you use
D 6
.IR csh (1).
D 4
Arguments may also be placed in the environment at the point of an
.IR execve (2).
It is unwise to conflict with certain 
E 4
I 4
It is unwise to change certain 
E 4
.IR sh (1)
E 6
I 6
.Xr csh  1  .
It is unwise to change certain
.Xr sh  1
E 6
D 4
variables that are frequently exported by `.profile' files:
MAIL, PS1, PS2, IFS.
E 4
I 4
variables that are frequently exported by
D 6
.I .profile
files, such as MAIL, PS1, PS2, and IFS,
E 6
I 6
.Pa .profile
files, such as
.Ev MAIL ,
.Ev PS1 ,
.Ev PS2 ,
and
.Ev IFS ,
E 6
unless you know what you are doing.
E 4
D 6
.SH SEE ALSO
D 3
csh(1),
ex(1),
login(1),
sh(1),
execve(2),
system(3),
termcap(3X),
termcap(5)
E 3
I 3
csh(1), ex(1), login(1), sh(1), execve(2), execle(3),
system(3), termcap(3), termcap(5)
E 6
I 6
.Sh SEE ALSO
.Xr csh 1 ,
.Xr ex 1 ,
.Xr login 1 ,
.Xr sh 1 ,
.Xr execve 2 ,
.Xr execle 3 ,
.Xr system 3 ,
.Xr termcap 3 ,
.Xr termcap 5
.Sh HISTORY
D 7
.Nm Environ
appeared in 4.2 BSD.
E 7
I 7
The
.Nm environ
manual page appeared in
.Bx 4.2 .
E 7
E 6
E 3
E 1
