share/man/man7/SCCS/s.hier.7
h40324
s 00002/00000/00778
d D 8.5 94/06/01 20:51:31 ah 10 9
c page breaks for 4.4BSD manuals
e
s 00016/00013/00762
d D 8.4 94/05/06 12:00:36 mckusick 9 8
c outdent /usr/src as a special case to make it fit better
e
s 00003/00003/00772
d D 8.3 94/05/06 09:50:19 cael 8 7
c attempt to scoot lists to the left more
e
s 00622/00210/00153
d D 8.2 94/05/05 13:11:42 bostic 7 6
c NET/3 update
e
s 00002/00002/00361
d D 8.1 93/06/05 13:52:37 bostic 6 5
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00267/00187/00096
d D 6.3 91/07/23 17:43:40 cael 5 4
c version three mdoc
e
s 00281/00667/00002
d D 6.2 90/06/24 18:10:27 trent 4 3
c brand spankin' new man page for BSD 4.4 tree
e
s 00001/00001/00668
d D 6.1 85/05/20 20:28:33 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00155/00053/00514
d D 5.1 85/05/20 20:28:03 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00567/00000/00000
d D 4.1 85/05/20 20:27:42 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
D 4
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 4
I 4
D 6
.\" Copyright (c) 1990 The Regents of the University of California.
.\" All rights reserved.
E 6
I 6
D 7
.\" Copyright (c) 1990, 1993
E 7
I 7
.\" Copyright (c) 1990, 1993, 1994
E 7
.\"	The Regents of the University of California.  All rights reserved.
E 6
E 4
.\"
D 4
.\"	%W% (Berkeley) %G%
E 4
I 4
D 5
.\" %sccs.include.redist.man%
E 5
I 5
.\" %sccs.include.redist.roff%
E 5
E 4
.\"
D 2
.TH HIER 7
E 2
I 2
D 3
.TH HIER 7 "1 February 1983"
E 3
I 3
D 4
.TH HIER 7 "%Q%"
E 3
E 2
.UC 4
.SH NAME
hier \- file system hierarchy
.SH DESCRIPTION
D 2
The following outline gives a quick tour through
a representative directory hierarchy.
E 2
I 2
The following outline gives a quick tour through a representative
directory hierarchy.
E 2
.na
.nh
.IP /
root
.PD 0
.IP /vmunix
the kernel binary (UNIX itself)
.IP /lost+found
directory for connecting detached files for
D 2
.IR fsck (5)
E 2
I 2
.IR fsck (8)
E 2
.IP /dev/
devices (4)
.RS
I 2
.IP MAKEDEV
shell script to create special files
.IP MAKEDEV.local
site specific part of MAKEDEV
E 2
.IP console
main console,
.IR tty (4)
.IP tty*
terminals,
.IR tty (4)
D 2
.IP rp*
E 2
I 2
.IP hp*
E 2
disks,
.IR hp (4)
D 2
.IP rrp*
E 2
I 2
.IP rhp*
E 2
raw disks,
.IR hp (4)
.IP up*
UNIBUS disks
.IR up (4)
.IP ...
.RE
.IP /bin/
utility programs, cf /usr/bin/ (1)
.RS
.IP as
assembler
.IP cc
D 2
C compiler executive,
cf /lib/ccom, /lib/cpp, /lib/c2
E 2
I 2
C compiler executive, cf /lib/ccom, /lib/cpp, /lib/c2
E 2
.IP csh
C shell
.IP ...
.RE
.IP /lib/
object libraries and other stuff, cf /usr/lib/
.RS
.IP libc.a
system calls, standard I/O, etc. (2,3,3S)
.IP ...
.IP ccom
C compiler proper
.IP cpp
C preprocessor
.IP c2
C code improver
.IP ...
.RE
.IP /etc/
D 2
essential data and maintenance utilities;
sect (8)
E 2
I 2
essential data and maintenance utilities; sect (8)
E 2
.RS
.IP dump
dump program
.IR dump (8)
.IP passwd
password file,
.IR passwd (5)
.IP group
group file,
.IR group (5)
.IP motd
message of the day,
.IR login (1)
.IP termcap
description of terminal capabilities,
.IR termcap (5)
.IP ttytype
table of what kind of terminal is on each port,
.IR ttytype (5)
.IP mtab
mounted file table,
.IR mtab (5)
.IP dumpdates
dump history,
.IR dump (8)
.IP fstab
D 2
file system configurtion table
E 2
I 2
file system configuration table
E 2
.IR fstab (5)
I 2
.IP disktab
disk characteristics and partition tables,
.IR disktab (5)
.IP hosts
host name to network address mapping file,
.IR hosts (5)
.IP networks
network name to network number mapping file,
.IR networks (5)
.IP protocols
protocol name to protocol number mapping file,
.IR protocols (5)
.IP services
network services definition file,
.IR services (5)
.IP remote
names and description of remote hosts for 
.IR tip (1C),
.IR remote (5)
.IP phones
private phone numbers for remote hosts, as described in
.IR phones (5)
E 2
.IP ttys
properties of terminals,
.IR ttys (5)
.IP getty
part of
.IR login ,
.IR getty (8)
.IP init
the parent of all processes,
D 2
.IR init.vm (8)
E 2
I 2
.IR init (8)
E 2
.IP rc
shell program to bring the system up
I 2
.IP rc.local
site dependent portion of 
.I rc
E 2
.IP cron
the clock daemon,
.IR cron (8)
.IP mount
.IR mount (8)
D 2
.IP wall
.IR wall (8)
E 2
.IP ...
.RE
I 2
.IP /sys/
system source
.RS
.IP h/
header (include) files
.RS
.IP acct.h
.IR acct (5)
.IP stat.h
.IR stat (2)
.IP ...
.RE
.IP sys/
machine independent system source 
.RS
.IP init_main.c
.IP uipc_socket.c
.IP ufs_syscalls.c
.IP ...
.RE
.IP conf/
site configuration files
.RS
.IP GENERIC
.IP ...
.RE
.IP net/
general network source
.IP netinet/
DARPA Internet network source
.IP netimp/
network code related to use of an IMP
.RS
.IP if_imp.c
.IP if_imphost.c
.IP if_imphost.h
.IP ...
.RE
.IP vax/
source specific to the VAX
.RS
.IP locore.s
.IP machdep.c
.IP ...
.RE
.IP vaxuba/
device drivers for hardware which resides on the UNIBUS
.RS
.IP uba.c
.IP dh.c
.IP up.c
.IP ...
.RE
.IP vaxmba/
device drivers for hardware which resides on the MASBUS
.RS
.IP mba.c
.IP hp.c
.IP ht.c
.IP ...
.RE
.IP vaxif
network interface drivers for the VAX
.RS
.IP if_en.c
.IP if_ec.c
.IP if_vv.c
.IP ...
.RE
.RE
E 2
.IP /tmp/
temporary files, usually on a fast device, cf /usr/tmp/
.RS
.IP e*
used by
.IR ed (1)
.IP ctm*
used by 
.IR cc (1)
.IP ...
.RE
.IP /usr/
general-pupose directory, usually a mounted file system
.RS
.IP adm/
administrative information
.RS
.IP wtmp
login history,
.IR utmp (5)
.IP messages
hardware error messages
.IP tracct
phototypesetter accounting,
.IR troff (1)
.IP lpacct
line printer accounting
.IR lpr (1)
.IP "vaacct, vpacct"
varian and versatec accounting
.IR vpr (1),
.IR vtroff (1),
D 2
.IR vpac (1)
E 2
I 2
.IR pac (8)
E 2
.RE
.RE
.IP /usr\t/bin
.RS
utility programs, to keep /bin/ small
.IP tmp/
temporaries, to keep /tmp/ small
.RS
.IP stm*
used by
.IR sort (1)
.IP raster
used by
D 2
.IR plot (1)
E 2
I 2
.IR plot (1G)
E 2
.RE
.IP dict/
word lists, etc.
.RS
.IP words
principal word list, used by
.IR look (1)
.IP spellhist
history file for
.IR spell (1)
.RE
.IP games/
.RS
.IP hangman
.IP lib/
library of stuff for the games
.RS
.IP quiz.k/
what
.IR quiz (6)
knows
.RS
.IP index
category index
.IP africa
countries and capitals
.IP ...
.RE
.IP ...
.RE
.IP ...
.RE
.IP include/
standard #include files
.RS
.IP a.out.h
object file layout,
.IR a.out (5)
.IP stdio.h
standard I/O,
D 2
.IR stdio (3)
E 2
I 2
.IR intro (3S)
E 2
.IP math.h
(3M)
.IP ...
.IP sys/
D 2
system-defined layouts, cf /usr/sys/h
E 2
I 2
system-defined layouts, cf /sys/h
.IP net/
symbolic link to sys/net
.IP machine/
symbolic link to sys/machine
.IP ...
E 2
.RE
.IP lib/
object libraries and stuff, to keep /lib/ small
.RS
.IP atrun
scheduler for
.IR at (1)
.IP lint/
utility files for lint
.RS
.IP lint[12]
subprocesses for
.IR lint (1)
.IP llib-lc
dummy declarations for /lib/libc.a, used by
.IR lint (1)
.IP llib-lm
dummy declarations for /lib/libc.m
.IP ...
.RE
.IP struct/
passes of
.IR struct (1)
.IP ...
.IP tmac/
macros for
.IR troff (1)
.RS
.IP tmac.an
macros for
.IR man (7)
.IP tmac.s
macros for
.IR ms (7)
.IP ...
.RE
.IP font/
fonts for
.IR troff (1)
.RS
.IP ftR
Times Roman
.IP ftB
Times Bold
.IP ...
.RE
.IP uucp/
programs and data for
D 2
.IR uucp (1)
E 2
I 2
.IR uucp (1C)
E 2
.RS
.IP L.sys
remote system names and numbers
.IP uucico
the real copy program
.IP ...
.RE
.IP units
conversion tables for
.IR units (1)
.IP eign
list of English words to be ignored by
.IR ptx (1)
.RE
.RE
.br
.ne 5
.IP /usr/\tman/
.RS
volume 1 of this manual,
.IR man (1)
.RS
.IP man0/
general
.RS
.IP intro
introduction to volume 1,
.IR ms (7)
format
.IP xx
template for manual page
.RE
.IP man1/
chapter 1
.RS
.IP as.1
.IP mount.1m
.IP ...
.RE
.IP ...
.IP cat1/
preformatted pages for section 1
.IP ...
.RE
.IP msgs/
messages, cf
.IR msgs (1)
.RS
.IP bounds
highest and lowest message
.RE
.IP new/
binaries of new versions of programs
.IP preserve/
editor temporaries preserved here after crashes/hangups
.IP public/
binaries of user programs - write permission to everyone
.IP spool/
delayed execution files
.RS
.IP at/
used by 
.IR at (1)
.IP lpd/
used by
.IR lpr (1)
.RS
.IP lock
present when line printer is active
.IP cf*
copy of file to be printed, if necessary
.IP df*
daemon control file,
.IR lpd (8)
.IP tf*
transient control file, while 
.I lpr
is working
.RE
.IP uucp/
work files and staging area for 
D 2
.IR uucp (1)
E 2
I 2
.IR uucp (1C)
E 2
.RS
.IP LOGFILE
summary log
.IP LOG.*
log file for one transaction
.RE
.IP mail/
mailboxes for
.IR mail (1)
.RS
.TP
.I name
mail file for user
.I name
.TP
.IR name .lock
lock file while
.I name
is receiving mail
.RE
.IP secretmail/
like
.IR mail /
.IP uucp/
work files and staging area for 
D 2
.IR uucp (1)
E 2
I 2
.IR uucp (1C)
E 2
.RS
.IP LOGFILE
summary log
.IP LOG.*
log file for one transaction
I 2
.IP mqueue/
mail queue for 
.IR sendmail (8)
E 2
.RE
.RE
.TP
.I wd
initial working directory of a user,
typically
.I wd
is the user's login name
.RS
.TP
.BR . profile
set environment for
.IR sh (1),
D 2
.IR environ (5)
E 2
I 2
.IR environ (7)
E 2
.TP
.BR . project
what you are doing (used by (
.IR finger (1)
)
.TP
.BR . cshrc
startup file for
.IR csh (1)
.TP
.BR . exrc
startup file for
.IR ex (1)
.TP
.BR . plan
what your short-term plans are (used by
.IR finger (1)
)
.TP
.BR . netrc
D 2
startup file for
.IR net (1)
E 2
I 2
startup file for various network programs
E 2
.TP
.BR . msgsrc
startup file for
.IR msgs (1)
.TP
.BR . mailrc
startup file for
.IR mail (1)
.IP calendar
user's datebook for
.IR calendar (1)
.RE
.IP doc/
papers, mostly in volume 2 of this manual, typically in
.IR ms (7)
format
.RS
.IP as/
assembler manual
.IP c
C manual
.IP ...
.RE
.RE
.RE
.IP /usr/\tsrc/
.RS
.IP
source programs for utilities, etc.
.RS
D 2
.IP cmd/
source of commands
E 2
I 2
.IP bin/
source of commands in /bin
E 2
.RS
.IP as/
assembler
.IP ar.c
source for
.IR ar (1)
.IP ...
I 2
.RE
.IP usr.bin/
source for commands in /usr/bin
.RS
E 2
.IP troff/
source for
.I nroff
and
.IR troff (1)
.RS
.IP font/
source for font tables, /usr/lib/font/
.RS
.IP ftR.c
Roman
.IP ...
.RE
.IP term/
terminal characteristics tables, /usr/lib/term/
.RS
.IP tab300.c
DASI 300
.IP ...
.RE
.IP ...
.RE
.RE
I 2
.IP ucb
source for programs in /usr/ucb
E 2
.IP games/
source for /usr/games
I 2
.IP lib/
source for programs and archives in /lib
.RS
E 2
.IP libc/
D 2
source for functions in /lib/libc.a
E 2
I 2
C runtime library
E 2
.RS
D 2
.IP crt/
C runtime support
E 2
.IP csu/
startup and wrapup routines needed with every C program
.RS
.IP crt0.s
regular startup
.IP mcrt0.s
modified startup for
.I cc \-p
.RE
.IP sys/
system calls (2)
.RS
.IP access.s
D 2
.IP alarm.s
E 2
I 2
.IP brk.s
E 2
.IP ...
.RE
I 2
.RE
E 2
.IP stdio/
standard I/O functions (3S)
.RS
.IP fgets.c
.IP fopen.c
.IP ...
.RE
.IP gen/
other functions in (3)
.RS
.IP abs.c
.IP ...
.RE
I 2
.IP net/
network functions in (3N)
.RS
.IP gethostbyname.c
.IP ...
E 2
.RE
I 2
.RE
E 2
.IP local/
source which isn't normally distributed
.IP new/
source for new versions of commands and library routines
.IP old/
source for old versions of commands and library routines
D 2
.IP sys/
system source
.RS
.IP h/
header (include) files
.RS
.IP acct.h
.IR acct (5)
.IP stat.h
.IR stat (2)
.IP ...
.RE
.IP sys/
system source proper
.RS
.IP main.c
.IP pipe.c
.IP sysent.c
system entry points
.RE
.RE
.RE
E 2
.IP ucb/
binaries of programs developed at UCB
.RS
.IP ...
.IP edit
editor for beginners
.IP ex
command editor for experienced users
.IP ...
.IP mail
mail reading/sending subsystem
.IP man
on line documentation
.IP ...
.IP pi
Pascal translator
.IP px
Pascal interpreter
.IP ...
.IP vi
visual editor
.RE
.RE
.ad
.SH SEE ALSO
D 2
ls(1), apropos(1), whatis(1), whereis(1), finger(1), which (1), ncheck(8), find(1), grep(1)
E 2
I 2
ls(1),
apropos(1),
whatis(1),
whereis(1),
finger(1),
which(1),
ncheck(8),
find(1),
grep(1)
E 2
.SH BUGS
The position of files is subject to change without notice.
E 4
I 4
D 5
.\"     %W% (Berkeley) %G%
E 5
I 5
.\"	%W% (Berkeley) %G%
E 5
.\"
.Dd %Q%
.Dt HIER 7
D 5
.Os BSD 4.4
E 5
I 5
.Os
E 5
.Sh NAME
.Nm hier
.Nd layout of filesystems
.Sh DESCRIPTION
D 7
A sketch of the filesystem hierarchy.
D 5
.Dw Fl
.Di L
.Dp Li /
E 5
I 5
.Bl -tag -width "/stand/"
.It Li /
E 5
root directory of the filesystem
D 5
.Dp Li /bin/
E 5
I 5
.It Li /bin/
E 5
user utilities fundamental to both single-user and multi-user environments
D 5
.Dp Li /dev/
E 5
I 5
.It Li /dev/
E 5
block and character device files
E 7
I 7
An outline of the filesystem hierarchy.
D 8
.Bl -tag -width "/altroot/"
E 8
I 8
D 9
.Bl -hang -width 3n
E 9
I 9
.Bl -tag -width "/altroot/"
E 9
E 8
.It Sy \&/
root directory of the system
.It Sy /COPYRIGHT
system copyright notice
.It Sy "/[a-z]"
user filesystems
.It Sy /altroot/
alternate root filesystem, in case of disaster
.It Sy /amd/
home directories mount point; see
.Xr amd 8
.It Sy /bin/
utilities used in both single and multi-user environments
.It Sy /dev/
block, character and other special device files
E 7
D 5
.Dw Fl
.Di L
.Dp Li MAKEDEV
script for creating device files; see makedev(8)
.Dp Li fd/ 
file descriptor files; see fd(4)
.Dp
.Dp Li /etc/
E 5
I 5
.Pp
D 7
.Bl -tag -width MAKEDEV -compact
.It Li MAKEDEV
E 7
I 7
.Bl -tag -width "MAKEDEV" -compact
.It Sy MAKEDEV
E 7
script for creating device files;
see
.Xr makedev 8
D 7
.It Li fd/ 
E 7
I 7
.It Sy console
the computer's console device
.It Sy fd/
E 7
file descriptor files;
see
.Xr \&fd 4
I 7
.It Sy drum
system swap space; see
.Xr drum 4
.It Sy klog
kernel logging device; see
.Xr syslog 3
.It Sy kmem
kernel virtual memory device; see
.Xr mem 4
.It Sy log
UNIX domain datagram log socket; see
.Xr syslogd 8
.It Sy mem
kernel physical memory device; see
.Xr mem 4
.It Sy stderr
.It Sy stdin
.It Sy stdout
file descriptor files;
see
.Xr \&fd 4
.It Sy null
the null device; see
.Xr null 4
.It Sy tty
process' controlling terminal device; see
.Xr tty 4
E 7
.El
D 7
.It Li /etc/
E 7
I 7
.It Sy /dump/
online
.Xr dump 8
repository
.It Sy /etc/
E 7
E 5
system configuration files and scripts 
D 5
.Dw Fl
.Di L
.Dp Li localtime
local timezone information; see ctime(3)
.Dp Li disklabels/
backup disklabels; see disklabel(8)
.Dp Li kerberosIV/ 
configuration files for the kerberos version IV; see kerberos(1)
.Dp Li mtree/ 
mtree configuration files; see mtree(1)
.Dp Li namedb/ 
named configuration files; see named(8)
.Dp
.Dp Li /mnt/
empty directory commonly used by system administrators as a temporary mount point
.Dp Li /sbin/
system programs and administration utilities fundamental to both single-user and multi-user environments
.Dp Li /stand/
E 5
I 5
.Pp
D 7
.Bl -tag -width "disklabels/" -compact
.It Li localtime
local timezone information;
see
.Xr ctime 3
.It Li disklabels/
E 7
I 7
.Bl -tag -width "master.passwd" -compact
.It Sy aliases*
name alias files for
.Xr sendmail 8
.It Sy amd*
configuration files for
.Xr amd 8
.It Sy changelist
files backed up by the security script
.It Sy crontab
schedule used by the
.Xr cron 8
daemon
.It Sy csh.cshrc
.It Sy csh.login
.It Sy csh.logout
system-wide scripts for
.Xr csh 1
.It Sy daily
script run each day by
.Xr cron 8
.It Sy disklabels/
E 7
backup disklabels;
see
.Xr disklabel 8
D 7
.It Li kerberosIV/ 
E 7
I 7
.It Sy disktab
disk description file, see
.Xr disktab 5
.It Sy dm.conf
dungeon master configuration; see
.Xr dm.conf 5
.It Sy dumpdates
dump history; see
.Xr dump 8
.It Sy exports
filesystem export information; see
.Xr mountd 8
.It Sy fstab
filesystem information; see
.Xr fstab 5
and
.Xr mount 8
.It Sy ftpusers
users denied
.Xr ftp 1
access; see
.Xr ftpd 8
.It Sy ftpwelcome
.Xr ftp 1
initial message; see
.Xr ftpd 8
.It Sy gettytab
terminal configuration database; see
.Xr gettytab 8
.It Sy group
group permissions file; see
.Xr group 5
.It Sy hosts
host name database backup for
.Xr named 8 ;
see
.Xr hosts 5
.It Sy hosts.equiv
trusted machines with equivalent user ID's
.It Sy hosts.lpd
trusted machines with printing privileges
.It Sy inetd.conf
Internet server configuration file; see
.Xr inetd 8
.It Sy kerberosIV/ 
E 7
configuration files for the kerberos version IV;
see
.Xr kerberos 1
D 7
.It Li mtree/ 
E 7
I 7
.It Sy localtime
local timezone information;
see
.Xr ctime 3
.It Sy mail.rc
system-wide initialization script for
.Xr mail 1
.It Sy man.conf
configuration file for
.Xr man 1 ;
see
.Xr man.conf 5
.It Sy master.passwd
.It Sy passwd
.It Sy pwd.db
.It Sy spwd.db
password files and their databases; see
.Xr pwd_mkdb 8
.It Sy monthly
script run each month by
.Xr cron 8
.It Sy motd
system message of the day
.It Sy mtree/ 
E 7
mtree configuration files;
see
.Xr mtree 1
D 7
.It Li namedb/ 
named configuration files;
E 7
I 7
.It Sy named.*
.It Sy namedb/ 
named configuration files and databases;
E 7
see
.Xr named 8
I 7
.It Sy netgroup
network groups; see
.Xr netgroup 5
.It Sy netstart
network startup script
.It Sy networks
network name data base; see
.Xr networks 5
.It Sy phones
remote host phone number data base; see
.Xr phones 5
.It Sy printcap
system printer configuration; see
.Xr printcap 5
.It Sy protocols
protocol name database; see
.Xr protocols 5
.It Sy rc
.It Sy rc.local
system startup files; see
.Xr rc 8
.It Sy remote
remote host description file; see
.Xr remote 5
.It Sy security
daily (in)security script run by
.Xr cron 8
.It Sy sendmail.*
.Xr sendmail 8
configuration information
.It Sy services
service name data base; see
.Xr services 5
.It Sy shells
list of permitted shells; see
.Xr shells 5
.It Sy sliphome
slip login/logout scripts; see
.Xr slattach 8
.It Sy syslog.conf
.Xr syslogd 8
configuration file; see
.Xr syslog.conf 5
.It Sy termcap
terminal type database; see
.Xr termcap 3
.It Sy ttys
terminal initialization information; see
.Xr ttys 5
.It Sy weekly
script run each week by
.Xr cron 8
E 7
.El
D 7
.It Li /mnt/
E 7
I 7
.It Sy /home/
mount point for the automounter; see
.Xr amd 8
.It Sy /mnt/
E 7
empty directory commonly used by
system administrators as a temporary mount point
D 7
.It Li /sbin/
E 7
I 7
.It Sy /root/
home directory for the super-user
.Pp
.Bl -tag -width ".profile" -compact
.It Sy \&.rhosts
super-user id mapping between machines
.It Sy \&.cshrc
super-user start-up file
.It Sy \&.login
super-user start-up file
.It Sy \&.profile
super-user start-up file
.El
I 10
.ne 1i
E 10
.It Sy /sbin/
E 7
system programs and administration utilities
D 7
fundamental to both single-user and multi-user environments
.It Li /stand/
E 7
I 7
used in both single-user and multi-user environments
.It Sy /stand/
E 7
E 5
programs used in a standalone environment
D 5
.Dp Li /tmp/ 
temporary files, usually a mfs(8) memory-based filesystem (the contents
E 5
I 5
D 7
.It Li /tmp/ 
E 7
I 7
.It Sy /sys
symbolic link to the operating system source
.It Sy /tmp/ 
E 7
temporary files, usually a
.Xr mfs 8
memory-based filesystem (the contents
E 5
of /tmp are usually NOT preserved across a system reboot)
D 5
.Dp Li /usr/
E 5
I 5
D 7
.It Li /usr/
E 5
contains the majority of user utilities and applications 
E 7
I 7
.It Sy /usr/
contains the majority of the system utilities and files
E 7
D 5
.Dw Fl
.Di L
.Dp Li bin/
E 5
I 5
.Pp
.Bl -tag -width "libdata/" -compact
D 7
.It Li bin/
E 7
I 7
.It Sy X11
X11 files
.Pp
.Bl -tag -width "include/" -compact
.It Sy bin/
X11 binaries
.It Sy include/
X11 include files
.It Sy lib/
X11 libraries
.El
.It Sy bin/
E 7
E 5
common utilities, programming tools, and applications 
D 5
.Dp Li contrib/
E 5
I 5
D 7
.It Li contrib/
E 5
large packages contributed to Berkeley by outside parties
D 5
.Dp Li games/
E 5
I 5
.It Li games/
E 5
useful and semi-frivolous programs
D 5
.Dp Li include/
E 5
I 5
.It Li include/
E 7
I 7
.It Sy contrib/
packages maintained by groups other than Berkeley
.Pp
.Bl -tag -width "include/" -compact
.It Sy bin/
contributed binaries
.It Sy include/
contributed include files
.It Sy libexec/
contributed daemons
.It Sy libdata/
contributed data files
.El
.It Sy games/
the important stuff
.It Sy include/
E 7
E 5
standard C include files
D 5
.Dw Fl
.Di L
.Dp Li X11/
E 5
I 5
.Pp
.Bl -tag -width "kerberosIV/" -compact
D 7
.It Li X11/
E 5
C include files for X11 window system
D 5
.Dp Li arpa/
E 5
I 5
.It Li arpa/
E 5
C include files for Internet service protocols
D 5
.Dp Li kerberosIV/
C include files for kerberos authentication package; see kerberos(1)
.Dp Li machine/
E 5
I 5
.It Li kerberosIV/
C include files for kerberos authentication package;
E 7
I 7
.It Sy X11/
include files for X11 window system
.It Sy arpa/
include files for Internet service protocols
.It Sy g++/
include files for the C++ compiler
.It Sy kerberosIV/
include files for kerberos authentication package;
E 7
see
.Xr kerberos 1
D 7
.It Li machine/
E 5
machine specific C include files
D 5
.Dp Li net/
E 5
I 5
.It Li net/
E 5
misc network C include files
D 5
.Dp Li netimp/
C include files for IMP protocols; see imp(4)
.Dp Li netinet/
C include files for Internet standard protocols; see inet(4)
.Dp Li netiso/
C include files for ISO standard protocols; see iso(4)
.Dp Li netns/
C include files for XNS standard protocols; see ns(4)
.Dp Li nfs/
E 5
I 5
.It Li netimp/
C include files for IMP protocols;
E 7
I 7
.It Sy machine/
machine specific include files
.It Sy net/
miscellaneous network include files
.It Sy netccitt/
CCITT networking include files
.It Sy netinet/
include files for Internet standard protocols;
E 7
see
D 7
.Xr imp 4
.It Li netinet/
C include files for Internet standard protocols;
see
E 7
.Xr inet 4
D 7
.It Li netiso/
C include files for ISO standard protocols;
E 7
I 7
.It Sy netiso/
include files for ISO standard protocols;
E 7
see
.Xr iso 4
D 7
.It Li netns/
C include files for XNS standard protocols;
E 7
I 7
.It Sy netns/
include files for XNS standard protocols;
E 7
see
.Xr \&ns 4
D 7
.It Li nfs/
E 5
C include files for NFS (Network File System)
D 5
.Dp Li pascal/
include files for pc(1)
.Dp Li protocols/
E 5
I 5
.It Li pascal/
include files for pc 1
.It Li protocols/
E 5
C include files for Berkeley service protocols
D 5
.Dp Li sys/
E 5
I 5
.It Li sys/
E 5
system C include files (kernel data structures)
D 5
.Dp Li ufs/
E 5
I 5
.It Li ufs/
E 5
C include files for UFS (The U-word File System)
E 7
I 7
.It Sy nfs/
include files for NFS (Network File System)
.It Sy pascal/
include files for
.Xr pc 1
.It Sy protocols/
include files for Berkeley service protocols
.It Sy rpc/
include files for Sun Microsystem's RPC package
.It Sy sys/
kernel include files
.It Sy ufs/
include files for UFS
.It Sy xnscourier/
include files for XNS package
E 7
D 5
.Dp
.Dp Li lib/
E 5
I 5
.El
.Pp
D 7
.It Li lib/
E 5
archive libraries
E 7
I 7
.It Sy lib/
system C library archives; see 
.Xr ar 1
E 7
D 5
.Dw Fl
.Di L
.Dp Li uucp/
E 5
I 5
.Pp
D 7
.Bl -tag -width Fl -compact
.It Li uucp/
E 5
UUCP configuration files (historically placed; to be moved)
E 7
I 7
.Bl -tag -width "uucp/" -compact
.It Sy uucp/
UUCP binaries and scripts (historically placed; to be moved)
E 7
D 5
.Dp
.Dp Li libdata/
E 5
I 5
.El
I 9
.Pp
E 9
D 7
.It Li libdata/
E 5
misc. utility data files
D 5
.Dp Li libexec/
E 5
I 5
.It Li libexec/
E 5
system daemons & system utilities (executed by other programs)
D 5
.Dp Li local/
E 5
I 5
.It Li local/
E 7
I 7
.It Sy libdata/
miscellaneous utility data files
.It Sy libexec/
system daemons and system utilities (executed by other programs)
I 10
.ne 1i
E 10
.It Sy local/
E 7
E 5
local executables, libraries, etc.
D 5
.Dp Li obj/
E 5
I 5
D 7
.It Li obj/
E 5
architecture-specific target tree produced by building the /usr/src tree
D 5
.Dp Li old/
E 5
I 5
.It Li old/
E 5
programs from past lives of BSD which may disappear in future
releases
D 5
.Dp Li sbin/
E 5
I 5
.It Li sbin/
E 5
system daemons & system utilities (executed by users)
D 5
.Dp Li share/
E 5
I 5
.It Li share/
E 5
architecture-independent ascii text files
E 7
D 5
.Dw Fl
.Di L
.Dp Li calendar/
a variety of pre-fab calendar files; see calendar(1)
.Dp Li dict/
word lists; see look(1)
.Dw Fl
.Di L
.Dp Li words
E 5
I 5
.Pp
I 7
.Bl -tag -width "include/" -compact
.It Sy bin/
local binaries
.It Sy include/
local include files
.It Sy libexec/
local daemons
.It Sy libdata/
local data files
.El
.It Sy obj/
architecture-specific target tree produced by building the
.Pa /usr/src
tree; normally a symbolic link or mounted filesystem
.It Sy old/
programs from past lives of
.Bx 4
which may disappear in future releases
.Pp
.Bl -tag -width "include/" -compact
.It Sy bin/
old binaries
.It Sy include/
old include files
.It Sy libexec/
old daemons
.It Sy libdata/
old data files
.El
.It Sy sbin/
system daemons and system utilities (normally executed by the super-user)
.It Sy share/
architecture-independent text files
.Pp
E 7
.Bl -tag -width "calendar/" -compact
D 7
.It Li calendar/
a variety of pre-fab calendar files;
see
E 7
I 7
.It Sy calendar/
a variety of calendar files; see
E 7
.Xr calendar 1
D 7
.It Li dict/
E 7
I 7
.It Sy dict/
E 7
word lists;
see
.Xr look 1
I 7
and
.Xr spell 1
E 7
.Pp
D 7
.Bl -tag -width Fl -compact
.It Li words
E 7
I 7
.Bl -tag -width "special/" -compact
.It Sy words
E 7
E 5
common words
D 5
.Dp Li web2
E 5
I 5
D 7
.It Li web2
E 7
I 7
.It Sy web2
E 7
E 5
D 8
words from Webster's 2nd International
E 8
I 8
words of Webster's 2nd International
E 8
D 5
.Dp Li papers/
reference databases; see refer(1)
.Dp Li special/
custom word lists; see spell(1)
.Dp
.Dp Li doc/
misc documentation; src for most of the printed BSD manuals (available
from the USENIX association)
.Dp Li games/
E 5
I 5
D 7
.It Li papers/
E 7
I 7
.It Sy papers/
E 7
reference databases;
see
.Xr refer 1
D 7
.It Li special/
E 7
I 7
.It Sy special/
E 7
custom word lists;
see
.Xr spell 1
.El
.Pp
D 7
.It Li doc/
misc documentation;
src for most of the printed
.Bx BSD
E 7
I 7
.It Sy doc/
miscellaneous documentation; source for most of the printed
.Bx 4
E 7
manuals (available
from the
.Tn USENIX
association)
D 7
.It Li games/
E 5
ascii text files used by various games
D 5
.Dp Li man/
E 5
I 5
.It Li man/
E 5
manual pages 
D 5
.Dp Li me/
E 5
I 5
.It Li me/
E 5
macros for use with the me macro package
D 5
.Dp Li misc/
E 5
I 5
.It Li misc/
E 5
misc system-wide ascii text files
D 5
.Dw Fl
.Di L
.Dp Li termcap
terminal characteristics database; see termcap(5)
.Dp
.Dp Li mk/
templates for make; see make(1)
.Dp Li ms/
E 5
I 5
.Bl -tag -width Fl -compact
.It Li termcap
E 7
I 7
.It Sy games/
text files used by various games
.It Sy man/
formatted manual pages 
.It Sy me/
macros for use with the
.Xr me 7
macro package
.It Sy misc/
miscellaneous system-wide text files
.Pp
.Bl -tag -width "termcap" -compact
.It Sy termcap
E 7
terminal characteristics database;
see
.Xr termcap 5
.El
I 9
.Pp
E 9
D 7
.It Li mk/
templates for make;
see
E 7
I 7
.It Sy mk/
include files for
E 7
.Xr make 1
D 7
.It Li ms/
E 5
macros for use with the ms macro package
D 5
.Dp Li skel/
E 5
I 5
.It Li skel/
E 5
example . (dot) files for new accounts
D 5
.Dp Li tabset/
E 5
I 5
.It Li tabset/
E 5
tab description files for a variety of terminals; used in 
E 7
I 7
.It Sy ms/
macros for use with the
.Xr ms 7
macro package
.It Sy skel/
sample initialization files for new user accounts
.It Sy tabset/
tab description files for a variety of terminals, used in 
E 7
D 5
the termcap file; see termcap(5)
.Dp Li tmac/
text processing macros; see nroff(1) and troff(1)
.Dp Li zoneinfo/
timezone configuration information; see tzfile(5)
.Dp
.Dp Li src/
E 5
I 5
the termcap file;
see
.Xr termcap 5
D 7
.It Li tmac/
E 7
I 7
.It Sy tmac/
E 7
text processing macros;
see
.Xr nroff 1
and 
.Xr troff 1
D 7
.It Li zoneinfo/
E 7
I 7
.It Sy zoneinfo/
E 7
timezone configuration information;
see
.Xr tzfile 5
.El
I 9
.It Sy usr.bin/
source for utilities/files in
.Pa /usr/bin
.It Sy usr.sbin/
source for utilities/files in
.Pa /usr/sbin
.El
E 9
.Pp
D 7
.It Li src/
E 5
BSD and/or local source files
E 7
I 7
D 9
.It Sy src/
E 9
I 9
.It Sy /usr/src/
E 9
.Bx 4
and local source files
E 7
D 5
.Dw Fl
.Di L
.Dp Li bin/
E 5
I 5
.Pp
.Bl -tag -width "kerberosIV/" -compact
D 7
.It Li bin/
E 5
src for files in /bin 
D 5
.Dp Li contrib/
E 5
I 5
.It Li contrib/
E 5
src for files in /usr/contrib
D 5
.Dp Li etc/
E 5
I 5
.It Li etc/
E 5
src for files in /etc
D 5
.Dp Li games/
E 5
I 5
.It Li games/
E 5
src for files in /usr/games
D 5
.Dp Li include/
E 5
I 5
.It Li include/
E 5
src for files in /usr/include
D 5
.Dp Li kerberosIV/
E 5
I 5
.It Li kerberosIV/
E 5
src for kerberos version IV
D 5
.Dp Li lib/
E 5
I 5
.It Li lib/
E 5
src for files in /usr/lib
D 5
.Dp Li libexec/
E 5
I 5
.It Li libexec/
E 5
src for files in /usr/libexec
D 5
.Dp Li local/
E 5
I 5
.It Li local/
E 5
src for files in /usr/local
D 5
.Dp Li old/
E 5
I 5
.It Li old/
E 5
src for files in /usr/old
D 5
.Dp Li pgrm/
E 5
I 5
.It Li pgrm/
E 5
src for programming tools in /usr/bin
D 5
.Dp Li sbin/
E 5
I 5
.It Li sbin/
E 5
src for files in /sbin
D 5
.Dp Li share/
E 5
I 5
.It Li share/
E 5
src for files in /usr/share
D 5
.Dp Li sys/
E 5
I 5
.It Li sys/
E 5
kernel src files
D 5
.Dp Li usr.bin/
E 5
I 5
.It Li usr.bin/
E 5
src for files in /usr/bin
D 5
.Dp Li usr.sbin/
E 5
I 5
.It Li usr.sbin/
E 5
src for files in /usr/sbin
E 7
I 7
.It Sy bin/
source for utilities/files in
.Pa /bin 
.It Sy contrib/
source for utilities/files in
.Pa /usr/contrib
.It Sy etc/
source (usually example files) for files in
.Pa /etc
.It Sy games/
source for utilities/files in
.Pa /usr/games
.It Sy include/
source for files in
.Pa /usr/include
.It Sy kerberosIV/
source for Kerberos version IV utilities and libraries
.It Sy lib/
source for libraries in
.Pa /usr/lib
.It Sy libexec/
source for utilities/files in
.Pa /usr/libexec
.It Sy local/
source for utilities/files in
.Pa /usr/local
.It Sy old/
source for utilities/files in
.Pa /usr/old
.It Sy sbin/
source for utilities/files in
.Pa /sbin
.It Sy share/
source for files in
.Pa /usr/share
.Pp
D 8
.Bl -tag -width "doc/" -compact
E 8
I 8
D 9
.Bl -tag -width "doc" -compact
E 9
I 9
.Bl -tag -width "doc/" -compact
E 9
E 8
.It Sy doc/
.Pp
.Bl -tag -width "papers/" -compact
.It Sy papers/
source for various Berkeley technical papers
.It Sy psd/
source for Programmer's Supplementary Documents
.It Sy smm/
source for System Manager's Manual
.It Sy usd/
source for User's Supplementary Documents
E 7
D 5
.Dp
.Dp
.Dp Li /var/
E 5
I 5
.El
.El
D 7
.It Li /var/
E 7
I 7
.It Sy sys/
kernel source files
.Pp
.Bl -tag -width "deprecated/" -compact
.It Sy compile/
kernel compilation directory
.It Sy conf/
architecture independent configuration directory
.It Sy deprecated/
deprecated kernel functionality
.It Sy dev/
architecture independent device support
.It Sy hp/
general support for Hewlett-Packard architectures
.It Sy hp300/
support for the Hewlett-Packard 9000/300 68000-based workstations
.It Sy i386/
support for the Intel 386/486 workstations
.It Sy isofs/
support for ISO filesystems
.Pp
.Bl -tag -width "cd9660/" -compact
.It Sy cd9660/
support for the ISO-9660 filesystem
.El
I 9
.Pp
E 9
.It Sy kern/
support for the high kernel (system calls)
.It Sy libkern/
D 9
C library style kernel routines
E 9
I 9
C library routines used in the kernel
E 9
.It Sy luna68k/
Omron Luna 68000-based workstations
.It Sy mips/
general support for MIPS architectures
.It Sy miscfs/
miscellaneous file systems
.It Sy net/
miscellaneous networking support
.It Sy netccitt/
CCITT networking support
.It Sy netinet/
TCP/IP networking support
.It Sy netiso/
ISO networking support
.It Sy netns/
XNS networking support
.It Sy news3400/
Sony News MIPS-based workstations
.It Sy nfs/
NFS support
.It Sy pmax/
DECstation 3100 and 5000 MIPS-based workstations
.It Sy scripts/
kernel debugging scripts
.It Sy sparc/
Sparcstation I & II SPARC-based workstations
.It Sy stand/
kernel standalone support
.It Sy sys/
kernel (and system) include files
.It Sy tahoe/
D 9
Computer Consoles Inc. Tahoe architecture support
E 9
I 9
Computer Consoles Inc. Tahoe architecture (obsolete)
E 9
.It Sy tests/
kernel testing
.It Sy ufs/
local filesystem support
.Pp
.Bl -tag -width "ffs/" -compact
.It Sy ffs/
the Berkeley Fast File System
.It Sy lfs/
the log-structured file system
.It Sy mfs/
the in-memory file system
.It Sy ufs/
shared UNIX file system support
.El
.It Sy vax/
D 9
Digital Equipment Corp. VAX architecture support
E 9
I 9
Digital Equipment Corp. VAX architecture (obsolete)
E 9
.It Sy vm/
virtual memory support
D 9
.El
.It Sy usr.bin/
source for utilities/files in
.Pa /usr/bin
.It Sy usr.sbin/
source for utilities/files in
.Pa /usr/sbin
E 9
.El
.El
.It Sy /var/
E 7
E 5
multi-purpose log, temporary, transient, and spool files
D 5
.Dw Fl
.Di L
.Dp Li account/ 
E 5
I 5
.Pp
.Bl -tag -width "preserve/" -compact
D 7
.It Li account/ 
E 7
I 7
.It Sy account/ 
E 7
E 5
system accounting files
D 5
.Dw Fl
.Di L
.Dp Li acct
execution accounting file; see acct(5)
.Dp
.Dp Li at/
timed command scheduling files; see at(1)
.Dp Li backups/
E 5
I 5
.Pp
D 7
.Bl -tag -width Fl -compact
.It Li acct
E 7
I 7
.Bl -tag -width "acct" -compact
.It Sy acct
E 7
execution accounting file;
see
.Xr acct 5
.El
.Pp
D 7
.It Li at/
E 7
I 7
.It Sy at/
E 7
timed command scheduling files;
see
.Xr \&at 1
D 7
.It Li backups/
E 5
misc. backup files
D 5
.Dp Li db/ 
E 5
I 5
.It Li db/ 
E 5
misc. automatically generated system-specific database files
D 5
.Dp Li games/ 
E 5
I 5
.It Li games/ 
E 5
misc. game status and log files
D 5
.Dp Li log/ 
E 5
I 5
.It Li log/ 
E 5
misc. system log files
E 7
I 7
.It Sy backups/
miscellaneous backup files, largely of files found in
.Pa /etc
.It Sy crash/
system crash dumps; see
.Xr savecore 8
.It Sy db/ 
miscellaneous automatically generated system-specific database files
.It Sy games/ 
miscellaneous game status and log files
.It Sy log/ 
miscellaneous system log files
E 7
D 5
.Dw Fl
.Di L
.Dp Li wtmp
login/logout log; see wtmp(5)
.Dp
.Dp Li mail/ 
E 5
I 5
.Pp
D 7
.Bl -tag -width Fl -compact
.It Li wtmp
E 7
I 7
.Bl -tag -width "monthly.out" -compact
.It Sy amd.*
.Xr amd 8
logs
.It Sy daily.out
output of the last run of the
.Pa /etc/daily
script
.It Sy ftp.*
.Xr ftp 1
logs
.It Sy kerberos.*
.Xr kerberos 1
logs
.It Sy lastlog
system last time logged in log; see 
.Xr utmp 5
.It Sy lpd-errs.*
printer daemon error logs; see
.Xr lpd 8
.It Sy maillog.*
.Xr sendmail 8
log files
.It Sy messages.*
general system information log
.It Sy monthly.out
output of the last run of the
.Pa /etc/monthly
script
.It Sy secure
sensitive security information log
.It Sy sendmail.st
.Xr sendmail 8
statistics
.It Sy timed.*
.Xr timed 8
logs
.It Sy weekly.out
output of the last run of the
.Pa /etc/weekly
script
.It Sy wtmp
E 7
login/logout log;
see
D 7
.Xr wtmp 5
E 7
I 7
.Xr utmp 5
E 7
.El
.Pp
D 7
.It Li mail/ 
E 5
user mailbox files
D 5
.Dp Li preserve/
E 5
I 5
.It Li preserve/
E 5
temporary home of files preserved after an accidental death
D 5
of an editor; see ex(1) 
.Dp Li quotas/ 
E 5
I 5
of an editor;
see
.Xr \&ex 1 
.It Li quotas/ 
E 5
filesystem quota information files
D 5
.Dp Li run/
E 5
I 5
.It Li run/
E 5
system information files describing various info about
system since it was booted
E 7
I 7
.It Sy mail/ 
user system mailboxes
.It Sy msgs/
system messages; see
.Xr msgs 1
.It Sy preserve/
temporary home of files preserved after an accidental death of
.Xr ex 1
or
.Xr vi 1
.It Sy quotas/ 
filesystem quota information
.It Sy run/
system information files, rebuilt after each reboot
E 7
D 5
.Dw Fl
.Di L
.Dp Li utmp
database of current users; see utmp(5)
.Dp
.Dp Li rwho/ 
rwho data files; see rwhod(8), rwho(1), and ruptime(1)
.Dp Li spool/ 
E 5
I 5
.Pp
D 7
.Bl -tag -width Fl -compact
.It Li utmp
database of current users;
see
E 7
I 7
.Bl -tag -width "utmp" -compact
.It Sy utmp
database of current users; see
E 7
.Xr utmp 5
.El
.Pp
D 7
.It Li rwho/ 
rwho data files;
see
E 7
I 7
.It Sy rwho/ 
rwho data files; see
E 7
.Xr rwhod 8 ,
.Xr rwho 1 ,
and
.Xr ruptime 1
D 7
.It Li spool/ 
E 5
misc. printer and mail system spooling directories
E 7
I 7
.It Sy spool/ 
miscellaneous printer and mail system spooling directories
E 7
D 5
.Dw Fl
.Di L
.Dp Li ftp/ 
E 5
I 5
.Pp
D 7
.Bl -tag -width Fl -compact
.It Li ftp/ 
E 5
commonly ~ftp; the anonymous ftp root directory
D 5
.Dp Li mqueue/ 
undelivered mail queue; see sendmail(8)
.Dp Li output/
E 5
I 5
.It Li mqueue/ 
E 7
I 7
.Bl -tag -width "uucppublic/" -compact
.It Sy ftp/ 
commonly
.Dq ~ftp ,
the anonymous ftp root directory; see
.Xr ftpd 8
.It Sy mqueue/ 
E 7
undelivered mail queue;
see
.Xr sendmail 8
D 7
.It Li output/
E 5
line printer spooling directories
D 5
.Dp Li secretmail/ 
secretmail spool directory; see xget(1)
.Dp Li uucp/ 
E 5
I 5
.It Li secretmail/ 
E 7
I 7
.It Sy news/
Network news archival and spooling directories
.It Sy output/
printer spooling directories
.It Sy secretmail/ 
E 7
secretmail spool directory;
see
.Xr xget 1
D 7
.It Li uucp/ 
E 7
I 7
.It Sy uucp/ 
E 7
E 5
uucp spool directory
D 5
.Dp Li uucppublic/
E 5
I 5
D 7
.It Li uucppublic/
E 5
commonly ~uucp; public uucp temporary directory
E 7
I 7
.It Sy uucppublic/
commonly
.Dq ~uucp ,
the uucp public temporary directory; see
.Xr uucp 1
E 7
D 5
.Dp
.Dp Li tmp/ 
E 5
I 5
.El
.Pp
D 7
.It Li tmp/ 
E 5
temporary files that are kept between system reboots
E 7
I 7
.It Sy tmp/ 
temporary files that are not discarded between system reboots
.Pp
.Bl -tag -width "vi.recover/" -compact
.It Sy vi.recover/
recovery directory for
.Xr nvi 1
E 7
D 5
.Dp
.Dp Li /vmunix
E 5
I 5
.El
D 7
.It Li /vmunix
E 5
pure kernel executable (the operating system loaded into memory
at boot time).  
E 7
D 5
.Dp
E 5
I 5
.El
I 7
.It Sy /vmunix
the executable for the operating system
.El
E 7
E 5
.Sh SEE ALSO
D 5
.Xr ls 1 ,
E 5
I 5
D 7
.Xr \&ls 1 ,
E 7
E 5
.Xr apropos 1 ,
I 7
.Xr \&ls 1 ,
E 7
.Xr whatis 1 ,
.Xr whereis 1 ,
D 7
.Xr finger 1 ,
E 7
.Xr which 1 ,
D 7
.Xr find 1 ,
.Xr grep 1  ,
.Xr fsck 8 
E 7
.Sh HISTORY
D 5
4.4 BSD.
E 5
I 5
A
.Nm hier
manual page appeared in
.At v7 .
E 5
E 4
E 1
