share/man/man7/SCCS/s.hostname.7
h42939
s 00001/00001/00065
d D 8.2 93/12/30 15:53:48 mckusick 7 6
c copyediting for Usenix manuals
e
s 00002/00002/00064
d D 8.1 93/06/05 13:52:46 bostic 6 5
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00030/00030/00036
d D 6.5 90/06/24 19:05:42 cael 5 4
c converted man page
e
s 00002/00002/00064
d D 6.4 90/01/16 11:21:44 karels 4 3
c fixes from arc
e
s 00010/00005/00056
d D 6.3 89/12/14 11:37:24 karels 3 2
c add note about changeable search path
e
s 00014/00003/00047
d D 6.2 89/02/14 15:47:09 bostic 2 1
c add Berkeley specific header
e
s 00050/00000/00000
d D 6.1 87/11/21 14:33:27 karels 1 0
c date and time created 87/11/21 14:33:27 by karels
e
u
U
t
T
I 1
D 2
.\" Copyright (c) 1987 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 2
I 2
D 5
.\" Copyright (c) 1987 The Regents of the University of California.
E 5
I 5
D 6
.\" Copyright (c) 1987, 1990 The Regents of the University of California.
E 5
.\" All rights reserved.
E 6
I 6
.\" Copyright (c) 1987, 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 6
.\"
D 5
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 5
I 5
.\" %sccs.include.redist.man%
E 5
E 2
.\"
D 5
.\"	%W% (Berkeley) %G%
E 5
I 5
.\"     %W% (Berkeley) %G%
E 5
.\"
D 5
.TH HOSTNAME 7 "%Q%"
.UC 5
.SH NAME
hostname \- host name resolution description
.SH DESCRIPTION
E 5
I 5
.Dd %Q%
.Dt HOSTNAME 7
.Os BSD 4.2
.Sh NAME
.Nm hostname
.Nd host name resolution description
.Sh DESCRIPTION
E 5
Hostnames are domains, where a domain is a hierarchical, dot-separated
list of subdomains; for example, the machine monet, in the Berkeley
D 3
subdomain of the EDU subdomain of the ARPANET would be represented as
E 3
I 3
subdomain of the EDU subdomain of the Internet would be represented as
E 3
D 5
.br
		monet.Berkeley.EDU
.br
E 5
I 5
.Pp
.Dl monet.Berkeley.EDU
.Pp
E 5
(with no trailing dot).
D 5
.PP
E 5
I 5
.Pp
E 5
Hostnames are often used with network client and server programs,
which must generally translate the name to an address for use.
(This function is generally performed by the library routine
D 5
.IR gethostbyname (3).)
E 5
I 5
.Xr gethostbyname  3  . )
E 5
D 4
Hostnames are resolved by the internet name resolver in the following
E 4
I 4
Hostnames are resolved by the Internet name resolver in the following
E 4
fashion.
D 5
.PP
E 5
I 5
.Pp
E 5
If the name consists of a single component, i.e. contains no dot,
D 5
and if the environment variable ``HOSTALIASES'' is set to the name of a file,
E 5
I 5
and if the environment variable
.Dq Ev HOSTALIASES
is set to the name of a file,
E 5
D 7
that file is searched for an string matching the input hostname.
E 7
I 7
that file is searched for any string matching the input hostname.
E 7
The file should consist of lines made up of two white-space separated strings,
the first of which is the hostname alias,
and the second of which is the complete hostname
to be substituted for that alias.
D 4
If a case-sensitive match is found between the hostname to be resolved
E 4
I 4
If a case-insensitive match is found between the hostname to be resolved
E 4
and the first field of a line in the file, the substituted name is looked
up with no further processing.
D 5
.PP
E 5
I 5
.Pp
E 5
If the input name ends with a trailing dot,
the trailing dot is removed,
and the remaining name is looked up with no further processing.
D 5
.PP
E 5
I 5
.Pp
E 5
D 3
If the input name does not end with a trailing dot, it is looked up in
the local domain and its parent domains until either a match is found
or fewer than 2 components of the local domain remain.  For example,
E 3
I 3
If the input name does not end with a trailing dot, it is looked up
by searching through a list of domains until a match is found.
The default search list includes first the local domain,
then its parent domains with at least 2 name components (longest first).
For example,
E 3
in the domain CS.Berkeley.EDU, the name lithium.CChem will be checked first
as lithium.CChem.CS.Berkeley.EDU and then as lithium.CChem.Berkeley.EDU.
Lithium.CChem.EDU will not be tried, as the there is only one component
remaining from the local domain.
I 3
The search path can be changed from the default
by a system-wide configuration file (see
D 5
.IR resolver (5)).
E 3
.SH SEE ALSO
D 3
gethostbyname(3), resolver(5), mailaddr(7), named(8), RFC883
E 3
I 3
gethostbyname(3), resolver(5), mailaddr(7), named(8)
E 5
I 5
.Xr resolver  5  ) .
.Sh SEE ALSO
.Xr gethostbyname 3 ,
.Xr resolver 5 ,
.Xr mailaddr 7 ,
.Xr named 8
.Sh HISTORY
.Nm Hostname
appeared in 4.2 BSD.
E 5
E 3
E 1
