share/man/man7/SCCS/s.intro.7
h38515
s 00002/00002/00032
d D 8.1 93/06/05 13:52:51 bostic 4 3
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00030/00023/00004
d D 6.2 90/06/24 19:06:07 cael 3 2
c converted man page
e
s 00001/00001/00026
d D 6.1 85/05/20 20:44:27 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00027/00000/00000
d D 5.1 85/05/20 20:44:15 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
D 3
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 3
I 3
D 4
.\" Copyright (c) 1983, 1990 The Regents of the University of California.
.\" All rights reserved.
E 4
I 4
.\" Copyright (c) 1983, 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 4
E 3
.\"
D 3
.\"	%W% (Berkeley) %G%
E 3
I 3
.\" %sccs.include.redist.man%
E 3
.\"
D 2
.TH INTRO 7  "9 February 1983"
E 2
I 2
D 3
.TH INTRO 7  "%Q%"
E 2
.UC 5
.SH NAME
miscellaneous \- miscellaneous useful information pages
.SH DESCRIPTION
E 3
I 3
.\"     %W% (Berkeley) %G%
.\"
.Dd %Q%
.Dt INTRO 7
.Os BSD 4.2
.Sh NAME
.Nm intro
.Nd miscellaneous information pages
.Sh DESCRIPTION
E 3
This section contains miscellaneous documentation, mostly
in the area of text processing macro packages for
D 3
.IR troff (1).
.sp 2
.nf
.ta 1.25i
ascii	map of ASCII character set
environ	user environment
eqnchar	special character definitions for eqn
hier	file system hierarchy
mailaddr	mail addressing description
man	macros to typeset manual pages
me	macros for formatting papers
ms	macros for formatting manuscripts
term	conventional names for terminals
.fi
E 3
I 3
.Xr troff  1  .
.Pp
.Ds I
.Cw mailaddr
.Cl ascii	map of ASCII character set
.Cl environ	user environment
.Cl eqnchar	special character definitions for eqn
.Cl hier	file system hierarchy
.Cl mailaddr	mail addressing description
.Cl man	macros to typeset manual pages
.Cl \&me	macros for formatting papers
.Cl \&ms	macros for formatting manuscripts
.Cl term	conventional names for terminals
.Cw
.De
.Sh HISTORY
.Nm intro
appeared in 4.2 BSD.
E 3
E 1
