share/man/man7/SCCS/s.operator.7
h42572
s 00002/00002/00037
d D 8.1 93/06/09 19:18:59 bostic 7 6
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00000/00005/00039
d D 5.5 93/06/09 19:18:55 bostic 6 4
c fixed the under development line
e
s 00002/00002/00042
d R 8.1 93/06/05 13:54:17 bostic 5 4
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00031/00029/00013
d D 5.4 91/07/19 19:45:40 cael 4 3
c version three mdoc
e
s 00002/00002/00040
d D 5.3 90/08/31 13:36:58 cael 3 2
c fixed missing operator
e
s 00038/00040/00004
d D 5.2 90/06/24 19:14:27 cael 2 1
c converted man page
e
s 00044/00000/00000
d D 5.1 90/03/06 12:38:18 bostic 1 0
c date and time created 90/03/06 12:38:18 by bostic
e
u
U
t
T
I 1
D 2
.\" Copyright (c) 1989 The Regents of the University of California.
E 2
I 2
D 7
.\" Copyright (c) 1989, 1990 The Regents of the University of California.
E 2
.\" All rights reserved.
E 7
I 7
.\" Copyright (c) 1989, 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 7
.\"
D 2
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 2
I 2
D 4
.\" %sccs.include.redist.man%
E 4
I 4
.\" %sccs.include.redist.roff%
E 4
E 2
.\"
D 2
.\"	%W% (Berkeley) %G%
E 2
I 2
D 4
.\"     %W% (Berkeley) %G%
E 4
I 4
.\"	%W% (Berkeley) %G%
E 4
E 2
.\"
D 2
.TH OPERATOR 7 "%Q%"
.UC 7
.SH NAME
operator \- C operator precedence and order of evaluation
.SH DESCRIPTION
.nf
.ta \w'! ~ ++ -- - (type) * & sizeof     'u
Operator			Associativity
-----------------------------------------------
() [] -> .			left to right
! ~ ++ -- - (type) * & sizeof	right to left
* / %				left to right
+ -				left to right
<< >>				left to right
< <= > >=			left to right
== !=				left to right
&				left to right
^				left to right
|				left to right
&&				left to right
||				left to right
?:				right to left
= += -= etc.			right to left
,				left to right
.fi
.SH FILES
/usr/share/misc/operator
E 2
I 2
.Dd %Q%
.Dt OPERATOR 7
D 4
.Os BSD 4.4
E 4
I 4
.Os
E 4
.Sh NAME
.Nm operator
.Nd C operator precedence and order of evaluation
.Sh DESCRIPTION
D 4
.Ds I
.Cw xxxxxxxxxxxxxxxxxxxxxxxxxxxxx
.Cl Operator	Associativity
.Cl --------	-------------
.Cl \&() [] -> .	left to right
.Cl \&! ~ ++ -- - (type) * & sizeof	right to left
.Cl \&* / %	left to right
.Cl \&+ -	left to right
.Cl \&<< >>	left to right
.Cl \&< <= > >=	left to right
.Cl \&== !=	left to right
.Cl \&&	left to right
.Cl \&^	left to right
D 3
.Cl \&left to right
E 3
I 3
.Cl \&|	left to right
E 3
.Cl \&&&	left to right
D 3
.Cl \&left to right
E 3
I 3
.Cl \&||	left to right
E 3
.Cl \&?:	right to left
.Cl \&= += -= etc.	right to left
.Cl \&,	left to right
.Cw
.De
E 4
I 4
.Bd -ragged -offset indent -compact
.Bl -column "Operator    Associativity   "
.It Operator	Associativity
.It --------	-------------
.It \&() [] -> .	left to right
.It "! ~ ++ -- - (type) * & sizeof"	right to left
.It \&* / %	left to right
.It \&+ -	left to right
.It \&<< >>	left to right
.It \&< <= > >=	left to right
.It \&== !=	left to right
.It \&&	left to right
.It \&^	left to right
.It \&|	left to right
.It \&&&	left to right
.It \&||	left to right
.It \&?:	right to left
.It \&= += -= etc.	right to left
.It \&,	left to right
.El
.Ed
E 4
.Sh FILES
D 4
.Dw /usr/share/misc/operator
.Di L
.Dp Pa /usr/share/misc/operator
.Dp
E 4
I 4
.Bl -tag -width /usr/share/misc/operator -compact
.It Pa /usr/share/misc/operator
.El
E 4
D 6
.Sh HISTORY
D 4
4.4 BSD.
E 4
I 4
The
.Nm operator
manual page is
.Ud .
E 6
E 4
E 2
E 1
