sbin/mount_nfs/SCCS/s.mount_nfs.8
h55939
s 00047/00028/00168
d D 8.3 95/03/29 15:02:47 mckusick 5 4
c update for version 3
e
s 00128/00116/00068
d D 8.2 94/03/27 13:05:58 bostic 4 3
c Jan-Simon Pendry's and my new mount code
e
s 00002/00002/00182
d D 8.1 93/06/05 11:02:55 bostic 3 2
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00004/00001/00180
d D 5.2 92/03/17 17:26:53 mckusick 2 1
c add -P option to request use of reserved port
e
s 00181/00000/00000
d D 5.1 92/01/06 16:31:46 mckusick 1 0
c from Rick Macklem
e
u
U
t
T
I 1
D 3
.\" Copyright (c) 1992 The Regents of the University of California.
.\" All rights reserved.
E 3
I 3
D 4
.\" Copyright (c) 1992, 1993
E 4
I 4
D 5
.\" Copyright (c) 1992, 1993, 1994
E 5
I 5
.\" Copyright (c) 1992, 1993, 1994, 1995
E 5
E 4
.\"	The Regents of the University of California.  All rights reserved.
E 3
.\"
.\" %sccs.include.redist.roff%
.\"
.\"	%W% (Berkeley) %G%
.\"
.Dd %Q%
.Dt MOUNT_NFS 8
.Os BSD 4.4
.Sh NAME
.Nm mount_nfs
.Nd mount nfs file systems
.Sh SYNOPSIS
.Nm mount_nfs
D 2
.Op Fl bsiTMlqdckK
E 2
I 2
D 4
.Op Fl bsiTMlqdckPK
E 4
I 4
D 5
.Op Fl KMPTbcdiklqs
E 5
I 5
.Op Fl 3KPTUbcdilqs
E 5
.Op Fl D Ar deadthresh
I 5
.Op Fl I Ar readdirsize
E 5
.Op Fl L Ar leaseterm
E 4
E 2
.Op Fl R Ar retrycnt
I 4
.Op Fl a Ar maxreadahead
.Op Fl g Ar maxgroups
.Op Fl m Ar realm
.Op Fl o Ar options
E 4
.Op Fl r Ar readsize
D 4
.Op Fl w Ar writesize
E 4
.Op Fl t Ar timeout
I 4
.Op Fl w Ar writesize
E 4
.Op Fl x Ar retrans
D 4
.Op Fl g Ar maxgroups
.Op Fl a Ar maxreadahead
.Op Fl L Ar leaseterm
.Op Fl D Ar deadthresh
.Op Fl m Ar realm
E 4
.Ar rhost:path node
.Sh DESCRIPTION
The
.Nm mount_nfs
command
calls the
.Xr mount 2
D 4
system call to prepare and graft a
remote nfs file system
(rhost:path)
E 4
I 4
system call to prepare and graft a remote nfs file system (rhost:path)
E 4
on to the file system tree at the point
.Ar node.
This command is normally executed by
D 4
.Xr mount 8
setting the options with the
.Fl o
flag.
E 4
I 4
.Xr mount 8 .
E 4
D 5
It implements the mount protocol as described in RFC 1094, Appendix A.
E 5
I 5
It implements the mount protocol as described in RFC 1094, Appendix A and
.%T "NFS: Network File System Version 3 Protocol Specification" ,
Appendix I.
E 5
.Pp
The options are:
.Bl -tag -width indent
I 5
.It Fl 3
Use the NFS Version 3 protocol (Version 2 is the default).
E 5
D 4
.It Fl b
If an initial attempt to contact the server fails, fork off a child to keep
trying the mount in the background. Useful for
.Xr fstab 5
where the filesystem mount is not critical to multiuser operation.
.It Fl s
A soft mount, which implies that file system calls will fail
after \fBRetry\fR round trip timeout intervals.
.It Fl i
An interruptible mount, which implies that file system calls that are delayed
due to an unresponsive server will fail with EINTR when a termination signal
is posted for the process.
.It Fl T
Use TCP transport instead of UDP.
This is recommended for servers that are not on the
same LAN cable as the client.
(NB: This is NOT supported by most non-BSD servers.)
E 4
I 4
.It Fl D
Used with NQNFS to set the
.Dq "dead server threshold"
to the specified number of round trip timeout intervals.
After a
.Dq "dead server threshold"
of retransmit timeouts,
cached data for the unresponsive server is assumed to still be valid.
Values may be set in the range of 1 - 9, with 9 referring to an
.Dq "infinite dead threshold"
(i.e. never assume cached data still valid).
This option is not generally recommended and is really an experimental
feature.
I 5
.It Fl I
Set the readdir read size to the specified value. The value should normally
be a multiple of DIRBLKSIZ that is <= the read size for the mount.
E 5
.It Fl K
Pass Kerberos authenticators to the server for client-to-server
user-credential mapping.
D 5
This may only be used over TCP mounts between 4.4BSD clients and servers.
E 5
I 5
This requires that the kernel be built with the NFSKERB option.
(Refer to the INTERNET-DRAFT titled
.%T "Authentication Mechanisms for ONC RPC" ,
for more information.)
E 5
.It Fl L
Used with NQNFS to set the lease term to the specified number of seconds.
Only use this argument for mounts with a large round trip delay.
Values are normally in the 10-30 second range.
E 4
D 5
.It Fl M
Assume that other clients are not writing a file concurrently with this client.
D 4
This implements a slightly less strict
consistency criteria than 4.3BSD Reno did,
that is more in line with most commercial client implementations.
E 4
I 4
This implements a slightly less strict consistency criteria than 4.3BSD-Reno
did, that is more in line with most commercial client implementations.
E 4
This is recommended for servers that do not support leasing.
E 5
D 4
.It Fl d
Do not estimate retransmit timeout dynamically.
This may be useful for UDP
mounts that exhibit high retry rates.
E 4
I 4
.It Fl P
Use a reserved socket port number.
This is useful for mounting servers that require clients to use a
D 5
reserved port number.
E 5
I 5
reserved port number on the mistaken belief that this makes NFS
more secure. (For the rare case where the client has a trusted root account
but untrusworthy users and the network cables are in secure areas this does
help, but for normal desktop clients this does not apply.)
E 5
.It Fl R
Set the retry count for doing the mount to the specified value.
.It Fl T
Use TCP transport instead of UDP.
This is recommended for servers that are not on the same LAN cable as
the client.
(NB: This is NOT supported by most non-BSD servers.)
I 5
.It Fl U
Force the mount protocol to use UDP transport, even for TCP NFS mounts.
(Necessary for some old BSD servers.)
E 5
.It Fl a
Set the read-ahead count to the specified value.
This may be in the range of 0 - 4, and determines how many blocks
will be read ahead when a large file is being read sequentially.
D 5
This is recommended for mounts with a large bandwidth * delay product.
E 5
I 5
Trying a value greater than 1 for this is suggested for
mounts with a large bandwidth * delay product.
E 5
.It Fl b
If an initial attempt to contact the server fails, fork off a child to keep
trying the mount in the background.
Useful for
.Xr fstab 5 ,
where the filesystem mount is not critical to multiuser operation.
E 4
.It Fl c
For UDP mount points, do not do a
D 4
.Xr connect 2.
This must be used for servers that do not reply to requests from the standard
port number.
I 2
.It Fl P
Use a reserved socket port number. This is useful for mounting servers that
require clients to use a reserved port number.
E 2
.It Fl K
Pass Kerberos authenticators to the server for
client-to-server user-credential mapping.
This may only be used over TCP mounts between 4.4BSD clients and
servers.
E 4
I 4
.Xr connect 2 .
This must be used for servers that do not reply to requests from the
D 5
standard port number.
E 5
I 5
standard NFS port number 2049.
E 5
.It Fl d
D 5
Do not estimate retransmit timeout dynamically.
This may be useful for UDP mounts that exhibit high retry rates.
E 5
I 5
Turn off the dynamic retransmit timeout estimator.
This may be useful for UDP mounts that exhibit high retry rates,
since it is possible that the dynamically estimated timeout interval is too
short.
E 5
.It Fl g
Set the maximum size of the group list for the credentials to the
specified value.
This should be used for mounts on old servers that cannot handle a
group list size of 16, as specified in RFC 1057.
Try 8, if users in a lot of groups cannot get response from the mount
point.
.It Fl i
Make the mount interruptible, which implies that file system calls that
are delayed due to an unresponsive server will fail with EINTR when a
termination signal is posted for the process.
D 5
.It Fl k
Used with NQNFS to specify
.Dq get a lease
for the file name being looked up.
This is recommended unless the server is complaining about excessive
lease load.
E 5
.It Fl l
D 5
Used with NQNFS to specify that the \fBReaddir_and_Lookup\fR RPC should
E 5
I 5
Used with NQNFS and NFSV3 to specify that the \fBReaddirPlus\fR RPC should
E 5
be used.
This option reduces RPC traffic for cases such as
.Dq "ls -l" ,
D 5
but increases the lease load on the server.
This is recommended unless the server is complaining about excessive
lease load.
E 5
I 5
but tends to flood the attribute and name caches with prefetched entries.
Try this option and see whether performance improves or degrades. Probably
most useful for client to server network interconnects with a large bandwidth
times delay product.
E 5
.It Fl m
Set the Kerberos realm to the string argument.
Used with the
.Fl K
option for mounts to other realms.
.It Fl o
Options are specified with a
.Fl o
flag followed by a comma separated string of options.
See the
.Xr mount 8
man page for possible options and their meanings.
E 4
.It Fl q
D 5
Use the leasing extensions to the protocol to maintain cache consistency.
This protocol, referred to as Not Quite Nfs (NQNFS),
is only supported by 4.4BSD servers.
E 5
I 5
Use the leasing extensions to the NFS Version 3 protocol
to maintain cache consistency.
This protocol version 2 revision to Not Quite Nfs (NQNFS)
is only supported by this updated release of NFS code.
It is not backwards compatible with the version 1 NQNFS protocol
that was part of the first release of 4.4BSD-Lite.
To interoperate with a first release 4.4BSD-Lite NFS system you will have to
avoid this option until you have had an oppurtunity to upgrade the NFS code
to release 2 of 4.4BSD-Lite on all your systems.
E 5
D 4
.It Fl l
Used with NQNFS to specify that the
\fBReaddir_and_Lookup\fR RPC should be used.
This option reduces RPC traffic for cases such as ``ls -l'',
but increases the lease load on the server.
This is recommended unless the server is complaining
about excessive lease load.
.It Fl k
Used with NQNFS to specify ``get a lease'' for the file name being looked up.
This is recommended unless the server is complaining about excessive lease
load.
.El
.Pp
The following arguments take a value parameter that is either a decimal
number or a character string specified as =<value> after the option flag.
.Bl -tag -width indent
.It Fl R
Set the retry count for doing the mount to <value>.
.It Fl x
Set the retransmit timeout count for soft mounts to <value>.
E 4
.It Fl r
D 4
Set the read data size to <value>.
It should be a power of 2 greater than 512.
E 4
I 4
Set the read data size to the specified value.
D 5
It should be a power of 2 greater than or equal to 1024.
E 5
I 5
It should normally be a power of 2 greater than or equal to 1024.
E 5
E 4
This should be used for UDP mounts when the
D 4
``fragments dropped due to timeout''
E 4
I 4
.Dq "fragments dropped due to timeout"
E 4
value is getting large while actively using a mount point.
(Use
.Xr netstat 1
with the
D 4
.FL s
option to see what the ``fragments dropped due to timeout'' value is.)
E 4
I 4
.Fl s
option to see what the
.Dq "fragments dropped due to timeout"
value is.)
See the
.Fl w
option as well.
.It Fl s
A soft mount, which implies that file system calls will fail
after \fBRetry\fR round trip timeout intervals.
.It Fl t
Set the initial retransmit timeout to the specified value.
May be useful for fine tuning UDP mounts over internetworks
with high packet loss rates or an overloaded server.
Try increasing the interval if
.Xr nfsstat 1
shows high retransmit rates while the file system is active or reducing the
value if there is a low retransmit rate but long response delay observed.
I 5
(Normally, the -d option should be specified when using this option to manually
tune the timeout
interval.)
E 5
E 4
.It Fl w
D 4
Set the write data size to <value>.
E 4
I 4
Set the write data size to the specified value.
E 4
Ditto the comments w.r.t. the
.Fl r
D 4
option, but using the ``fragments dropped due to timeout'' value on the
server instead of the client.
E 4
I 4
option, but using the
.Dq "fragments dropped due to timeout"
value on the server instead of the client.
E 4
Note that both the
.Fl r
and
.Fl w
options should only be used as a last ditch effort at improving performance
when mounting servers that do not support TCP mounts.
D 4
.It Fl t
Set the initial retransmit timeout to <value>.
May be useful for fine tuning UDP mounts over internetworks
with high packet loss rates or an overloaded server.
Try increasing the interval if
.Xr nfsstat 1
shows high retransmit rates while the file system is active or reducing the
value if there is a low retransmit rate but long response delay observed.
.It Fl g
Set the maximum size of the group list for the credentials to <value>.
This should be used for mounts on old servers that cannot handle a group list
size of 16, as specified in RFC 1057.
Try 8, if users in a lot of groups
cannot get response from the mount point.
.It Fl a
Set the read-ahead count to <value>.
This may be in the range of 0 - 4 and determines how many blocks
will be read ahead when a large file is being read sequentially.
This is recommended for mounts with a large
bandwidth * delay product.
.It Fl L
Used with NQNFS to set the lease term to <value> seconds.
Only use this argument for mounts with a large round trip delay.
Values are normally in the 10-30 second range.
.It Fl D
Used with NQNFS to set the ``dead server threshold'' to <value> round trip
timeout intervals.
After a ``dead server threshold'' of retransmit timeouts,
cached data for the unresponsive server is assumed to still be valid.
Values may be set in the range of 1 - 9, with 9 referring to an ``infinite
dead threshold'' (i.e. never assume cached data still valid).
This option is not generally recommended and
is really an experimental feature.
.It Fl m
Set the Kerberos realm to the string argument. Used with the
.Fl K
option for mounts to other realms.
E 4
I 4
.It Fl x
Set the retransmit timeout count for soft mounts to the specified value.
E 4
.El
.Sh SEE ALSO
.Xr mount 2 ,
.Xr unmount 2 ,
D 4
.Xr fstab 5
E 4
I 4
.Xr fstab 5 ,
.Xr mount 8
E 4
.Sh BUGS
Due to the way that Sun RPC is implemented on top of UDP (unreliable datagram)
transport, tuning such mounts is really a black art that can only be expected
to have limited success.
For clients mounting servers that are not on the same
LAN cable or that tend to be overloaded,
TCP transport is strongly recommended,
but unfortunately this is restricted to mostly 4.4BSD servers.
E 1
