sbin/swapon/SCCS/s.swapon.8
h56095
s 00002/00002/00062
d D 8.1 93/06/05 11:22:34 bostic 6 5
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00047/00027/00017
d D 6.3 91/03/16 17:09:06 cael 5 4
c macro and text revision (-mdoc version 3)
e
s 00002/00006/00042
d D 6.2 88/06/30 17:16:37 bostic 4 3
c allow both -a and file names, minor cleanups
e
s 00001/00001/00047
d D 6.1 85/04/27 13:53:02 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00001/00001/00047
d D 5.1 85/04/27 13:52:42 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00048/00000/00000
d D 4.1 85/04/27 13:52:26 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
D 5
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 5
I 5
D 6
.\" Copyright (c) 1980, 1991 Regents of the University of California.
.\" All rights reserved.
E 6
I 6
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 6
E 5
.\"
D 5
.\"	%W% (Berkeley) %G%
E 5
I 5
.\" %sccs.include.redist.man%
E 5
.\"
D 2
.TH SWAPON 8 "4/1/81"
E 2
I 2
D 3
.TH SWAPON 8 "4 February 1983"
E 3
I 3
D 5
.TH SWAPON 8 "%Q%"
E 3
E 2
.UC 4
.SH NAME
swapon \- specify additional device for paging and swapping
.SH SYNOPSIS
D 4
.B "/etc/swapon"
.B \-a
.br
.B "/etc/swapon"
name ...
E 4
I 4
.B "swapon [-a] [special_file ...]"
E 4
.SH DESCRIPTION
.I Swapon
E 5
I 5
.\"     %W% (Berkeley) %G%
.\"
.Dd %Q%
.Dt SWAPON 8
.Os BSD 4
.Sh NAME
.Nm swapon
.Nd "specify additional device for paging and swapping"
.Sh SYNOPSIS
.Nm swapon
.Fl a
.Nm swapon
.Ar special_file ...
.Sh DESCRIPTION
.Nm Swapon
E 5
is used to specify additional devices on which paging and swapping
are to take place.
The system begins by swapping and paging on only a single device
so that only one disk is required at bootstrap time.
Calls to
D 5
.I swapon
E 5
I 5
.Nm swapon
E 5
normally occur in the system multi-user initialization file
D 5
.I /etc/rc
E 5
I 5
.Pa /etc/rc
E 5
making all swap devices available, so that the paging and swapping
activity is interleaved across several devices.
D 5
.PP
Normally, the
.B \-a
argument is given, causing all devices marked as ``sw''
E 5
I 5
.Pp
Normally, the first form is used:
.Bl -tag -width Ds
.It Fl a
All devices marked as ``sw''
E 5
swap devices in
D 5
.B /etc/fstab
to be made available.
.PP
E 5
I 5
.Pa /etc/fstab
are made available.
.El
.Pp
E 5
The second form gives individual block devices as given
in the system swap configuration table.  The call makes only this space
available to the system for swap allocation.
D 5
.SH SEE ALSO
swapon(2), init(8)
.SH FILES
.DT
D 4
/dev/[ru][pk]?b	normal paging devices
E 4
I 4
/dev/[ru][pk]?b	standard paging devices
E 4
.SH BUGS
E 5
I 5
.Sh SEE ALSO
.Xr swapon 2 ,
.Xr fstab 8
.Xr init 8
.Xr rc 8
.Sh FILES
.Bl -tag -width /dev/[ru][pk]?b -compact
.It Pa /dev/[ru][pk]?b
standard paging devices
.It Pa /etc/fstab
ascii filesystem description table
.El
.Sh BUGS
E 5
There is no way to stop paging and swapping on a device.
It is therefore not possible to make use of devices which may be
dismounted during system operation.
I 5
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.0 .
E 5
E 1
