usr.bin/uucp/uuq/SCCS/s.uuq.1
h14751
s 00002/00002/00098
d D 8.1 93/06/06 22:14:46 bostic 7 6
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00076/00068/00024
d D 6.6 91/04/23 21:31:43 cael 6 5
c mdoc version three/delete author section
e
s 00007/00003/00085
d D 6.5 91/03/15 12:38:37 bostic 5 4
c written by Rick Adams and friends; Berkeley copyright
e
s 00005/00005/00083
d D 6.4 90/06/29 21:06:10 trent 4 3
c /usr/spool -> /var/spool
e
s 00006/00002/00082
d D 6.3 88/10/24 12:00:08 bostic 3 2
c remove refs to [18]C, add copyright if needed
e
s 00037/00015/00047
d D 6.2 86/04/24 19:55:13 mckusick 2 1
c update from rfg
e
s 00062/00000/00000
d D 6.1 85/06/24 12:44:59 bloom 1 0
c manual page first distributed with 4.3BSD
e
u
U
t
T
I 3
D 5
.\" Copyright (c) 1988 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 5
I 5
D 6
.\" Copyright (c) 1988 The Regents of the University of California.
E 6
I 6
D 7
.\" Copyright (c) 1988, 1991 Regents of the University of California.
E 6
.\" All rights reserved.
E 7
I 7
.\" Copyright (c) 1988, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 7
.\"
D 6
.\" This code is derived from software contributed to Berkeley by
.\" Rick Adams.
E 6
I 6
.\" %sccs.include.redist.roff%
E 6
.\"
D 6
.\" %sccs.include.redist.man%
E 6
I 6
.\"     %W% (Berkeley) %G%
E 6
E 5
.\"
E 3
I 1
D 6
.\"	%W% (Berkeley) %G%
.\"
D 3
.TH UUQ 1C "%Q%"
E 3
I 3
.TH UUQ 1 "%Q%"
E 3
.UC 6
.SH NAME
uuq \- examine or manipulate the uucp queue
.SH SYNOPSIS
.B uuq
D 2
[\fB-l\fP] [\fB-h] [\fB-s\fPsystem] [\fB-u\fPuser] [\fB-d\fPjobno] [\fB-r\fPsdir] [\fB-b\fPbaudrate]
E 2
I 2
[
.B -l
] [
.B -h
] [
.BI -s system
] [
.BI -u user
] [
.BI -d jobno
] [
.BI -r sdir
] [
.BI -b baud
]
E 2
.SH DESCRIPTION
.I Uuq
E 6
I 6
.Dd %Q%
.Dt UUQ 1
.Os BSD 4.3
.Sh NAME
.Nm uuq
.Nd examine or manipulate the uucp queue
.Sh SYNOPSIS
.Nm uuq
.Op Fl l
.Op Fl h
.Op Fl s Ns Ar system
.Op Fl u Ns Ar user
.Op Fl d Ns Ar jobno
.Op Fl r Ns Ar sdir
.Op Fl b Ns Ar baud
.Sh DESCRIPTION
.Nm Uuq
E 6
is used to examine (and possibly delete) entries in the uucp queue.
D 6
.PP
E 6
I 6
.Pp
E 6
When listing jobs,
D 6
.I uuq
E 6
I 6
.Nm uuq
E 6
D 2
uses a format reminiscent of ls.
E 2
I 2
uses a format reminiscent of
D 6
.IR ls .
E 6
I 6
.Xr ls .
E 6
E 2
For the long format,
D 2
information for each job listed includes:
E 2
I 2
information for each job listed includes
E 2
job number, number of files to transfer, user who
spooled the job, number of bytes to send, type of command requested
(S for sending files, R for receiving files, X for remote uucp),
and file or command desired.
D 6
.PP
E 6
I 6
.Pp
E 6
Several options are available:
D 6
.TP 10
.B \-h
E 6
I 6
.Bl -tag -width Ar
.It Fl h
E 6
Print only the summary lines for each system.  Summary lines give system
name, number of jobs for the system, and total number of bytes to send.
D 6
.TP 10
.B \-l
E 6
I 6
.It Fl l
E 6
Specifies a long format listing.  The default is to list only the
job numbers sorted across the page.
D 2
.TP10
E 2
I 2
D 6
.TP 10
E 2
.BI \-s system
Limit output to jobs for systems whose system names begin with \fIsystem\fP.
.TP 10
.BI \-u user
Limit output to jobs for users whose login names begin with \fIuser\fP.
.TP 10
.BI \-d jobno
D 2
Delete job number \fIjobno\fP (as obtained from a previous uuq command) from
the uucp queue.
E 2
I 2
Delete job number \fIjobno\fP (as obtained from a previous \fIuuq\fP command)
E 6
I 6
.It Fl s Ns Ar system
Limit output to jobs for systems whose system names begin with
.Ar system .
.It Fl u Ns Ar user
Limit output to jobs for users whose login names begin with
.Ar user .
.It Fl d Ns Ar jobno
Delete job number
.Ar jobno
(as obtained from a previous
.Nm uuq
command)
E 6
from the uucp queue.
D 6
Only the UUCP Administrator is permitted to delete jobs.
E 2
.TP 10
.BI \-r sdir
Look for files in the spooling directory \fIsdir\fP instead of the default
E 6
I 6
Only the
.Tn UUCP
Administrator is permitted to delete jobs.
.It Fl r Ns Ar sdir
Look for files in the spooling directory
.Ar sdir
instead of the default
E 6
directory.
D 6
.TP 10
D 2
.BI \-b baudrate
Use \fIbaudrate\fP to compute the transfer time instead of the default
800 baud.
E 2
I 2
.BI \-b baud
Use \fIbaud\fP to compute the transfer time instead of the default
E 6
I 6
.It Fl b Ns Ar baud
Use
.Ar baud
to compute the transfer time instead of the default
E 6
1200 baud.
E 2
D 6
.SH FILES
D 2
/usr/spool/uucp/C.* \- command files
E 2
I 2
D 4
.ta \w'/usr/spool/uucp/D.hostname/D.*   'u
/usr/spool/uucp/	Default spool directory
/usr/spool/uucp/C./C.*	Control files
E 4
I 4
.ta \w'/var/spool/uucp/D.hostname/D.*   'u
/var/spool/uucp/	Default spool directory
/var/spool/uucp/C./C.*	Control files
E 4
E 2
.br
D 2
/usr/spool/uucp/D.* \- data files
E 2
I 2
D 4
/usr/spool/uucp/D\fIhostname\fP./D.*	Outgoing data files
/usr/spool/uucp/X./X.*	Outgoing execution files
E 4
I 4
/var/spool/uucp/D\fIhostname\fP./D.*	Outgoing data files
/var/spool/uucp/X./X.*	Outgoing execution files
E 4
E 2
.SH SEE ALSO
D 2
uucp(1C), uux(1C), uulog(1C)
E 2
I 2
D 3
uucp(1C), uux(1C), uulog(1C), uusnap(8C)
E 3
I 3
uucp(1), uux(1), uulog(1), uusnap(8)
E 3
E 2
.SH BUGS
E 6
I 6
.El
.Sh FILES
.Bl -tag -width /usr/spool/uucp/Dhostname./D.x -compact
.It Pa /usr/spool/uucp/
Default spool directory
.It Pa /usr/spool/uucp/C./C.*
Control files
.It Pa /usr/spool/uucp/D Ns Em hostname ./D.*
Outgoing data files
.It Pa /usr/spool/uucp/X./X.*
Outgoing execution files
.El
.Sh SEE ALSO
.Xr uucp 1 ,
.Xr uux 1 ,
.Xr uulog 1 ,
.Xr uusnap 8
.Sh BUGS
E 6
No information is available on work requested by the remote machine.
D 2
.br
E 2
I 2
D 6
.PP
E 6
I 6
.Pp
E 6
E 2
The user who requests a remote uucp command is unknown.
D 2
.br
uuq -l can be horrendously slow.
E 2
I 2
D 6
.PP
.B "Uuq -l"
E 6
I 6
.Pp
.Dq Li uq \-l
E 6
can be horrendously slow.
D 6
.SH AUTHOR
Lou Salkind, New York University
E 6
I 6
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.3 .
E 6
E 2
E 1
