From ado@elsie.nci.nih.gov  Thu Nov 15 18:32:09 1990
Received: from ucbvax.Berkeley.EDU by okeeffe.Berkeley.EDU (5.65/1.41)
	id AA02575; Thu, 15 Nov 90 18:32:09 -0800
Received: from elsie.nci.nih.gov by ucbvax.Berkeley.EDU (5.63/1.42)
	id AA18616; Thu, 15 Nov 90 18:32:32 -0800
Received: by elsie.nci.nih.gov (4.1/SMI-4.1)
	id AA14843; Thu, 15 Nov 90 21:31:19 EST
Date: Thu, 15 Nov 90 21:31:19 EST
From: ado@elsie.nci.nih.gov (Arthur David Olson)
Message-Id: <9011160231.AA14843@elsie.nci.nih.gov>
To: sunbugs@sun.com
Subject: SunOS 4.1 "ftpd -d" fails to save "anonymous" commands (with diagnosis)
Cc: 4bsd-bugs@ucbvax.Berkeley.EDU, more-bugs@mtxinu.com


This item was addressed to sunbugs@sun.com.  No reply from Sun is needed.

Workstation-Model:
	3/60		3/110		3/280		386i/150

Serial-Number:
	838F0353	827E1216	835E1456	851G0260

Sun-Software-Release-Number:
	<--------------SunOS 4.1--------------->	SunOS 4.0.2

My-Name:
	Arthur David Olson

Phone-Number:
	+1 (301) 496-5688

Electronic-Mail-Address:
	ado@elsie.nci.nih.gov

Company-Or-Organization-Name-And-Address:
	National Institutes of Health
	Building 37, Room 3C28
	Bethesda, MD  20892

Description:
	The SunOS 4.1 ftpd command's "-d" option fails to save the commands
	of any "anonymous" ftp users.

Repeat-By:
	In the script below, an ftp session is conducted while syslogd
	is set up to save ftpd's messages (see "0>>>>" below), and
	while inetd is set up to kick off ftpd with its logging and
	debugging options (see "1>>>>" below).  User "ado" successfully
	logs in (at "A>>>>") and transfers a file named "tzfolk" (at
	"B>>>>"); then user "anonymous" successfully logs in ("C>>>>")
	and transfers a file named "tiny" ("D>>>>").  Inspecting the
	log after the session is over ("E>>>>"), we see that nothing
	done after the "anonymous" login ("F>>>>") gets logged.  Pulled
	string ("G>>>>") opens door of cage ("H>>>>"), allowing canary
	("I>>>>") to fly. . .oops, wrong venue.

	Script started on Thu Nov 15 21:13:36 1990
	elsie$ uname -a
	SunOS elsie 4.1 1 sun3
	elsie$ head -1 /etc/syslog.conf
0>>>>	daemon.debug	/var/adm/ftplog
	elsie$ ls -l /var/adm/ftplog
	-rw-rw-rw-   1 root     staff          0 Nov 15 21:12 /var/adm/ftplog
	elsie$ grep in.ftpd /etc/inetd.conf
1>>>>	ftp	stream	tcp	nowait	root	/usr/etc/in.ftpd	in.ftpd -ld
	elsie$ ftp
	ftp> open elsie.nci.nih.gov
	Connected to elsie.nci.nih.gov.
	220 elsie FTP server (SunOS 4.1) ready.
	Name (elsie.nci.nih.gov:ado): ado
	331 Password required for ado.
	Password:
A>>>>	230 User ado logged in.
	ftp> dir tzfolk
	200 PORT command successful.
	150 ASCII data connection for /bin/ls (128.231.16.1,4156) (0 bytes).
	-rw-r--r--  1 ado      wheel         609 Oct 16 16:52 tzfolk
	226 ASCII Transfer complete.
	remote: tzfolk
	62 bytes received in 0.14 seconds (0.43 Kbytes/s)
	ftp> get tzfolk
	200 PORT command successful.
	150 ASCII data connection for tzfolk (128.231.16.1,4157) (609 bytes).
	226 ASCII Transfer complete.
	local: tzfolk remote: tzfolk
B>>>>	634 bytes received in 0.02 seconds (31 Kbytes/s)
	ftp> user anonymous
	331 Guest login ok, send ident as password.
	Password: 
C>>>>	230 Guest login ok, access restrictions apply.
	ftp> cd pub
	250 CWD command successful.
	ftp> dir
	200 PORT command successful.
	150 ASCII data connection for /bin/ls (128.231.16.1,4158) (0 bytes).
	total 3081
	-rw-r--r--  1 8800     0         3145713 Nov 15 23:22 e5+41.tar.Z
	-rw-r--r--  1 8800     0               3 Nov 15 23:53 tiny
	226 ASCII Transfer complete.
	139 bytes received in 0.68 seconds (0.2 Kbytes/s)
	ftp> get tiny
	200 PORT command successful.
	150 ASCII data connection for tiny (128.231.16.1,4159) (3 bytes).
	226 ASCII Transfer complete.
	local: tiny remote: tiny
D>>>>	4 bytes received in 1e-06 seconds (3.9e+03 Kbytes/s)
	ftp> quit
	221 Goodbye.
E>>>>	elsie$ cat /var/adm/ftplog
	Nov 15 21:14:34 elsie ftpd[14291]: connection from elsie at Thu Nov 15 21:14:34 1990
	Nov 15 21:14:34 elsie ftpd[14291]: <--- 220 
	Nov 15 21:14:34 elsie ftpd[14291]: elsie FTP server (SunOS 4.1) ready.
	Nov 15 21:14:36 elsie ftpd[14291]: command: USER ado
	Nov 15 21:14:36 elsie ftpd[14291]: <--- 331 
	Nov 15 21:14:36 elsie ftpd[14291]: Password required for ado.
	Nov 15 21:14:39 elsie ftpd[14291]: command: PASS XXXXXXXX
	Nov 15 21:14:39 elsie ftpd[14291]: <--- 230 
	Nov 15 21:14:39 elsie ftpd[14291]: User ado logged in.
	Nov 15 21:14:49 elsie ftpd[14291]: command: PORT 128,231,16,1,16,60
	Nov 15 21:14:49 elsie ftpd[14291]: <--- 200 
	Nov 15 21:14:49 elsie ftpd[14291]: PORT command successful.
	Nov 15 21:14:49 elsie ftpd[14291]: command: LIST tzfolk
	Nov 15 21:14:49 elsie ftpd[14291]: <--- 150 
	Nov 15 21:14:49 elsie ftpd[14291]: ASCII data connection for /bin/ls (128.231.16.1,4156) (0 bytes).
	Nov 15 21:14:49 elsie ftpd[14291]: <--- 226 
	Nov 15 21:14:49 elsie ftpd[14291]: ASCII Transfer complete.
	Nov 15 21:14:54 elsie ftpd[14291]: command: PORT 128,231,16,1,16,61
	Nov 15 21:14:54 elsie ftpd[14291]: <--- 200 
	Nov 15 21:14:54 elsie ftpd[14291]: PORT command successful.
	Nov 15 21:14:54 elsie ftpd[14291]: command: RETR tzfolk
	Nov 15 21:14:54 elsie ftpd[14291]: <--- 150 
	Nov 15 21:14:54 elsie ftpd[14291]: ASCII data connection for tzfolk (128.231.16.1,4157) (609 bytes).
	Nov 15 21:14:54 elsie ftpd[14291]: <--- 226 
	Nov 15 21:14:54 elsie ftpd[14291]: ASCII Transfer complete.
	Nov 15 21:15:01 elsie ftpd[14291]: command: USER anonymous
	Nov 15 21:15:01 elsie ftpd[14291]: <--- 331 
	Nov 15 21:15:01 elsie ftpd[14291]: Guest login ok, send ident as password.
F>>>>	Nov 15 21:15:06 elsie ftpd[14291]: command: PASS XXXXXXXX
	elsie$ exit

	script done on Thu Nov 15 21:15:41 1990

Diagnosis:
	When ftpd does its "chroot" call on anonymous logins, it loses access
	to the "/dev/log" socket set up by "syslogd", and thus loses access to
	system logging.
-- 
		Arthur David Olson	ado@elsie.nci.nih.gov
		ADO and Elsie are Ampex and Borden trademarks
