libexec/getty/SCCS/s.gettytab.5
h31810
s 00001/00000/00298
d D 8.5 94/06/01 21:02:20 ah 13 12
c page breaks for 4.4BSD manuals
e
s 00001/00001/00297
d D 8.4 94/04/19 07:53:09 bostic 12 11
c spell
e
s 00002/00002/00296
d D 8.3 94/04/19 07:52:40 bostic 11 10
c spell
e
s 00001/00000/00297
d D 8.2 94/04/16 07:07:33 bostic 10 9
c gettytab(5) doesn't document "np".
c From: "Chris G. Demetriou" <cgd@vangogh.CS.Berkeley.EDU>
e
s 00002/00002/00295
d D 8.1 93/06/04 18:50:15 bostic 9 8
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00186/00140/00111
d D 6.7 91/05/10 13:43:45 cael 8 7
c mdoc version three
e
s 00006/00000/00245
d D 6.6 91/03/27 12:36:01 william 7 6
c added description of no parity flag
e
s 00004/00003/00241
d D 6.5 91/01/19 17:19:58 bostic 6 5
c add Berkeley copyright notice
e
s 00003/00003/00241
d D 6.4 90/06/23 16:27:12 trent 5 4
c changed /bin/login to /usr/bin/login
e
s 00004/00005/00240
d D 6.3 86/05/19 17:31:55 karels 4 3
c correct error on special char propogation
e
s 00001/00000/00244
d D 6.2 86/01/07 15:14:13 mckusick 3 2
c add `dx' to enable DECCTLQ (from muller@nprdc.arpa)
e
s 00004/00009/00240
d D 6.1 85/05/15 18:58:28 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00249/00000/00000
d D 5.1 85/05/15 18:58:19 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
D 6
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 6
I 6
D 8
.\" Copyright (c) 1983 The Regents of the University of California.
E 8
I 8
D 9
.\" Copyright (c) 1983, 1991 The Regents of the University of California.
E 8
.\" All rights reserved.
E 9
I 9
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 9
.\"
D 8
.\" %sccs.include.redist.man%
E 8
I 8
.\" %sccs.include.redist.roff%
E 8
E 6
.\"
D 8
.\"	%W% (Berkeley) %G%
E 8
I 8
.\"     %W% (Berkeley) %G%
E 8
.\"
D 2
.TH GETTYTAB 5 "18 July 1983"
E 2
I 2
D 8
.TH GETTYTAB 5 "%Q%"
E 2
.UC 5
.SH NAME
gettytab \- terminal configuration data base
.SH SYNOPSIS
/etc/gettytab
.SH DESCRIPTION
.I Gettytab
E 8
I 8
.Dd %Q%
.Dt GETTYTAB 5
.Os BSD 4.2
.Sh NAME
.Nm gettytab
.Nd terminal configuration data base
.Sh SYNOPSIS
.Nm gettytab
.Sh DESCRIPTION
The
.Nm gettytab
file
E 8
is a simplified version of the
D 8
.IR termcap (5)
E 8
I 8
.Xr termcap 5
E 8
data base
used to describe terminal lines.
The initial terminal login process
D 8
.IR getty (8)
E 8
I 8
.Xr getty 8
E 8
accesses the
D 8
.I gettytab
E 8
I 8
.Nm gettytab
E 8
file each time it starts, allowing simpler
reconfiguration of terminal characteristics.
Each entry in the data base
is used to describe one class of terminals.
D 8
.PP
E 8
I 8
.Pp
E 8
There is a default terminal class,
D 8
.IR default ,
E 8
I 8
.Em default ,
E 8
that is used to set global defaults for all other classes.
(That is, the
D 8
.I default 
E 8
I 8
.Em default
E 8
entry is read, then the entry for the class required
is used to override particular settings.)
D 8
.SH CAPABILITIES
E 8
I 8
.Sh CAPABILITIES
E 8
Refer to
D 8
.IR termcap (5)
E 8
I 8
.Xr termcap 5
E 8
for a description of the file layout.
The
D 8
.I default
E 8
I 8
.Em default
E 8
column below lists defaults obtained if there is
no entry in the table obtained, nor one in the special
D 8
.I default
E 8
I 8
.Em default
E 8
table.
D 8
.nf

D 5
.ta \w'k0-k9  'u +\w'Type  'u +\w'``/bin/login"  'u
E 5
I 5
.ta \w'k0-k9  'u +\w'Type  'u +\w'``/usr/bin/login"  'u
E 5
\fBName	Type	Default	Description\fR
ap	bool	false	terminal uses any parity
bd	num	0	backspace delay
bk	str	0377	alternate end of line character (input break)
cb	bool	false	use crt backspace mode
cd	num	0	carriage-return delay
ce	bool	false	use crt erase algorithm
ck	bool	false	use crt kill algorithm
cl	str	NULL	screen clear sequence
co	bool	false	console - add \\n after login prompt
ds	str	^Y	delayed suspend character
I 3
dx	bool	false	set DECCTLQ
E 3
ec	bool	false	leave echo \s-2OFF\s0
ep	bool	false	terminal uses even parity
er	str	^?	erase character
et	str	^D	end of text (\s-2EOF\s0) character
ev	str	NULL	initial enviroment
f0	num	unused	tty mode flags to write messages
f1	num	unused	tty mode flags to read login name
f2	num	unused	tty mode flags to leave terminal as
fd	num	0	form-feed (vertical motion) delay
fl	str	^O	output flush character
hc	bool	false	do \s-2NOT\s0 hangup line on last close
he	str	NULL	hostname editing string
hn	str	hostname	hostname
ht	bool	false	terminal has real tabs
ig	bool	false	ignore garbage characters in login name
im	str	NULL	initial (banner) message
in	str	^C	interrupt character
is	num	unused	input speed
kl	str	^U	kill character
lc	bool	false	terminal has lower case
lm	str	login:	login prompt
ln	str	^V	``literal next'' character
D 5
lo	str	/bin/login	program to exec when name obtained
E 5
I 5
lo	str	/usr/bin/login	program to exec when name obtained
E 5
nd	num	0	newline (line-feed) delay
nl	bool	false	terminal has (or might have) a newline character
I 7
np	bool	false	terminal uses all 8 bits for display, thus no parity
E 7
nx	str	default	next table (for auto speed selection)
op	bool	false	terminal uses odd parity
os	num	unused	output speed
pc	str	\\0	pad character
pe	bool	false	use printer (hard copy) erase algorithm
pf	num	0	delay between first prompt and following flush (seconds)
ps	bool	false	line connected to a MICOM port selector
qu	str	^\\	quit character
rp	str	^R	line retype character
rw	bool	false	do \s-2NOT\s0 use raw for input, use cbreak
sp	num	unused	line speed (input and output)
su	str	^Z	suspend character
tc	str	none	table continuation
to	num	0	timeout (seconds)
tt	str	NULL	terminal type (for enviroment)
ub	bool	false	do unbuffered output (of prompts etc)
uc	bool	false	terminal is known upper case only
we	str	^W	word erase character
xc	bool	false	do \s-2NOT\s0 echo control chars as ^X
xf	str	^S	XOFF (stop output) character
xn	str	^Q	XON (start output) character
.br
.fi
.PP
E 8
I 8
.Bl -column Namexx /usr/bin/login Default
.It Sy Name	Type	Default	Description
.It "ap	bool	false	terminal uses any parity"
.It "bd	num	0	backspace delay"
.It "bk	str	0377	alternate end of line character (input break)"
.It "cb	bool	false	use crt backspace mode"
.It "cd	num	0	carriage-return delay"
.It "ce	bool	false	use crt erase algorithm"
.It "ck	bool	false	use crt kill algorithm"
.It "cl	str" Ta Dv NULL	Ta
.No "screen clear sequence"
.It "co	bool	false	console - add"
.Ql \en
after login prompt
.It "ds	str" Ta So Li ^Y Sc Ta
.No "delayed suspend character"
.It "dx	bool	false	set"
.Dv DECCTLQ
.It "ec	bool	false	leave echo"
.Tn OFF
.It "ep	bool	false	terminal uses even parity"
.It "er	str" Ta So Li ^? Sc Ta
.No "erase character"
.It "et	str" Ta So Li ^D Sc Ta
.No "end of text"
.Pq Dv EOF
character
.It "ev	str" Ta Dv NULL	Ta
D 11
.No "initial enviroment"
E 11
I 11
.No "initial environment"
E 11
.It "f0	num	unused	tty mode flags to write messages"
.It "f1	num	unused	tty mode flags to read login name"
.It "f2	num	unused	tty mode flags to leave terminal as"
.It "fd	num	0	form-feed (vertical motion) delay"
.It "fl	str" Ta So Li ^O Sc Ta
.No "output flush character"
.It "hc	bool	false	do"
.Tn NOT
hangup line on last close
.It "he	str" Ta Dv NULL	Ta
.No "hostname editing string"
.It "hn	str	hostname	hostname"
.It "ht	bool	false	terminal has real tabs"
.It "ig	bool	false	ignore garbage characters in login name"
.It "im	str" Ta Dv NULL Ta
.No "initial (banner) message"
.It "in	str" Ta So Li ^C Sc Ta
.No "interrupt character"
.It "is	num	unused	input speed"
.It "kl	str" Ta So Li ^U Sc Ta
.No "kill character"
.It "lc	bool	false	terminal has lower case"
.It "lm	str	login:	login prompt"
.It "ln	str" Ta So Li ^V Sc Ta
.No "``literal next'' character"
.It "lo	str" Ta Pa /usr/bin/login Ta
.No "program to exec when name obtained"
.It "nd	num	0	newline (line-feed) delay"
.It "nl	bool	false	terminal has (or might have) a newline character"
I 10
.It "np	bool	false	terminal uses no parity (i.e. 8-bit characters)"
E 10
.It "nx	str	default	next table (for auto speed selection)"
.It "op	bool	false	terminal uses odd parity"
.It "os	num	unused	output speed"
.It "pc	str" Ta So Li \e0 Sc Ta
.No "pad character"
.It "pe	bool	false	use printer (hard copy) erase algorithm"
.It "pf	num	0	delay"
between first prompt and following flush (seconds)
.It "ps	bool	false	line connected to a"
.Tn MICOM
port selector
.It "qu	str" Ta So Li \&^\e Sc Ta
.No "quit character"
.It "rp	str" Ta So Li ^R Sc Ta
.No "line retype character"
.It "rw	bool	false	do"
.Tn NOT
use raw for input, use cbreak
.It "sp	num	unused	line speed (input and output)"
.It "su	str" Ta So Li ^Z Sc Ta
.No "suspend character"
.It "tc	str	none	table continuation"
.It "to	num	0	timeout (seconds)"
.It "tt	str" Ta Dv NULL Ta
.No "terminal type (for environment)"
.It "ub	bool	false	do unbuffered output (of prompts etc)"
.It "uc	bool	false	terminal is known upper case only"
.It "we	str" Ta So Li ^W Sc Ta
.No "word erase character"
.It "xc	bool	false	do
.Tn NOT
echo control chars as
.Ql ^X
.It "xf	str" Ta So Li ^S Sc Ta Dv XOFF
(stop output) character
.It "xn	str" Ta So Li ^Q Sc Ta Dv XON
(start output) character
.El
.Pp
E 8
If no line speed is specified, speed will not be altered
from that which prevails when getty is entered.
Specifying an input or output speed will override
line speed for stated direction only.
D 8
.PP
E 8
I 8
.Pp
E 8
Terminal modes to be used for the output of the message,
for input of the login name,
and to leave the terminal set as upon completion,
are derived from the boolean flags specified.
If the derivation should prove inadequate,
D 12
any (or all) of these three may be overriden
E 12
I 12
any (or all) of these three may be overridden
E 12
with one of the
D 8
.BR f0 ,
.BR f1 ", or"
.B f2
E 8
I 8
.Em \&f0 ,
.Em \&f1 ,
or
.Em \&f2
E 8
numeric specifications, which can be used to specify
(usually in octal, with a leading '0')
the exact values of the flags.
Local (new tty) flags are set in the top 16 bits
of this (32 bit) value.
D 8
.PP
E 8
I 8
.Pp
E 8
Should
D 8
.I getty
E 8
I 8
.Xr getty
E 8
receive a null character
(presumed to indicate a line break)
it will restart using the table indicated by the
D 8
.B nx
E 8
I 8
.Em nx
E 8
entry. If there is none, it will re-use its original table.
D 8
.PP
E 8
I 8
.Pp
E 8
Delays are specified in milliseconds, the nearest possible
delay available in the tty driver will be used.
Should greater certainty be desired, delays
with values 0, 1, 2, and 3 are interpreted as
choosing that particular delay algorithm from the driver.
D 8
.PP
E 8
I 8
.Pp
E 8
The
D 8
.B cl
E 8
I 8
.Em \&cl
E 8
screen clear string may be preceded by a (decimal) number
of milliseconds of delay required (a la termcap).
This delay is simulated by repeated use of the pad character
D 8
.BR pc .
.PP
E 8
I 8
.Em \&pc .
I 13
.pl -1
E 13
.Pp
E 8
The initial message, and login message,
D 8
.B im
E 8
I 8
.Em \&im
E 8
and
D 8
.B lm
D 2
may include the character sequence \fB%h\fP to obtain
the hostname. (\fB%%\fP obtains a single '%' character.)
E 2
I 2
may include the character sequence \fB%h\fP or \fB%t\fP to obtain
E 8
I 8
.Em \&lm
may include the character sequence
.Em \&%h
or
.Em \&%t
to obtain
E 8
the hostname or tty name respectively.
D 8
(\fB%%\fP obtains a single '%' character.)
E 8
I 8
.Pf ( Em %%
obtains a single '%' character.)
E 8
E 2
The hostname is normally obtained from the system,
but may be set by the
D 8
.B hn
E 8
I 8
.Em \&hn
E 8
table entry.
In either case it may be edited with
D 8
.BR he .
E 8
I 8
.Em \&he .
E 8
The
D 8
.B he
E 8
I 8
.Em \&he
E 8
string is a sequence of characters, each character that
is neither '@' nor '#' is copied into the final hostname.
A '@' in the
D 8
.B he
E 8
I 8
.Em \&he
E 8
string, causes one character from the real hostname to
be copied to the final hostname.
A '#' in the
D 8
.B he
E 8
I 8
.Em \&he
E 8
string, causes the next character of the real hostname
to be skipped.
Surplus '@' and '#' characters are ignored.
D 8
.PP
E 8
I 8
.Pp
E 8
When getty execs the login process, given
in the
D 8
.B lo
D 5
string (usually "/bin/login"), it will have set
E 5
I 5
string (usually "/usr/bin/login"), it will have set
E 8
I 8
.Em \&lo
string (usually
.Dq Pa /usr/bin/login ) ,
it will have set
E 8
E 5
D 11
the enviroment to include the terminal type, as indicated
E 11
I 11
the environment to include the terminal type, as indicated
E 11
by the
D 8
.B tt
E 8
I 8
.Em \&tt
E 8
string (if it exists).
The
D 8
.B ev
E 8
I 8
.Em \&ev
E 8
string, can be used to enter additional data into
the environment.
It is a list of comma separated strings, each of which
will presumably be of the form
D 8
.IR name=value .
.PP
E 8
I 8
.Em name=value .
.Pp
E 8
If a non-zero timeout is specified, with
D 8
.BR to ,
E 8
I 8
.Em \&to ,
E 8
then getty will exit within the indicated
number of seconds, either having
received a login name and passed control
to
D 8
.IR login ,
E 8
I 8
.Xr login ,
E 8
or having received an alarm signal, and exited.
This may be useful to hangup dial in lines.
D 8
.PP
E 8
I 8
.Pp
E 8
Output from
D 8
.I getty
E 8
I 8
.Xr getty
E 8
is even parity unless
D 8
.B op
E 8
I 8
.Em \&op
E 8
is specified.
D 8
.B Op
E 8
I 8
The
.Em \&op
string
E 8
may be specified with
D 8
.B ap
E 8
I 8
.Em \&ap
E 8
to allow any parity on input, but generate odd parity output.
Note: this only applies while getty is being run,
terminal driver limitations prevent a more complete
implementation.
I 7
D 8
For terminals that use the full eight bit for character set (like the
IBM PC console and DEC VT 220 terminals), 
.B np
may be specified to provide no parity on output, which superceeds the
above mentioned parity options.
E 7
.I Getty
E 8
I 8
.Xr Getty
E 8
does not check parity of input characters in
D 8
.I RAW
E 8
I 8
.Dv RAW
E 8
mode.
D 8
.SH "SEE ALSO"
I 4
login(1),
E 4
termcap(5),
getty(8).
.SH BUGS
E 8
I 8
.Sh SEE ALSO
.Xr login 1 ,
.Xr termcap 5 ,
.Xr getty 8 .
.Sh BUGS
E 8
D 4
Some ignorant peasants insist on changing the default special
characters, so it is wise to always specify (at least) the
erase, kill, and interrupt characters in the
.B default
table.
E 4
I 4
The special characters (erase, kill, etc.) are reset to system defaults
by
D 8
.IR login (1).
E 8
I 8
.Xr login 1 .
E 8
E 4
In
D 8
.B all
E 8
I 8
.Em all
E 8
cases, '#' or '^H' typed in a login name will be treated as
an erase character, and '@' will be treated as a kill character.
D 8
.PP
E 8
I 8
.Pp
E 8
The delay stuff is a real crock.
Apart form its general lack of flexibility, some
of the delay algorithms are not implemented.
The terminal driver should support sane delay settings.
D 2
.PP
Currently
.IR login (1)
stomps on the environment, so there is no point
setting it in
.IR gettytab .
E 2
D 8
.PP
E 8
I 8
.Pp
E 8
The
D 8
.B he
E 8
I 8
.Em \&he
E 8
capability is stupid.
D 8
.PP
.I Termcap
E 8
I 8
.Pp
The
.Xr termcap
E 8
format is horrid, something more rational should
have been chosen.
I 8
.Sh HISTORY
The
.Nm gettytab
file format appeared in 4.2BSD.
E 8
E 1
