usr.bin/login/SCCS/s.login.1
h37492
s 00002/00000/00120
d D 8.2 94/05/05 10:47:02 bostic 17 16
c mention /var/log/lastlog
e
s 00002/00002/00118
d D 8.1 93/06/09 22:43:59 bostic 16 15
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00055/00109/00065
d D 6.12 91/06/29 13:24:05 bostic 15 14
c rewhack for correctness
e
s 00113/00093/00061
d D 6.11 91/04/26 05:24:44 cael 14 13
c mdoc version three/bsd copyright
e
s 00005/00005/00149
d D 6.10 91/04/18 15:54:27 bostic 13 12
c new copyright; att/bsd/shared
e
s 00002/00000/00152
d D 6.9 91/03/14 00:21:12 cael 12 10
c add .Vx so tmac.andoc will call tmac.mdoc-old
e
s 00001/00000/00152
d R 6.9 91/03/13 20:34:57 cael 11 10
c add .Vx so tmac.andoc will call tmac.mdoc-old
e
s 00004/00004/00148
d D 6.8 90/07/24 22:47:32 cael 10 9
c .Xr botch fix
e
s 00103/00086/00049
d D 6.7 90/06/24 19:09:26 cael 9 8
c converted man page
e
s 00000/00008/00135
d D 6.6 89/01/06 16:11:40 bostic 8 7
c -r going into rlogind
e
s 00001/00001/00142
d D 6.5 88/12/21 17:56:47 bostic 7 6
c no more subclasses of manual pages
e
s 00003/00003/00140
d D 6.4 87/09/14 13:02:15 bostic 6 5
c cross reference getpass(3)
e
s 00043/00010/00100
d D 6.3 87/06/27 17:34:44 karels 5 4
c add -f, formalize -h
e
s 00018/00013/00092
d D 6.2 86/05/08 15:09:35 karels 4 3
c fix up -p, add -h
e
s 00004/00005/00101
d D 6.1 85/04/29 18:55:48 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00011/00003/00095
d D 5.1 85/04/29 18:55:27 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00098/00000/00000
d D 4.1 85/04/29 18:55:03 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
D 9
.\" Copyright (c) 1980 Regents of the University of California.
E 9
I 9
D 13
.\" Copyright (c) 1980, 1990 Regents of the University of California.
E 9
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 13
I 13
D 16
.\" Copyright (c) 1980, 1990 The Regents of the University of California.
.\" All rights reserved.
E 16
I 16
.\" Copyright (c) 1980, 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 16
E 13
.\"
D 9
.\"	%W% (Berkeley) %G%
E 9
I 9
D 13
.\"     %W% (Berkeley) %G%
E 13
I 13
D 14
.\" %sccs.include.proprietary.roff%
E 14
I 14
.\" %sccs.include.redist.roff%
E 14
E 13
E 9
.\"
I 12
D 13
.Vx
E 13
I 13
.\"	%W% (Berkeley) %G%
.\"
E 13
D 14
.Vx
E 14
E 12
D 2
.TH LOGIN 1 4/1/81
E 2
I 2
D 3
.TH LOGIN 1 "1 April 1983"
E 3
I 3
D 9
.TH LOGIN 1 "%Q%"
E 3
E 2
.UC 4
.SH NAME
login \- sign on
.SH SYNOPSIS
.B login
D 3
[ username ]
E 3
I 3
D 5
[ \-p ] [ username ]
E 5
I 5
[
.B \-p
] [ username ]
.br
.B login
[
.B \-p
] [
.B \-h
hostname
] [
.B \-f
] [
username
]
E 5
E 3
.SH DESCRIPTION
E 9
I 9
.Dd %Q%
.Dt LOGIN 1
.Os BSD 4
.Sh NAME
.Nm login
D 14
.Nd sign on
E 14
I 14
D 15
.Nd log on to a system
E 15
I 15
.Nd log into the computer
E 15
E 14
.Sh SYNOPSIS
.Nm login
D 15
.Op Fl p
D 14
.Op Ar username
E 14
I 14
.Op Ar user
E 14
.Nm login
.Op Fl p
E 15
I 15
.Op Fl fp
E 15
.Op Fl h Ar hostname
D 15
.Op Fl f
E 15
D 14
.Op Ar username
E 14
I 14
.Op Ar user
E 14
.Sh DESCRIPTION
E 9
The
D 9
.I login
E 9
I 9
.Nm login
E 9
D 15
command
D 14
is used when a user initially
D 5
signs on, or it may be used at any time to change
E 5
I 5
signs on.
It may also be used at any time to change
E 5
from one user to another.
D 5
The latter case is the one summarized above and
described here.
See \*(lqHow to Get Started\*(rq for how to dial up initially.
E 5
I 5
This case is the one summarized first above and described here.
D 9
See \*(lqHow to Get Started\*(rq for how to connect initially.
E 9
I 9
See
.Em How to Get Started
for how to connect initially.
E 9
The invocation of
E 14
I 14
logs the given user
.Ar user
onto a
.Tn UNIX
system.
It has three different uses;
logging a user on to a system,
re-logging a user in as another
user (without logging out),
and logging non-human users (programs)
onto other systems.
In the first two instances, the
E 15
I 15
utility logs users (and pseudo-users) into the computer system.
.Pp
If no user is specified, or if a user is specified and authentication
of the user fails,
E 15
E 14
D 9
.I login
E 9
I 9
.Nm login
E 9
D 14
for initial sign-on
is made by a system program or server using the latter form of the command
and is described below.
E 14
I 14
D 15
program protects the user's password
from prying eyes by disabling the
echoing of typed characters from terminals.
E 15
I 15
prompts for a user name.
Authentication of users is done via passwords.
E 15
E 14
E 5
D 9
.PP
E 9
I 9
.Pp
E 9
D 14
If
E 14
I 14
D 15
Options available:
.Bl -tag -width xxxxhostname
E 15
I 15
The options are as follows:
.Bl -tag -width Ds
E 15
.It Fl f
The
.Fl f
D 15
option is used with
a username on the command line, at initial login,
to indicate that proper authentication has already been done
and that no password need be requested.
This option may be used by the superuser
or by the user specified on the command line.
.It Fl h Ar hostname
E 15
I 15
option is used when a user name is specified to indicate that proper
authentication has already been done and that no password need be
requested.
This option may only be used by the super-user or when an already
logged in user is logging in as themselves.
.It Fl h
E 15
The
.Fl h
D 15
option is used by
.Xr telnetd  8
(at initial login)
and other servers to list the host from which
the connection was received.
E 15
I 15
option specifies the host from which the connection was received.
It is used by various daemons such as
.Xr telnetd  8 .
This option may only be used by the super-user.
E 15
.It Fl p
D 15
Causes the remainder of the environment to be preserved,
otherwise any previous environment is discarded.
E 15
I 15
By default,
.Nm login
discards any previous environment.
The
.Fl p
option disables this behavior.
E 15
.El
.Pp
D 15
In the first usage of
E 15
I 15
If the file
.Pa /etc/nologin
exists,
E 15
E 14
D 9
.I login
E 9
I 9
.Nm login
E 9
D 14
is invoked without an argument,
it asks for a user name, and, if
appropriate, a password.
Echoing is turned off (if possible) during the typing of the password,
so it will not appear on the written record of the
session.
E 14
I 14
D 15
it is invoked by the
.Xr getty 8
program which is responsible for initializing communications between
a users terminal and
.Tn UNIX .
.Nm Login
starts up
by prompting for a user name; when it recives a valid user name and password
the user is logged in and may proceed to work on the system.
E 15
I 15
dislays its contents to the user and exits.
This is used by
.Xr shutdown  8
to prevent users from logging in when the system is about to go down.
E 15
E 14
D 9
.PP
E 9
I 9
.Pp
E 9
D 14
After a successful login,
accounting files are updated and
the user is informed of the
D 4
existence of mail,
and
the message of the day is printed,
as is the time he last logged in (unless he has a \*(lq.hushlogin\*(rq
file in his home directory \- this
E 4
I 4
existence of mail.
The message of the day is printed,
as is the time of his last login.
D 9
Both are suppressed if he has a \*(lq.hushlogin\*(rq
E 9
I 9
Both are suppressed if he has a
E 14
I 14
D 15
The second usage of
.Nm login
allows a user to log in as another user
without having logout.
In this case
.Nm login
is invoked from
.Xr sh 1
or
.Xr csh 1
as shown above in the first synopsis.
.Pp
The third usage is by system programs and servers like
.Xr telnetd
and may only be initiated by the super-user.
.Pp
E 15
Immediately after logging a user in,
.Nm login
D 15
writes the date and time the user last logged in,
the message of the day and notifies the user
if he/she has new mail.
E 15
I 15
displays the system copyright notice, the date and time the user last
logged in, the message of the day as well as other information.
E 15
If the file
E 14
.Dq Pa .hushlogin
E 9
D 14
file in his home directory; this
E 4
is mostly used to make life easier for non-human users, such as
E 14
I 14
D 15
exists in the user's home directory,
both the message of the day and mail notification are
suppressed; this
is usually used to simplify the logins for non-human users, such as
E 15
I 15
exists in the user's home directory, all of these messages are suppressed.
This is to simplify logins for non-human users, such as
E 15
E 14
D 4
.IR uucp ).
E 4
I 4
D 9
.IR uucp .
E 4
.PP
.I Login
E 9
I 9
.Xr uucp 1 .
I 14
D 15
.Nm login
E 15
I 15
.Nm Login
E 15
then records an entry in the
.Xr wtmp 5
and
.Xr utmp 5
D 15
files and provides the user
with the command shell found in the user's
.Xr passwd 5
entry.
E 15
I 15
files and executes the user's command interpretor.
E 15
E 14
.Pp
D 14
.Nm Login
E 9
initializes the user and group IDs and the working directory,
then executes a command interpreter (usually
D 4
.IR  sh (1))
E 4
I 4
D 9
.IR  csh (1))
E 9
I 9
.Xr csh  1  )
E 9
E 4
according to specifications found in a password file.
D 4
Argument 0 of the command interpreter is \*(lq\-sh\*(rq, or
more generally the name of the command interpreter with
a leading dash (\*(lq\-\*(rq) prepended.
E 4
I 4
Argument 0 of the command interpreter is
the name of the command interpreter with
D 9
a leading dash (\*(lq\-\*(rq).
E 4
.PP
E 9
I 9
a leading dash
.Sq Fl .
.Pp
E 14
E 9
D 3
Login also initializes the
E 3
I 3
D 15
Login also modifies the
E 3
D 10
environment
D 2
.IR environ (5)
E 2
I 2
D 9
.IR environ (7)
E 9
I 9
.Xr environ  7
E 10
I 10
environment (see
E 15
I 15
Login enters information into the environment (see
E 15
.Xr environ 7 )
E 10
E 9
E 2
D 15
with information specifying home directory, command interpreter, terminal
type (if available) and user name.
E 15
I 15
specifying the user's home directory (HOME), command interpreter (SHELL),
search path (PATH), terminal type (TERM) and user name (both LOGNAME and
USER).
E 15
I 3
D 4
The `-p' argument causes the environment to be preserved from getty.
E 4
I 4
D 9
The `\-p' argument causes the remainder of the environment to be preserved,
E 9
I 9
.Pp
D 14
Options:
.Pp
D 10
.Tw Fl
E 10
I 10
.Tw Ds
E 10
.Tp Fl p
Causes the remainder of the environment to be preserved,
E 9
otherwise any previous environment is discarded.
E 4
E 3
D 9
.PP
D 4
If the file /etc/nologin exists
E 4
I 4
If the file /etc/nologin exists,
E 4
.I login
prints its contents on the user's terminal and exits. This is
used by
.IR shutdown (8)
to stop users logging in when the system is about to go down.
.PP
Login is recognized by
.IR sh (1)
and
.IR csh (1)
and executed directly (without forking).
I 5
.PP
There are several additional options to
.I login
for use at initial login.
With one exception, these options are available only to the superuser.
The
.B \-h
E 9
I 9
.Tp Fl h
E 9
option is used by
D 7
.IR telnetd (8C)
E 7
I 7
D 9
.IR telnetd (8)
E 9
I 9
D 10
.Ar telnetd  8
E 10
I 10
.Xr telnetd  8
E 10
(at initial login)
E 9
E 7
and other servers to list the host from which
the connection was received.
D 9
The
.B \-f
option is used with a username on the command line
E 9
I 9
.Tp Fl f
Used with a username on the command line, at initial login,
E 9
to indicate that proper authentication has already been done
and that no password need be requested.
This option may be used by the superuser
or by the user specified on the command line.
E 5
D 9
.SH FILES
.ta \w'/usr/spool/mail/*\ \ 'u
/etc/utmp	accounting
.br
/usr/adm/wtmp	accounting
.br
/usr/spool/mail/*	mail
.br
/etc/motd	message-of-the-day
.br
/etc/passwd	password file
.br
/etc/nologin	stops logins
.br
\&.hushlogin	makes login quieter
D 3
.br
/etc/securetty	lists ttys that root may log in on
E 3
.SH "SEE ALSO"
D 2
init(8), newgrp(1), getty(8), mail(1), passwd(1), passwd(5), environ(5),
E 2
I 2
D 5
init(8), getty(8), mail(1), passwd(1), passwd(5), environ(7),
E 5
I 5
D 6
init(8), getty(8), mail(1), passwd(1), passwd(5), utmp(5), environ(7),
E 5
E 2
D 4
shutdown(8)
E 4
I 4
shutdown(8), rlogin(1c)
E 6
I 6
mail(1), passwd(1), rlogin(1), getpass(3), passwd(5), utmp(5), environ(7),
init(8), getty(8), shutdown(8),
E 6
E 4
.SH DIAGNOSTICS
\*(lqLogin incorrect,\*(rq
E 9
I 9
.Tp
.Pp
E 14
D 15
If the file
.Pa /etc/nologin
exists,
.Nm login
prints its contents on the user's terminal and exits. This is
used by
.Xr shutdown  8
D 14
to stop users logging in when the system is about to go down.
E 14
I 14
to prevent users from logging in when the system is about to go down.
E 14
.Pp
E 15
D 14
Login is recognized by
.Xr sh  1
E 14
I 14
The standard shells,
.Xr csh 1
E 14
and
D 14
.Xr csh  1
and executed directly (without forking).
E 14
I 14
D 15
.Xr sh 1
notice when login is invoked on a command line and execute
it immediately with out calling
.Xr fork 2 .
E 15
I 15
.Xr sh 1 ,
do not fork before executing the
.Nm login
utility.
E 15
E 14
.Sh FILES
D 14
.Dw /var/log/wtmp
.Di L
.Dp Pa /var/run/utmp
accounting
.Dp Pa /var/log/wtmp
accounting
.Dp Pa /var/mail/*
mail
.Dp Pa /etc/motd
E 14
I 14
D 15
.Bl -tag -width /var/log/wtmp -compact
.It Pa /var/run/utmp
current logins
.It Pa /var/log/wtmp
login account records
.It Pa /var/mail/*
undelivered mail
E 15
I 15
.Bl -tag -width /var/mail/userXXX -compact
E 15
.It Pa /etc/motd
E 14
message-of-the-day
D 14
.Dp Pa /etc/passwd
password file
.Dp Pa /etc/nologin
stops logins
.Dp Pa \&.hushlogin
E 14
I 14
D 15
.It Pa /etc/passwd.*
password files
E 15
.It Pa /etc/nologin
disallows logins
I 15
.It Pa /var/run/utmp
current logins
I 17
.It Pa /var/log/lastlog
last login account records
E 17
.It Pa /var/log/wtmp
login account records
.It Pa /var/mail/user
system mailboxes
E 15
.It Pa \&.hushlogin
E 14
makes login quieter
D 14
.Dp
E 14
I 14
.El
E 14
.Sh SEE ALSO
D 15
.Xr mail 1 ,
E 15
I 15
.Xr chpass 1 ,
E 15
.Xr passwd 1 ,
.Xr rlogin 1 ,
.Xr getpass 3 ,
D 15
.Xr passwd 5 ,
E 15
.Xr utmp 5 ,
.Xr environ 7 ,
D 15
.Xr init 8 ,
.Xr getty 8 ,
.Xr shutdown 8 ,
E 15
.Sh HISTORY
I 14
A
E 14
.Nm login
D 14
appeared in Version 6 AT&T Unix.
E 14
I 14
appeared in
.At v6 .
E 14
D 15
.Sh DIAGNOSTICS
D 14
.Dw Fl
.Di L
.Dp Li Login incorrect
E 9
if the name or the password is bad.
D 9
.br
\*(lqNo Shell\*(rq, \*(lqcannot open password file\*(rq,
\*(lqno directory\*(rq:
E 9
I 9
.Dp Li No Shell
.Dp Li cannot open password file
.Dp Li no directory
E 9
consult a programming counselor.
I 9
.Dp
E 14
I 14
Self explanatory.
E 15
E 14
E 9
I 2
D 8
.SH BUGS
An undocumented option,
.B \-r
is used by the remote login server,
D 6
.IR rlogind (8C)
E 6
I 6
.IR rlogind (8)
E 6
to force
.I login
to enter into an initial connection protocol.
E 8
I 4
D 5
.B \-h is used by
.IR telnetd (8C)
and other servers to list the host from which
the connection was received.
E 5
E 4
E 2
E 1
