libexec/fingerd/SCCS/s.fingerd.8
h62958
s 00002/00002/00111
d D 8.1 93/06/04 18:47:53 bostic 6 5
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00031/00001/00082
d D 6.5 92/07/12 22:58:25 tef 5 4
c document -s, -l and -p options
e
s 00065/00034/00018
d D 6.4 91/03/16 17:05:14 cael 4 3
c macro and text revision (-mdoc version 3)
e
s 00002/00012/00050
d D 6.3 90/06/24 21:19:05 trent 3 2
c new copyright & new pathnames (fingerd)
e
s 00015/00004/00047
d D 6.2 88/09/19 21:15:47 bostic 2 1
c Berkeley copyright
e
s 00051/00000/00000
d D 6.1 86/05/23 13:00:14 mckusick 1 0
c manual page first distributed with 4.3BSD
e
u
U
t
T
I 1
D 2
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 2
I 2
D 4
.\" Copyright (c) 1980 The Regents of the University of California.
E 4
I 4
D 6
.\" Copyright (c) 1980, 1991 The Regents of the University of California.
E 4
.\" All rights reserved.
E 6
I 6
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 6
E 2
.\"
I 2
D 3
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 3
I 3
.\" %sccs.include.redist.man%
E 3
.\"
E 2
D 4
.\"	%W% (Berkeley) %G%
E 4
I 4
.\"     %W% (Berkeley) %G%
E 4
.\"
D 2
.TH FINGERD 8C "%Q%"
E 2
I 2
D 4
.TH FINGERD 8 "%Q%"
E 2
.UC 6
.SH NAME
fingerd \- remote user information server
.SH SYNOPSIS
D 3
.B /etc/fingerd
E 3
I 3
.B fingerd
E 3
.SH DESCRIPTION
.I Fingerd
is a simple protocol based on RFC742 that provides an interface to the
E 4
I 4
.Dd %Q%
.Dt FINGERD 8
.Os BSD 4.3
.Sh NAME
.Nm fingerd
.Nd remote user information server
.Sh SYNOPSIS
.Nm fingerd
I 5
.Op Fl s
.Op Fl l
.Op Fl p Ar filename
E 5
.Sh DESCRIPTION
.Nm Fingerd
is a simple protocol based on
D 5
.%T RFC742
E 5
I 5
.%T RFC1196
E 5
that provides an interface to the
E 4
Name and Finger programs at several network sites.
The program is supposed to return a friendly,
human-oriented status report on either the system at the moment
or a particular person in depth.
There is no required format and the
D 4
protocol consists mostly of specifying a single ``command line''.
.PP
.I Fingerd
listens for TCP requests at port 79.
E 4
I 4
protocol consists mostly of specifying a single
.Dq command line .
.Pp
.Nm Fingerd
listens for
.Tn TCP
requests at port 79.
E 4
Once connected it reads a single command line
D 4
terminated by a <CRLF> which is passed to
.IR finger (1).
.I Fingerd
E 4
I 4
terminated by a
.Aq Tn CRLF
which is passed to
.Xr finger 1 .
.Nm Fingerd
E 4
closes its connections as soon as the output is finished.
D 4
.PP
If the line is null (i.e. just a <CRLF> is sent) then 
.I finger
returns a ``default'' report that lists all people logged into
E 4
I 4
.Pp
If the line is null (i.e. just a
.Aq Tn CRLF
is sent) then 
.Xr finger
returns a
.Dq default
report that lists all people logged into
E 4
the system at that moment.
D 4
.PP
If a user name is specified (e.g. eric<CRLF>) then the
E 4
I 4
.Pp
If a user name is specified (e.g.
.Pf eric Aq Tn CRLF )
then the
E 4
response lists more extended information for only that particular user,
whether logged in or not.
D 4
Allowable ``names'' in the command line include both ``login names''
and ``user names''.
E 4
I 4
Allowable
.Dq names
in the command line include both
.Dq login names
and
.Dq user names .
E 4
If a name is ambiguous, all possible derivations are returned.
I 5
.Pp
The following options may be passed to
.Nm fingerd
as server program arguments in
.Pa /etc/inetd.conf :
.Bl -tag -width Ds
.It Fl s
Enable secure mode.
Queries without a user name are rejected and
forwarding of queries to other remote hosts is denied.
.It Fl l
Enable logging.
The name of the host originating the query is reported via
.Xr syslog 3
at LOG_NOTICE priority.
.It Fl p
Use an alternate program as the local information provider.
The default local program
executed by
.Nm fingerd
is 
.Xr finger 1 .
By specifying a customized local server,
this option allows a system manager
to have more control over what information is
provided to remote sites.
.El
E 5
D 4
.SH SEE ALSO
finger(1)
.SH BUGS
Connecting directly to the server from a TIP
or an equally narrow-minded TELNET-protocol user program can result
E 4
I 4
.Sh SEE ALSO
.Xr finger 1
.Sh BUGS
Connecting directly to the server from a
.Tn TIP
or an equally narrow-minded
.Tn TELNET Ns \-protocol
user program can result
E 4
in meaningless attempts at option negotiation being sent to the
server, which will foul up the command line interpretation.
D 4
.I Fingerd
should be taught to filter out IAC's and perhaps even respond
negatively (IAC WON'T) to all option commands received.
E 4
I 4
.Nm Fingerd
should be taught to filter out
.Tn IAC Ns \'s
and perhaps even respond
negatively
.Pq Tn IAC WON'T
to all option commands received.
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.3 .
E 4
E 1
