usr.sbin/lpr/lpc/SCCS/s.lpc.8
h60175
s 00001/00001/00148
d D 8.5 95/04/28 13:36:50 tef 10 9
c Members of group "operator" can execute privildged commands.
e
s 00001/00000/00148
d D 8.4 94/06/01 20:41:18 ah 9 8
c page breaks for 4.4BSD manuals
e
s 00002/00002/00146
d D 8.3 94/04/19 08:31:02 bostic 8 7
c spell
e
s 00003/00003/00145
d D 8.2 93/12/11 23:44:40 mckusick 7 6
c copyediting for Usenix manuals
e
s 00002/00002/00146
d D 8.1 93/06/06 14:00:02 bostic 6 5
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00096/00092/00052
d D 6.4 91/03/16 18:12:41 cael 5 4
c macro and text revision (-mdoc version 3)
e
s 00004/00014/00140
d D 6.3 90/06/24 22:21:54 trent 4 3
c new copyright & pathname (/var/spool and lpc)
e
s 00014/00003/00140
d D 6.2 88/09/29 09:32:18 bostic 3 2
c add Berkeley copyright notice
e
s 00027/00009/00116
d D 6.1 85/04/27 15:32:22 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00125/00000/00000
d D 5.1 85/04/27 15:32:00 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
D 3
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 3
I 3
D 5
.\" Copyright (c) 1983 The Regents of the University of California.
E 5
I 5
D 6
.\" Copyright (c) 1983, 1991 The Regents of the University of California.
E 5
.\" All rights reserved.
E 6
I 6
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 6
.\"
D 4
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 4
I 4
.\" %sccs.include.redist.man%
E 4
E 3
.\"
D 5
.\"	%W% (Berkeley) %G%
E 5
I 5
.\"     %W% (Berkeley) %G%
E 5
.\"
D 2
.TH LPC 8 "4 July 1983"
E 2
I 2
D 5
.TH LPC 8 "%Q%"
E 2
.UC 5
.ad
.SH NAME
lpc \- line printer control program
.SH SYNOPSIS
D 4
.B /etc/lpc
E 4
I 4
.B lpc
E 4
[ command [ argument ... ] ]
.SH DESCRIPTION
.I Lpc
E 5
I 5
.Dd %Q%
.Dt LPC 8
.Os BSD 4.2
.Sh NAME
.Nm lpc
.Nd line printer control program
.Sh SYNOPSIS
.Nm lpc
.Oo
.Ar command
.Op Ar argument ...
.Oc
.Sh DESCRIPTION
.Nm Lpc
E 5
is used by the system administrator to control the
operation of the line printer system.  
D 5
For each line printer configured in /etc/printcap,
.I lpc
E 5
I 5
For each line printer configured in
.Pa /etc/printcap ,
.Nm lpc
E 5
may be used to:
D 5
.IP \(bu
E 5
I 5
.Bl -bullet -offset indent
.It
E 5
disable or enable a printer,
D 5
.IP \(bu
E 5
I 5
.It
E 5
disable or enable a printer's spooling queue,
D 5
.IP \(bu
E 5
I 5
.It
E 5
rearrange the order of jobs in a spooling queue,
D 5
.IP \(bu
E 5
I 5
.It
E 5
find the status of printers, and their associated
D 7
spooling queues and printer dameons.
E 7
I 7
spooling queues and printer daemons.
E 7
D 5
.PP
E 5
I 5
.El
.Pp
E 5
Without any arguments,
D 5
.I lpc
E 5
I 5
.Nm lpc
E 5
will prompt for commands from the standard input.
If arguments are supplied,
D 5
.IR lpc
E 5
I 5
.Nm lpc
E 5
interprets the first argument as a command and the remaining
arguments as parameters to the command.  The standard input
may be redirected causing
D 5
.I lpc
E 5
I 5
.Nm lpc
E 5
to read commands from file.
D 8
Commands may be abreviated;
E 8
I 8
Commands may be abbreviated;
E 8
the following is the list of recognized commands.
D 5
.TP
? [ command ... ]
.TP
help [ command ... ]
.br
E 5
I 5
.Pp
.Bl -tag -width Ds -compact
.It Ic \&? No [ command ... ]
.It Ic help No [ command ... ]
E 5
Print a short description of each command specified in the argument list,
D 7
or, if no arguments are given, a list of the recognized commands.
E 7
I 7
or, if no argument is given, a list of the recognized commands.
E 7
D 5
.TP
abort { all | printer ... }
.br
E 5
I 5
.Pp
.It Ic abort  No {\ all\ |\ printer\ }
E 5
Terminate an active spooling daemon on the local host immediately and
then disable printing (preventing new daemons from being started by
D 5
.IR lpr )
E 5
I 5
.Xr lpr )
E 5
for the specified printers.
D 5
.TP
clean { all | printer ... }
.br
E 5
I 5
.Pp
.It Ic clean  No {\ all\ |\ printer\ }
E 5
D 2
Remove all files beginning with ``cf'', ``tf'', or ``df''
E 2
I 2
Remove any temporary files, data files, and control files that cannot
be printed (i.e., do not form a complete printer job)
E 2
from the specified printer queue(s) on the local machine.
D 5
.TP
I 2
disable { all | printer ... }
.br
E 5
I 5
.Pp
.It Ic disable  No {\ all\ |\ printer\ }
E 5
Turn the specified printer queues off.  This prevents new
printer jobs from being entered into the queue by
D 5
.IR lpr .
.TP
down { all | printer } message ...
.br
E 5
I 5
.Xr lpr .
.Pp
.It Ic down No {\ all\ |\ printer\ } message ...
E 5
Turn the specified printer queue off, disable printing and put
D 5
.I message
E 5
I 5
.Em message
E 5
in the printer status file. The message doesn't need to be quoted, the
remaining arguments are treated like
D 5
.IR echo (1).
E 5
I 5
.Xr echo 1 .
E 5
This is normally used to take a printer down and let others know why
D 5
(lpq will indicate the printer is down and print the status message).
.TP
E 2
enable { all | printer ... }
.br
E 5
I 5
.Xr lpq 1
will indicate the printer is down and print the status message).
.Pp
.It Ic enable  No {\ all\ |\ printer\ }
E 5
Enable spooling on the local queue for the listed printers. 
This will allow
D 5
.I lpr
E 5
I 5
.Xr lpr 1
E 5
to put new jobs in the spool queue.
D 5
.TP
exit
.TP
quit
.br
E 5
I 5
.Pp
.It Ic exit
.It Ic quit
E 5
Exit from lpc.
I 9
.ne 1i
E 9
D 5
.TP
D 2
disable { all | printer ... }
.br
Turn the specified printer queues off.  This prevents new
printer jobs from being entered into the queue by
.IR lpr .
.TP
E 2
restart { all | printer ... }
.br
E 5
I 5
.Pp
.It Ic restart  No {\ all\ |\ printer\ }
E 5
Attempt to start a new printer daemon. 
This is useful when some abnormal condition causes the daemon to
D 7
die unexpectedly leaving jobs in the queue.
E 7
I 7
die unexpectedly, leaving jobs in the queue.
E 7
D 5
.I Lpq
E 5
I 5
.Xr Lpq
E 5
will report that there is no daemon present when this condition occurs. 
I 2
If the user is the super-user,
try to abort the current daemon first (i.e., kill and restart a stuck daemon).
E 2
D 5
.TP
start { all | printer ... }
.br
E 5
I 5
.Pp
.It Ic start  No {\ all\ |\ printer\ }
E 5
Enable printing and start a spooling daemon for the listed printers.
D 5
.TP
D 2
status [ all ] [ printer ... ]
E 2
I 2
status { all | printer ... }
E 5
I 5
.Pp
.It Ic status  No {\ all\ |\ printer\ }
E 5
E 2
Display the status of daemons and queues on the local machine.
D 5
.TP
stop { all | printer ... }
.br
E 5
I 5
.Pp
.It Ic stop  No {\ all\ |\ printer\ }
E 5
Stop a spooling daemon after the current job completes and disable
printing.
D 5
.TP
topq printer [ jobnum ... ] [ user ... ]
.br
E 5
I 5
.Pp
.It Ic topq No printer\ [\ jobnum\ ...\ ]\ [\ user\ ...\ ]
E 5
Place the jobs in the order listed at the top of the printer queue.
I 2
D 5
.TP
up { all | printer ... }
.br
E 5
I 5
.Pp
.It Ic up  No {\ all\ |\ printer\ }
E 5
Enable everything and start a new printer daemon. Undoes the effects of
D 5
.IR down .
E 2
.SH FILES
.nf
.ta \w'/etc/printcap           'u
/etc/printcap	printer description file
D 4
/usr/spool/*	spool directories
/usr/spool/*/lock	lock file for queue control
E 4
I 4
/var/spool/*	spool directories
/var/spool/*/lock	lock file for queue control
E 4
.fi
.SH "SEE ALSO"
lpd(8),
lpr(1),
lpq(1),
lprm(1),
printcap(5)
.SH DIAGNOSTICS
.nf
.ta \w'?Ambiguous command      'u
?Ambiguous command	abreviation matches more than one command
?Invalid command	no match was found
?Privileged command	command can be executed by root only
.fi
E 5
I 5
.Ic down .
.Sh FILES
.Bl -tag -width /var/spool/*/lockx -compact
.It Pa /etc/printcap
printer description file
.It Pa /var/spool/*
spool directories
.It Pa /var/spool/*/lock
lock file for queue control
.El
.Sh SEE ALSO
.Xr lpd 8 ,
.Xr lpr 1 ,
.Xr lpq 1 ,
.Xr lprm 1 ,
.Xr printcap 5
.Sh DIAGNOSTICS
.Bl -tag -width Ds
.It Sy "?Ambiguous command"
D 8
abreviation matches more than one command
E 8
I 8
abbreviation matches more than one command
E 8
.It Sy "?Invalid command"
no match was found
.It Sy "?Privileged command"
D 10
command can be executed by root only
E 10
I 10
you must be a member of group "operator" or root to execute this command
E 10
.El
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.2 .
E 5
E 1
