usr.sbin/kgmon/SCCS/s.kgmon.8
h07597
s 00002/00002/00094
d D 8.1 93/06/06 13:57:41 bostic 7 6
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00010/00007/00086
d D 6.5 91/06/06 10:19:25 bostic 6 5
c add -M, -N for consistency with other stat programs
e
s 00058/00051/00035
d D 6.4 91/03/16 18:12:32 cael 5 4
c macro and text revision (-mdoc version 3)
e
s 00002/00012/00084
d D 6.3 90/06/24 22:20:26 trent 4 3
c new copyright & pathname (kgmon)
e
s 00014/00003/00082
d D 6.2 88/11/12 10:53:40 bostic 3 2
c written by Kirk McKusick; add Berkeley copyright notice
e
s 00001/00001/00084
d D 6.1 85/04/27 15:31:18 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00085/00000/00000
d D 5.1 85/04/27 15:30:56 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
D 3
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 3
I 3
D 5
.\" Copyright (c) 1983 The Regents of the University of California.
E 5
I 5
D 7
.\" Copyright (c) 1983, 1991 The Regents of the University of California.
E 5
.\" All rights reserved.
E 7
I 7
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 7
.\"
D 4
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 4
I 4
.\" %sccs.include.redist.man%
E 4
E 3
.\"
D 5
.\"	%W% (Berkeley) %G%
E 5
I 5
.\"     %W% (Berkeley) %G%
E 5
.\"
D 2
.TH KGMON 8 "18 July 1983"
E 2
I 2
D 5
.TH KGMON 8 "%Q%"
E 2
.UC 5
.SH NAME
kgmon \- generate a dump of the operating system's profile buffers
.SH SYNOPSIS
D 4
.B /etc/kgmon
E 4
I 4
.B kgmon
E 4
[
.B \-b
] [
.B \-h
] [
.B \-r
] [
.B \-p
] [ system ] [ memory ]
.SH DESCRIPTION
.I Kgmon
E 5
I 5
.Dd %Q%
.Dt KGMON 8
.Os BSD 4.2
.Sh NAME
.Nm kgmon
.Nd generate a dump of the operating system's profile buffers
.Sh SYNOPSIS
.Nm kgmon
D 6
.Op Fl b
.Op Fl h
.Op Fl r
.Op Fl p
.Op Ar system
.Op Ar memory
E 6
I 6
.Op Fl bhpr
.Op Fl M core
.Op Fl N system
E 6
.Sh DESCRIPTION
.Nm Kgmon
E 5
is a tool used when profiling the operating system.
When no arguments are supplied,
D 5
.I kgmon 
E 5
I 5
.Nm kgmon
E 5
indicates the state of operating system profiling as running,
off, or not configured.
(see
D 5
.IR config (8))
E 5
I 5
.Xr config 8 )
E 5
If the
D 5
.B \-p
E 5
I 5
.Fl p
E 5
flag is specified,
D 5
.I kgmon
E 5
I 5
.Nm kgmon
E 5
extracts profile data from the operating system and produces a
D 5
.I gmon.out
E 5
I 5
.Pa gmon.out
E 5
file suitable for later analysis by
D 5
.IR gprof (1).
.PP
E 5
I 5
.Xr gprof 1 .
.Pp
E 5
D 6
The following options may be specified:
E 6
I 6
The options are as follows:
E 6
D 5
.TP
.B \-b
E 5
I 5
.Bl -tag -width Ds
.It Fl b
E 5
Resume the collection of profile data.
D 5
.TP
.B \-h
E 5
I 5
.It Fl h
E 5
Stop the collection of profile data.
D 5
.TP
.B \-p
E 5
I 5
.It Fl p
E 5
Dump the contents of the profile buffers into a
D 5
.I gmon.out
E 5
I 5
.Pa gmon.out
E 5
file.
D 5
.TP
.B \-r
E 5
I 5
.It Fl r
E 5
Reset all the profile buffers. 
If the
D 5
.B \-p
E 5
I 5
.Fl p
E 5
flag is also specified, the
D 5
.I gmon.out
E 5
I 5
.Pa gmon.out
E 5
file is generated before the buffers are reset.
I 6
.It Fl M
Extract values associated with the name list from the specified core
instead of the default ``/dev/kmem''.
.It Fl N
Extract the name list from the specified system instead of the
default ``/vmunix''.
E 6
D 5
.PP
E 5
I 5
.El
.Pp
E 5
If neither 
D 5
.B \-b
E 5
I 5
.Fl b
E 5
nor
D 5
.B \-h
E 5
I 5
.Fl h
E 5
is specified, the state of profiling collection remains unchanged.
For example, if the
D 5
.B \-p
E 5
I 5
.Fl p
E 5
flag is specified and profile data is being collected,
profiling will be momentarily suspended,
the operating system profile buffers will be dumped,
and profiling will be immediately resumed.
D 5
.SH FILES
/vmunix \- the default system
.br
/dev/kmem \- the default memory
.SH "SEE ALSO"
gprof(1),
config(8)
.SH DIAGNOSTICS
Users with only read permission on /dev/kmem cannot change the state
E 5
I 5
.Sh FILES
.Bl -tag -width /dev/kmemx -compact
.It Pa /vmunix
the default system
.It Pa /dev/kmem
the default memory
.El
.Sh SEE ALSO
.Xr gprof 1 ,
.Xr config 8
.Sh DIAGNOSTICS
Users with only read permission on
.Pa /dev/kmem
cannot change the state
E 5
of profiling collection. 
They can get a 
D 5
.I gmon.out
E 5
I 5
.Pa gmon.out
E 5
file with the warning that the data may be
inconsistent if profiling is in progress.
I 5
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.2 .
E 5
E 1
