usr.bin/at/atrm/SCCS/s.atrm.1
h50159
s 00002/00002/00069
d D 8.1 93/06/06 14:21:41 bostic 6 5
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00018/00018/00053
d D 6.5 91/03/14 01:39:01 cael 5 4
c updated to -mdoc version 3
e
s 00008/00004/00063
d D 6.4 90/07/24 22:41:16 cael 4 3
c .Xr botch fix
e
s 00059/00040/00008
d D 6.3 90/06/11 05:53:09 cael 3 2
c converted man page
e
s 00001/00001/00047
d D 6.2 86/05/10 19:52:25 mckusick 2 1
c syntax
e
s 00048/00000/00000
d D 6.1 85/04/29 21:49:13 mckusick 1 0
c manual page first distributed with 4.3BSD
e
u
U
t
T
I 1
D 3
.\" Copyright (c) 1985 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 3
I 3
D 6
.\" Copyright (c) 1985, 1990 The Regents of the University of California.
.\" All rights reserved.
E 6
I 6
.\" Copyright (c) 1985, 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 6
E 3
.\"
I 5
.\"     @(#)atrm.1	6.4 (Berkeley) 7/24/90
E 5
D 3
.\"	%W% (Berkeley) %G%
E 3
I 3
.\" %sccs.include.redist.man%
E 3
.\"
D 3
.TH ATRM 1 "%Q%"
.UC 6
.SH NAME
D 2
atrm - remove jobs spooled by at
E 2
I 2
atrm \- remove jobs spooled by at
E 2
.SH SYNOPSIS
.B atrm
[ -f ] [ -i ] [-] [[ job #] [ name ]... ]
.SH DESCRIPTION
.I Atrm 
E 3
I 3
.\"     %W% (Berkeley) %G%
.\"
.Dd %Q%
.Dt ATRM 1
.Os BSD 4.3
.Sh NAME
.Nm atrm
D 4
.Nd remove jobs spooled by at
E 4
I 4
.Nd remove jobs spooled by
.Xr at 1
E 4
.Sh SYNOPSIS
.Nm atrm
.Op Fl f
.Op Fl i
.Op Fl
D 5
.Cx [
.Op Ar job #
.Op Ar name
.Cx ...
.Cx ]
.Cx
E 5
I 5
.Oo Op Ar job #
.Op Ar name ... Oc
E 5
.Sh DESCRIPTION
.Nm Atrm
E 3
removes jobs that were created with the
D 3
.IR at (1)
E 3
I 3
.Xr at 1
E 3
command.
D 3
With the
.B \-
flag, all jobs belonging to the person invoking
.I atrm
are removed.
If a job number(s) is specified, 
.I atrm
attempts to remove only that job number(s).
.PP
If the 
.B \-f 
flag is used, all information regarding the 
E 3
I 3
.Pp
I 4
Options available are:
D 5
.Pp
E 4
.Tp Fl f
E 5
I 5
.Bl -tag -width Ds
.It Fl f
E 5
all information regarding the
E 3
removal of the specified jobs is suppressed.
D 3
If the
.B \-i
flag is used, 
.I atrm
E 3
I 3
D 5
.Tp Fl i
E 5
I 5
.It Fl i
E 5
.Nm atrm
E 3
D 5
asks if a job should be removed; a response of 'y' causes the job to be removed.
D 3
.PP
If a user(s) name is specified, all 
E 3
I 3
.Tp Fl
E 5
I 5
asks if a job should be removed; a response of
.Ql y
causes the job to be removed.
.It Fl
E 5
all jobs belonging to the person invoking
.Nm atrm
are removed.
D 5
.Tp
E 5
I 5
.El
E 5
.Pp
If a
.Ar job
number(s) is specified,
.Nm atrm
attempts to remove only that
.Ar job
number(s).
.Pp
If a user(s) name is specified, all
E 3
jobs belonging to that user(s) are removed.
D 3
This form of invoking 
.I atrm
E 3
I 3
This form of invoking
.Nm atrm
E 3
is useful only to the super-user.
D 3
.SH FILES
/usr/spool/at		spool area
.SH "SEE ALSO"
at(1),
atq(1),
cron(8)
E 3
I 3
.Sh FILES
D 4
.Tw /usr/spool/at
.Tp /usr/spool/at
E 4
I 4
D 5
.Dw /usr/spool/at
.Di L
.Dp Pa /usr/spool/at
E 5
I 5
.Bl -tag -width /usr/spool/at -compact
.It Pa /usr/spool/at
E 5
E 4
spool area
D 4
.Tp
E 4
I 4
D 5
.Dp
E 5
I 5
.El
E 5
E 4
.Sh SEE ALSO
.Xr at 1 ,
.Xr atq 1 ,
.Xr cron 8
.Sh HISTORY
D 5
.Nm Atrm
appeared in the 4.3 BSD release.
E 5
I 5
The
.Nm
command appeared in 
.Bx 4.3 .
E 5
E 3
E 1
