sbin/badsect/SCCS/s.badsect.8
h52005
s 00002/00002/00104
d D 8.1 93/06/05 10:48:58 bostic 7 6
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00059/00041/00047
d D 6.4 91/03/16 17:05:49 cael 6 5
c macro and text revision (-mdoc version 3)
e
s 00001/00011/00087
d D 6.3 90/06/24 21:27:09 trent 5 4
c new copyright notice
e
s 00014/00003/00084
d D 6.2 88/11/01 18:16:04 bostic 4 3
c add Berkeley specific copyright
e
s 00001/00001/00086
d D 6.1 85/04/27 12:59:08 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00033/00024/00054
d D 5.1 85/04/27 12:58:40 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00078/00000/00000
d D 4.1 85/04/27 12:58:17 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
D 4
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 4
I 4
D 6
.\" Copyright (c) 1985 The Regents of the University of California.
E 6
I 6
D 7
.\" Copyright (c) 1985, 1991 The Regents of the University of California.
E 6
.\" All rights reserved.
E 7
I 7
.\" Copyright (c) 1985, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 7
.\"
D 5
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 5
I 5
.\" %sccs.include.redist.man%
E 5
E 4
.\"
D 6
.\"	%W% (Berkeley) %G%
E 6
I 6
.\"     %W% (Berkeley) %G%
E 6
.\"
D 2
.TH BADSECT 8 4/10/81
E 2
I 2
D 3
.TH BADSECT 8 "25 February 1983"
E 3
I 3
D 6
.TH BADSECT 8 "%Q%"
E 3
E 2
.UC 4
.SH NAME
badsect \- create files to contain bad sectors
.SH SYNOPSIS
.B /etc/badsect
D 2
sector ...
E 2
I 2
bbdir sector ...
E 2
.SH DESCRIPTION
.I Badsect
E 6
I 6
.Dd %Q%
.Dt BADSECT 8
.Os BSD 4
.Sh NAME
.Nm badsect
.Nd create files to contain bad sectors
.Sh SYNOPSIS
.Nm /etc/badsect
.Ar bbdir sector ...
.Sh DESCRIPTION
.Nm Badsect
E 6
makes a file to contain a bad sector.  Normally, bad sectors
are made inaccessible by the standard formatter, which provides
a forwarding table for bad sectors to the driver; see
D 6
.IR bad144 (8)
E 6
I 6
.Xr bad144 8
E 6
for details.
If a driver supports the bad blocking standard it is much preferable to
use that method to isolate bad blocks, since the bad block forwarding
makes the pack appear perfect, and such packs can then be copied with
D 2
.IR dd (8).
E 2
I 2
D 6
.IR dd (1).
E 6
I 6
.Xr dd 1 .
E 6
E 2
The technique used by this program is also less general than
bad block forwarding, as
D 6
.I badsect
E 6
I 6
.Nm badsect
E 6
can't make amends for
bad blocks in the i-list of file systems or in swap areas.
D 6
.PP
E 6
I 6
.Pp
E 6
D 2
Adding a sector which is suddenly bad to the bad sector table
currently requires the running of the standard DEC formatter, as
UNIX does not supply formatters.  Thus to deal with a newly bad block
E 2
I 2
On some disks,
adding a sector which is suddenly bad to the bad sector table
D 6
currently requires the running of the standard DEC formatter.
E 6
I 6
currently requires the running of the standard
.Tn DEC
formatter.
E 6
Thus to deal with a newly bad block
E 2
or on disks where the drivers
do not support the bad-blocking standard 
D 6
.I badsect
E 6
I 6
.Nm badsect
E 6
D 2
may be used to good
effect.
E 2
I 2
may be used to good effect.
E 2
D 6
.PP
.I Badsect
E 6
I 6
.Pp
.Nm Badsect
E 6
is used on a quiet file system in the following way:
First mount the file system, and change to its root directory.
D 2
Make a directory BAD there and change into it.  Run badsect
giving as argument all the bad sectors you wish to add.
(The sector numbers should be relative to the beginning of
the file system, but this is not hard to do as
the system reports relative sector numbers in its console error messages.)
E 2
I 2
D 6
Make a directory BAD there.  Run
.I badsect
giving as argument the BAD directory followed by
E 6
I 6
Make a directory
.Li BAD
there.  Run
.Nm badsect
giving as argument the
.Ar BAD
directory followed by
E 6
all the bad sectors you wish to add.
(The sector numbers must be relative to the beginning of
the file system, but this is not hard as the system reports
relative sector numbers in its console error messages.)
E 2
Then change back to the root directory, unmount the file system
and run
D 6
.IR fsck (8)
E 6
I 6
.Xr fsck 8
E 6
on the file system.  The bad sectors should show up in two files
or in the bad sector files and the free list.  Have
D 6
.I fsck
E 6
I 6
.Xr fsck
E 6
remove files containing the offending bad sectors, but 
D 6
.B "do not"
have it remove the BAD/\fInnnnn\fR files.
This will leave the bad sectors in only the BAD files.
.PP
.I Badsect
E 6
I 6
.Em do not
have it remove the
.Pa BAD/ Ns Em nnnnn
files.
This will leave the bad sectors in only the
.Li BAD
files.
.Pp
.Nm Badsect
E 6
works by giving the specified sector numbers in a
D 6
.IR mknod (2)
E 6
I 6
.Xr mknod 2
E 6
system call,
D 2
creating a regular file whose first block address is the block containing
E 2
I 2
creating an illegal file whose first block address is the block containing
E 2
bad sector and whose name is the bad sector number.
D 2
The file has 0 length, but the check programs
will still consider it to contain the block containing the sector.
This has the pleasant effect that the sector is completely inaccessible
to the containing file system
since it is not available by accessing the file.
.PP
E 2
I 2
When it is discovered by 
D 6
.I fsck
it will ask ``HOLD BAD BLOCK''?
E 6
I 6
.Xr fsck
it will ask
.Dq Li "HOLD BAD BLOCK ?"
E 6
A positive response will cause 
D 6
.I fsck
E 6
I 6
.Xr fsck
E 6
to convert the inode to a regular file containing the bad block.
E 2
D 6
.SH SEE ALSO
D 2
bad144(8), fsck (8)
E 2
I 2
bad144(8),
fsck(8),
format(8V)
.SH DIAGNOSTICS
.I Badsect
E 6
I 6
.Sh SEE ALSO
.Xr bad144 8 ,
.Xr fsck 8 ,
.Xr format 8
.Sh DIAGNOSTICS
.Nm Badsect
E 6
refuses to attach a block that
resides in a critical area or is out of range of the file system.
A warning is issued if the block is already in use.
E 2
D 6
.SH BUGS
E 6
I 6
.Sh BUGS
E 6
D 2
If both sectors which comprise a (1024 byte) disk block are bad,
E 2
I 2
If more than one sector which comprise a file system fragment are bad,
E 2
you should specify only one of them to
D 6
.I badsect,
E 6
I 6
.Nm badsect ,
E 6
D 2
as the blocks in the bad sector files actually cover both (bad)
disk sectors.
E 2
I 2
as the blocks in the bad sector files actually cover all the sectors in a
file system fragment.
I 6
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.1 .
E 6
E 2
E 1
