libexec/telnetd/SCCS/s.telnetd.8
h07718
s 00002/00000/00579
d D 8.4 94/06/01 20:47:18 ah 14 13
c page breaks for 4.4BSD manuals
e
s 00005/00011/00574
d D 8.3 94/03/01 09:14:22 dab 13 12
c Change the synopsis so that all the single letter
c options without arguments are clumped together rather than
c being listed one by one.
e
s 00549/00118/00036
d D 8.2 94/02/03 09:03:18 dab 12 11
c Update the man page to reflect reality
e
s 00002/00002/00152
d D 8.1 93/06/04 19:07:18 bostic 11 10
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00000/00000/00154
d D 6.9 92/12/18 14:05:48 dab 10 9
c Change ENCRYPT to ENCRYPTION
c Change AUTHENTICATE to AUTHENTICATION
c Add Sun/SVR4 Streams support
c Allow for more ptys
c Environ suboption USERVAR support
c New Telnet Flowcontrol suboption support
c Server -k option to default to no kludge linemode
c Server -U option, allow only registered hosts to connect
e
s 00001/00011/00153
d D 6.8 91/04/20 10:50:01 cael 9 8
c added redist.man
e
s 00041/00002/00123
d D 6.7 90/06/28 13:05:53 borman 8 7
c Lots of bugfixes, add the ENVIRON and X-DISPLAY-LOC
c options, "-l user" to the command line, diagnostic flags.
e
s 00002/00012/00123
d D 6.6 90/06/24 21:24:23 trent 7 6
c new copyright & pathnames (telnetd)
e
s 00015/00017/00120
d D 6.5 89/03/18 17:49:01 minshall 6 5
c Update to telnetd with the CMU mods for window size, etc., installed.
e
s 00018/00007/00119
d D 6.4 89/02/15 13:57:57 bostic 5 4
c add Berkeley specific copyright notice
e
s 00001/00003/00125
d D 6.3 86/05/28 16:25:07 mckusick 4 3
c cannot change the synopsis line
e
s 00095/00035/00033
d D 6.2 86/05/13 11:42:51 minshall 3 2
c This is the 4.3 version.
e
s 00001/00001/00067
d D 6.1 85/04/27 15:59:52 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00068/00000/00000
d D 5.1 85/04/27 15:59:45 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
D 5
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 5
I 5
D 11
.\" Copyright (c) 1983 The Regents of the University of California.
.\" All rights reserved.
E 11
I 11
.\" Copyright (c) 1983, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 11
E 5
.\"
I 5
D 7
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 7
I 7
D 8
.\" %sccs.include.redist.man%
E 8
I 8
D 9
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 9
I 9
.\" %sccs.include.redist.man%
E 9
E 8
E 7
.\"
E 5
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH TELNETD 8C "4 March 1983"
E 2
I 2
D 5
.TH TELNETD 8C "%Q%"
E 5
I 5
D 12
.TH TELNETD 8 "%Q%"
E 5
E 2
.UC 5
.SH NAME
D 3
telnetd \- DARPA TELNET protocol server
E 3
I 3
D 4
telnetd \- DARPA
.B TELNET
protocol server
E 4
I 4
telnetd \- DARPA TELNET protocol server
E 4
E 3
.SH SYNOPSIS
D 7
.B /etc/telnetd
E 7
I 7
D 8
.B telnetd
E 8
I 8
.B /etc/telnetd
[\fB\-debug\fP [\fIport\fP]]
[\fB\-l]
[\fB\-D options\fP]
[\fB\-D report\fP]
[\fB\-D exercise\fP]
[\fB\-D netdata\fP]
[\fB\-D ptydata\fP]
E 8
E 7
D 3
[
.B \-d
] [
.I port
]
E 3
.SH DESCRIPTION
.I Telnetd
D 3
is a server which supports the DARPA standard TELNET
virtual terminal protocol.  The TELNET server operates
at the port indicated in the ``telnet'' service description;
see
.IR services (5).
This port number may be overridden (for debugging purposes)
by specifying a port number on the command line.  If the
.B \-d
option is specified, each socket created by
.I telnetd
will have debugging enabled (see SO_DEBUG in
.IR socket (2)).
E 3
I 3
is a server which supports the DARPA standard
.B TELNET
E 12
I 12
.Dd %Q%
.Dt TELNETD 8
.Os BSD 4.2
.Sh NAME
.Nm telnetd
.Nd DARPA
.Tn TELNET
protocol server
.Sh SYNOPSIS
.Nm /usr/libexec/telnetd
D 13
.Op Fl a Ar authmode
.Op Fl B
E 13
I 13
.Op Fl BUhlkns
E 13
.Op Fl D Ar debugmode
D 13
.Op Fl edebug
.Op Fl h
E 13
.Op Fl I Ns Ar initid
D 13
.Op Fl l
.Op Fl k
.Op Fl n
.Op Fl r Ns Ar lowpty-highpty
.Op Fl s
E 13
.Op Fl S Ar tos
D 13
.Op Fl u Ar len
.Op Fl U
E 13
.Op Fl X Ar authtype
I 13
.Op Fl a Ar authmode
.Op Fl edebug
.Op Fl r Ns Ar lowpty-highpty
.Op Fl u Ar len
E 13
.Op Fl debug Op Ar port
.Sh DESCRIPTION
The
.Nm telnetd
command is a server which supports the
.Tn DARPA
standard
.Tn TELNET
E 12
virtual terminal protocol.
D 12
.I Telnetd
is invoked by the internet server (see
.IR inetd (8)),
normally for requests to connect to the
.B TELNET
E 12
I 12
.Nm Telnetd
is normally invoked by the internet server (see
.Xr inetd 8 )
for requests to connect to the
.Tn TELNET
E 12
port as indicated by the
D 12
.I /etc/services
E 12
I 12
.Pa /etc/services
E 12
file (see
D 12
.IR services (5)).
I 8
If the \fB\-debug\fP may be used, to start up \fBtelnetd\fP
E 12
I 12
.Xr services 5 ) .
The
.Fl debug
option may be used to start up
.Nm telnetd
E 12
manually, instead of through
D 12
.IR inetd (8).
If started up this way, \fIport\fP may be specified to
run \fItelnetd\fP on an alternate TCP port number.
E 8
E 3
.PP
I 8
The \fB\-D\fP option may be used for debugging purposes.
This allows \fItelnet\fR to print out debugging information
to the connection, allowing the user to see what telnetd
E 12
I 12
.Xr inetd 8 .
If started up this way, 
.Ar port
may be specified to run
.Nm telnetd
on an alternate
.Tn TCP
port number.
.Pp
The
.Nm telnetd
command accepts the following options:
.Bl -tag -width "-a authmode"
.It Fl a Ar authmode
This option may be used for specifying what mode should
be used for authentication.
Note that this option is only useful if
.Nm telnetd
has been compiled with support for the
.Dv AUTHENTICATION
option.
There are several valid values for
.Ar authmode:
.Bl -tag -width debug
.It debug
Turns on authentication debugging code.
.It user
Only allow connections when the remote user
can provide valid authentication information
to identify the remote user,
and is allowed access to the specified account
without providing a password.
.It valid
Only allow connections when the remote user
can provide valid authentication information
to identify the remote user.
The
.Xr login 1
command will provide any additional user verification
needed if the remote user is not allowed automatic
access to the specified account.
.It other
Only allow connections that supply some authentication information.
This option is currently not supported
by any of the existing authentication mechanisms,
and is thus the same as specifying
.Fl a
.Cm valid .
.It none
This is the default state.
Authentication information is not required.
If no or insufficient authentication information
is provided, then the
.Xr login 1
program will provide the necessary user
verification.
.It off
This disables the authentication code.
All user verification will happen through the
.Xr login 1
program.
.El
.It Fl B
Specifies bftp server mode.  In this mode,
.Nm telnetd
causes login to start a
.Xr bftp 1
session rather than the user's
normal shell.  In bftp daemon mode normal
logins are not supported, and it must be used
on a port other than the normal
.Tn TELNET
port.
.It Fl D Ar debugmode
This option may be used for debugging purposes.
This allows
.Nm telnetd
to print out debugging information
to the connection, allowing the user to see what
.Nm telnetd
E 12
is doing.
D 12
There are several modifiers:
\fBoptions\fR prints information about the negotiation
of \fBTELNET\fR options,
\fBreport\fR prints the \fBoptions\fR information, plus
some additional information about what processing is going on,
\fBnetdata\fP displays the data stream received by \fItelnetd\fP,
\fBptydata\fP displays data written to the pty, and
\fBexercise\fR has not been implemented yet.
.PP
E 8
.I Telnetd
E 12
I 12
There are several possible values for 
.Ar debugmode:
.Bl -tag -width exercise
.It Cm options
Prints information about the negotiation of
.Tn TELNET
options.
.It Cm report
Prints the 
.Cm options
information, plus some additional information
about what processing is going on.
.It Cm netdata
Displays the data stream received by
.Nm telnetd.
.It Cm ptydata
Displays data written to the pty.
.It Cm exercise
Has not been implemented yet.
.El
.It Fl debug
Enables debugging on each socket created by
.Nm telnetd
(see
.Dv SO_DEBUG
in
.Xr socket 2 ) .
.It Fl edebug
If
.Nm telnetd
has been compiled with support for data encryption, then the
.Fl edebug
option may be used to enable encryption debugging code.
.It Fl h
Disables the printing of host-specific information before
login has been completed.
.It Fl I Ar initid
This option is only applicable to
.Tn UNICOS
systems prior to 7.0.
It specifies the
.Dv ID
from
.Pa /etc/inittab
to use when init starts login sessions.  The default
.Dv ID
is
.Dv fe.
.It Fl k
This option is only useful if
.Nm telnetd
has been compiled with both linemode and kludge linemode
support.  If the
.Fl k
option is specified, then if the remote client does not
support the
.Dv LINEMODE
option, then
.Nm telnetd
will operate in character at a time mode.
It will still support kludge linemode, but will only
go into kludge linemode if the remote client requests
it.
(This is done by by the client sending
.Dv DONT SUPPRESS-GO-AHEAD
and
.Dv DONT ECHO . )
The
.Fl k
option is most useful when there are remote clients
that do not support kludge linemode, but pass the heuristic
(if they respond with
.Dv WILL TIMING-MARK
in response to a
.Dv DO TIMING-MARK)
for kludge linemode support.
.It Fl l
Specifies line mode.  Tries to force clients to use line-
at-a-time mode.
If the
.Dv LINEMODE
option is not supported, it will go
into kludge linemode.
.It Fl n
Disable
.Dv TCP
keep-alives.  Normally
.Nm telnetd
enables the
.Tn TCP
keep-alive mechanism to probe connections that
have been idle for some period of time to determine
if the client is still there, so that idle connections
from machines that have crashed or can no longer
be reached may be cleaned up.
.It Fl r Ar lowpty-highpty
This option is only enabled when
.Nm telnetd
is compiled for
.Dv UNICOS.
It specifies an inclusive range of pseudo-terminal devices to
use.  If the system has sysconf variable
.Dv _SC_CRAY_NPTY
configured, the default pty search range is 0 to
.Dv _SC_CRAY_NPTY;
otherwise, the default range is 0 to 128.  Either
.Ar lowpty
or
.Ar highpty
may be omitted to allow changing
either end of the search range.  If
.Ar lowpty
is omitted, the - character is still required so that
.Nm telnetd
can differentiate
.Ar highpty
from
.Ar lowpty .
.It Fl s
This option is only enabled if
.Nm telnetd
is compiled with support for
.Tn SecurID
cards.
It causes the
.Fl s
option to be passed on to
.Xr login 1 ,
and thus is only useful if
.Xr login 1
supports the
.Fl s
flag to indicate that only
.Tn SecurID
validated logins are allowed, and is
usually useful for controlling remote logins
from outside of a firewall.
.It Fl S Ar tos
.It Fl u Ar len
This option is used to specify the size of the field
in the
.Dv utmp
structure that holds the remote host name.
If the resolved host name is longer than
.Ar len ,
the dotted decimal value will be used instead.
This allows hosts with very long host names that
overflow this field to still be uniquely identified.
Specifying
.Fl u0
indicates that only dotted decimal addresses
should be put into the
.Pa utmp
file.
I 14
.ne 1i
E 14
.It Fl U
This option causes
.Nm telnetd
to refuse connections from addresses that
cannot be mapped back into a symbolic name
via the
.Xr gethostbyaddr 3
routine.
.It Fl X Ar authtype
This option is only valid if
.Nm telnetd
has been built with support for the authentication option.
It disables the use of
.Ar authtype
authentication, and
can be used to temporarily disable
a specific authentication type without having to recompile
.Nm telnetd .
.El
.Pp
.Nm Telnetd
E 12
operates by allocating a pseudo-terminal device (see
D 12
.IR pty (4))
E 12
I 12
.Xr pty 4 )
E 12
for a client, then creating a login process which has
the slave side of the pseudo-terminal as 
D 12
.BR stdin ,
.BR stdout ,
E 12
I 12
.Dv stdin ,
.Dv stdout
E 12
and
D 12
.BR stderr .
.I Telnetd
E 12
I 12
.Dv stderr .
.Nm Telnetd
E 12
D 3
manipulates the master side of the pseudo terminal,
implementing the TELNET protocol and passing characters
between the client and login process.
E 3
I 3
manipulates the master side of the pseudo-terminal,
implementing the
D 12
.B TELNET
E 12
I 12
.Tn TELNET
E 12
protocol and passing characters
between the remote client and the login process.
E 3
D 12
.PP
E 12
I 12
.Pp
E 12
D 3
When a TELNET session is started up, 
E 3
I 3
When a
D 12
.B TELNET
E 12
I 12
.Tn TELNET
E 12
session is started up, 
E 3
D 12
.I telnetd
E 12
I 12
.Nm telnetd
E 12
D 3
sends a TELNET option to the client side indicating
a willingness to do ``remote echo'' of characters.
The pseudo terminal allocated to the client is configured
to operate in ``cooked'' mode, and with XTABS and CRMOD
E 3
I 3
sends
D 12
.B TELNET
E 12
I 12
.Tn TELNET
E 12
options to the client side indicating
D 12
a willingness to do
.I remote echo
of characters, to
.I suppress go
.IR ahead ,
I 6
to do
.I remote flow
.IR control ,
E 6
and to receive
D 6
.I terminal type information
E 6
I 6
.I terminal type
.IR information ,
.I terminal speed
.IR information ,
and
.I window size information
E 6
from the remote client.
If the remote client is willing, the remote terminal type is
propagated in the environment of the created login process.
E 12
I 12
a willingness to do the
following
.Tn TELNET
options, which are described in more detail below:
.Bd -literal -offset indent
DO AUTHENTICATION
WILL ENCRYPT
DO TERMINAL TYPE
DO TSPEED
DO XDISPLOC
DO NEW-ENVIRON
DO ENVIRON
WILL SUPPRESS GO AHEAD
DO ECHO
DO LINEMODE
DO NAWS
WILL STATUS
DO LFLOW
DO TIMING-MARK
.Ed
.Pp
E 12
The pseudo-terminal allocated to the client is configured
D 12
to operate in \*(lqcooked\*(rq mode, and with XTABS and CRMOD
E 12
I 12
to operate in \*(lqcooked\*(rq mode, and with
.Dv XTABS and
.Dv CRMOD
E 12
E 3
enabled (see
D 12
.IR tty (4)).
D 3
Aside from this initial setup, the only mode changes
.I telnetd
will carry out are those required for echoing characters
at the client side of the connection.
E 3
.PP
.I Telnetd
D 3
supports binary mode, and most of the common TELNET options,
but does not, for instance, support timing marks.  Consult
the source code for an exact list of which options are not
implemented.
E 3
I 3
is willing to
.IR do :
.IR echo ,
.IR binary ,
.I suppress go
.IR ahead ,
and
.I timing
.IR mark .
.I Telnetd
is willing to have the remote client
.IR do :
I 8
.IR linemode ,
E 8
.IR binary ,
.I terminal
.IR type ,
I 6
.I terminal
.IR speed ,
.I window
.IR size ,
.I toggle flow
.IR control ,
I 8
.IR environment ,
.I X display
.IR location ,
E 8
E 6
and
.I suppress go
.IR ahead .
E 3
.SH "SEE ALSO"
D 5
telnet(1C)
E 5
I 5
telnet(1)
E 5
.SH BUGS
E 12
I 12
.Xr tty 4 ) .
.Pp
.Nm Telnetd
has support for enabling locally the following
.Tn TELNET
options:
.Bl -tag -width "DO AUTHENTICATION"
.It "WILL ECHO"
When the
.Dv LINEMODE
option is enabled, a
.Dv WILL ECHO
or
.Dv WONT ECHO
will be sent to the client to indicate the
current state of terminal echoing.
When terminal echo is not desired, a
.Dv WILL ECHO
is sent to indicate that
.Tn telnetd
will take care of echoing any data that needs to be
echoed to the terminal, and then nothing is echoed.
When terminal echo is desired, a
.Dv WONT ECHO
is sent to indicate that
.Tn telnetd
will not be doing any terminal echoing, so the
client should do any terminal echoing that is needed.
.It "WILL BINARY"
Indicates that the client is willing to send a
8 bits of data, rather than the normal 7 bits
of the Network Virtual Terminal.
.It "WILL SGA"
Indicates that it will not be sending
.Dv IAC GA,
go ahead, commands.
.It "WILL STATUS"
Indicates a willingness to send the client, upon
request, of the current status of all
.Tn TELNET
options.
.It "WILL TIMING-MARK"
Whenever a
.Dv DO TIMING-MARK
command is received, it is always responded
to with a
.Dv WILL TIMING-MARK
I 14
.ne 1i
E 14
.It "WILL LOGOUT"
When a
.Dv DO LOGOUT
is received, a
.Dv WILL LOGOUT
is sent in response, and the
.Tn TELNET
session is shut down.
.It "WILL ENCRYPT"
Only sent if
.Nm telnetd
is compiled with support for data encryption, and
indicates a willingness to decrypt
the data stream.
.El
.Pp
.Nm Telnetd
has support for enabling remotely the following
.Tn TELNET
options:
.Bl -tag -width "DO AUTHENTICATION"
.It "DO BINARY"
Sent to indicate that
.Tn telnetd
is willing to receive an 8 bit data stream.
.It "DO LFLOW"
Requests that the client handle flow control
characters remotely.
.It "DO ECHO"
This is not really supported, but is sent to identify a 4.2BSD
.Xr telnet 1
client, which will improperly respond with
.Dv WILL ECHO.
If a
.Dv WILL ECHO
is received, a
.Dv DONT ECHO
will be sent in response.
.It "DO TERMINAL-TYPE"
Indicates a desire to be able to request the
name of the type of terminal that is attached
to the client side of the connection.
.It "DO SGA"
Indicates that it does not need to receive
.Dv IAC GA,
the go ahead command.
.It "DO NAWS"
Requests that the client inform the server when
the window (display) size changes.
.It "DO TERMINAL-SPEED"
Indicates a desire to be able to request information
about the speed of the serial line to which
the client is attached.
.It "DO XDISPLOC"
Indicates a desire to be able to request the name
of the X windows display that is associated with
the telnet client.
.It "DO NEW-ENVIRON"
Indicates a desire to be able to request environment
variable information, as described in RFC 1572.
.It "DO ENVIRON"
Indicates a desire to be able to request environment
variable information, as described in RFC 1408.
.It "DO LINEMODE"
Only sent if
.Nm telnetd
is compiled with support for linemode, and
requests that the client do line by line processing.
.It "DO TIMING-MARK"
Only sent if
.Nm telnetd
is compiled with support for both linemode and
kludge linemode, and the client responded with
.Dv WONT LINEMODE.
If the client responds with
.Dv WILL TM,
the it is assumed that the client supports
kludge linemode.
Note that the
.Op Fl k
option can be used to disable this.
.It "DO AUTHENTICATION"
Only sent if
.Nm telnetd
is compiled with support for authentication, and
indicates a willingness to receive authentication
information for automatic login.
.It "DO ENCRYPT"
Only sent if
.Nm telnetd
is compiled with support for data encryption, and
indicates a willingness to decrypt
the data stream.
.Sh ENVIRONMENT
.Sh FILES
.Pa /etc/services
.br
.Pa /etc/inittab
(UNICOS systems only)
.br
.Pa /etc/iptos
(if supported)
.br
.Pa /usr/ucb/bftp
(if supported)
.Sh "SEE ALSO"
.Xr telnet 1 ,
.Xr login 1 ,
.Xr bftp 1
(if supported)
.Sh STANDARDS
.Bl -tag -compact -width RFC-1572
.It Cm RFC-854
.Tn TELNET
PROTOCOL SPECIFICATION
.It Cm RFC-855
TELNET OPTION SPECIFICATIONS
.It Cm RFC-856
TELNET BINARY TRANSMISSION
.It Cm RFC-857
TELNET ECHO OPTION
.It Cm RFC-858
TELNET SUPPRESS GO AHEAD OPTION
.It Cm RFC-859
TELNET STATUS OPTION
.It Cm RFC-860
TELNET TIMING MARK OPTION
.It Cm RFC-861
TELNET EXTENDED OPTIONS - LIST OPTION
.It Cm RFC-885
TELNET END OF RECORD OPTION
.It Cm RFC-1073
Telnet Window Size Option
.It Cm RFC-1079
Telnet Terminal Speed Option
.It Cm RFC-1091
Telnet Terminal-Type Option
.It Cm RFC-1096
Telnet X Display Location Option
.It Cm RFC-1123
Requirements for Internet Hosts -- Application and Support
.It Cm RFC-1184
Telnet Linemode Option
.It Cm RFC-1372
Telnet Remote Flow Control Option
.It Cm RFC-1416
Telnet Authentication Option
.It Cm RFC-1411
Telnet Authentication: Kerberos Version 4
.It Cm RFC-1412
Telnet Authentication: SPX
.It Cm RFC-1571
Telnet Environment Option Interoperability Issues
.It Cm RFC-1572
Telnet Environment Option
.Sh BUGS
E 12
D 3
A complete list of the options supported should be given here.
E 3
I 3
Some
D 12
.B TELNET
E 12
I 12
.Tn TELNET
E 12
commands are only partially implemented.
D 12
.PP
E 12
I 12
.Pp
E 12
D 6
The
.B TELNET
protocol allows for
the exchange of the number of lines and columns on the user's terminal,
but
.I telnetd
doesn't make use of them.
.PP
E 6
Because of bugs in the original 4.2 BSD
D 5
.IR telnet (1C),
E 5
I 5
D 12
.IR telnet (1),
E 5
.I telnetd
E 12
I 12
.Xr telnet 1 ,
.Nm telnetd
E 12
performs some dubious protocol exchanges to try to discover if the remote
client is, in fact, a 4.2 BSD
D 5
.IR telnet (1C).
E 5
I 5
D 12
.IR telnet (1).
E 5
.PP
.I Binary mode
E 12
I 12
.Xr telnet 1 .
.Pp
Binary mode
E 12
has no common interpretation except between similar operating systems
(Unix in this case).
D 12
.PP
E 12
I 12
.Pp
E 12
The terminal type name received from the remote client is converted to
lower case.
D 6
.PP
The
.I packet
interface to the pseudo-terminal
(see
.IR pty (4))
should be used for more
intelligent flushing of input and output queues.
E 6
D 12
.PP
.I Telnetd
E 12
I 12
.Pp
.Nm Telnetd
E 12
never sends
D 12
.B TELNET
.I go ahead
commands.
E 12
I 12
.Tn TELNET
.Dv IAC GA
(go ahead) commands.
E 12
E 3
E 1
