usr.sbin/lpr/lpr/SCCS/s.lpr.1
h14337
s 00002/00002/00228
d D 8.1 93/06/06 14:01:28 bostic 14 13
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00006/00003/00224
d D 6.10 91/07/24 19:11:34 cael 13 12
c changed a macro invocation
e
s 00071/00095/00156
d D 6.9 91/05/09 16:46:23 cael 12 11
c mdoc version three
e
s 00002/00000/00249
d D 6.8 91/03/14 00:29:50 cael 11 9
c add .Vx so tmac.andoc will call tmac.mdoc-old
e
s 00001/00000/00249
d R 6.8 91/03/13 20:39:20 cael 10 9
c add .Vx so tmac.andoc will call tmac.mdoc-old
e
s 00092/00068/00157
d D 6.7 90/07/24 22:47:54 cael 9 8
c .Xr botch fix
e
s 00162/00156/00063
d D 6.6 90/06/30 01:30:19 cael 8 7
c converted man page
e
s 00004/00014/00215
d D 6.5 90/06/24 19:10:19 cael 7 6
c converted man page
e
s 00000/00000/00229
d D 6.4 90/06/11 05:56:34 cael 6 5
c converted man page
e
s 00011/00000/00218
d D 6.3 88/12/21 17:38:47 sklower 5 4
c put in User option for requeing print jobs from filters.
e
s 00014/00003/00204
d D 6.2 88/09/29 09:32:22 bostic 4 3
c add Berkeley copyright notice
e
s 00001/00001/00206
d D 6.1 85/04/29 14:32:31 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00184/00053/00023
d D 5.1 85/04/29 14:32:18 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00076/00000/00000
d D 4.1 85/04/29 14:32:10 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
D 4
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 4
I 4
D 7
.\" Copyright (c) 1980 The Regents of the University of California.
E 7
I 7
D 14
.\" Copyright (c) 1980, 1990 The Regents of the University of California.
E 7
.\" All rights reserved.
E 14
I 14
.\" Copyright (c) 1980, 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 14
.\"
D 7
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 7
I 7
D 12
.\" %sccs.include.redist.man%
E 12
I 12
.\" %sccs.include.redist.roff%
E 12
E 7
E 4
.\"
D 7
.\"	%W% (Berkeley) %G%
E 7
I 7
.\"     %W% (Berkeley) %G%
E 7
.\"
I 11
D 12
.Vx
.Vx
E 12
E 11
D 2
.TH LPR 1 4/1/81
E 2
I 2
D 3
.TH LPR 1 "28 July 1983"
E 3
I 3
D 7
.TH LPR 1 "%Q%"
E 7
I 7
D 8
.TH LPR 1 "%Q"
E 7
E 3
E 2
.UC 4
.SH NAME
D 2
lpr, lprm, lpq, print \- line printer spooler
E 2
I 2
lpr \- off line print
E 2
.SH SYNOPSIS
.B lpr
[
D 2
.B \-m
] [ name ... ]
.br
.B lprm
E 2
I 2
.BI \-P printer
] [
.BI \-# num
] [
.B \-C
.I class
] [
.B \-J
.I job
] [
.B \-T
.I title
] [
I 5
.B \-U
.I user
] [
E 5
.B \-i
E 2
[
D 2
id ...
E 2
I 2
.I numcols
]] [
.B \-1234
.I font
E 2
] [
D 2
filename ...
E 2
I 2
.BI \-w num
E 2
] [
D 2
owner ...
E 2
I 2
.B \-pltndgvcfrmhs
] [
name ...
E 2
]
D 2
.br
.B lpq
.br
.B print
file ...
E 2
.SH DESCRIPTION
D 2
.I Lpr 
causes the
named files
to be queued for printing.
If no files are named, the standard input is read.
The option
.B \-m
causes notification via
.IR mail (1)
to be sent when the job completes.
E 2
I 2
.B Lpr
E 8
I 8
.Dd %Q%
.Dt LPR 1
.Os BSD 4
.Sh NAME
.Nm lpr
.Nd off line print
.Sh SYNOPSIS
.Nm lpr
D 12
.Oo
.Op Fl P Ar printer
.Op Fl \&# Ar num
.Oo
E 12
I 12
.Op Fl P Ns Ar printer
.Op Fl \&# Ns Ar num
E 12
.Op Fl C Ar class
.Op Fl J Ar job
.Op Fl T Ar title
.Op Fl U Ar user
.Op Fl i Op Ar numcols
.Op Fl 1234 Ar font
D 12
.Oo
.Op Fl w Ar num
.Oo
E 12
I 12
.Op Fl w Ns Ar num
E 12
D 9
.Op Fl pltndgvcfrmhs
E 9
I 9
.Op Fl cdfghlnmprstv
E 9
.Op Ar name ...
D 12
.Oo
E 12
.Sh DESCRIPTION
.Nm Lpr
E 8
uses a spooling daemon to print the named files when facilities
become available.  If no names appear, the standard input is assumed.
D 8
The
.B \-P
E 8
I 8
D 9
.Fl P
E 8
option may be used to force output to a specific printer.  Normally,
the default printer is used (site dependent), or the value of the
D 8
environment variable PRINTER is used.
E 2
.PP
E 8
I 8
environment variable
.Ev PRINTER
is used.
E 9
.Pp
E 8
D 2
.I Lprm
removes an entry from the line printer queue.
The id, filename or owner should be that reported by
.I lpq.
All appropriate files will be removed.
The id of each file removed from the queue will be printed.
E 2
I 2
The following single letter options are used to notify the line printer
spooler that the files are not standard text files. The spooling daemon will
use the appropriate filters to print the data accordingly.
D 8
.IP \fB\-p\fP 5
E 8
I 8
D 12
.Tw Fl
D 9
.Tp Fl p
E 8
Use
D 8
.IR pr (1)
E 8
I 8
.Xr pr  1
E 8
to format the files (equivalent to
D 8
.IR print ).
.IP \fB\-l\fP 5
E 8
I 8
.Em print  ) .
.Tp Fl l
E 8
Use a filter which allows control characters to be printed and suppresses
page breaks.
D 8
.IP \fB\-t\fP 5
E 8
I 8
.Tp Fl t
E 8
The files are assumed to contain data from
D 8
.IR troff (1)
E 8
I 8
.Xr troff  1
E 8
(cat phototypesetter commands).
D 8
.IP \fB\-n\fP 5
E 8
I 8
.Tp Fl n
E 8
The files are assumed to contain data from
D 8
.I ditroff
E 8
I 8
.Em ditroff
E 8
(device independent troff).
E 9
I 9
.Tp Fl c
E 12
I 12
.Bl -tag -width indent
.It Fl c
E 12
The files are assumed to contain data produced by
.Xr cifplot 1
E 9
D 8
.IP \fB\-d\fP 5
E 8
I 8
D 12
.Tp Fl d
E 12
I 12
.It Fl d
E 12
E 8
The files are assumed to contain data from
D 8
.IR tex (l)
E 8
I 8
.Em tex
E 8
D 12
(DVI format from Stanford).
I 9
.Tp Fl f
E 12
I 12
.Pf ( Tn DVI
format from Stanford).
.It Fl f
E 12
Use a filter which interprets the first character of each line as a
D 12
standard FORTRAN carriage control character.
E 9
D 8
.IP \fB\-g\fP 5
E 8
I 8
.Tp Fl g
E 12
I 12
standard
.Tn FORTRAN
carriage control character.
.It Fl g
E 12
E 8
The files are assumed to contain standard plot data as produced by the
D 8
.IR plot (3X)
E 8
I 8
.Xr plot
E 8
routines (see also
D 8
.IR plot (1G)
E 8
I 8
.Xr plot
E 8
for the filters used by the printer spooler).
I 9
D 12
.Tp Fl l
E 12
I 12
.It Fl l
E 12
Use a filter which allows control characters to be printed and suppresses
page breaks.
D 12
.Tp Fl n
E 12
I 12
.It Fl n
E 12
The files are assumed to contain data from
.Em ditroff
(device independent troff).
D 12
.Tp Fl p
E 12
I 12
.It Fl p
E 12
Use
.Xr pr  1
to format the files (equivalent to
D 12
.Em print  ) .
.Tp Fl t
E 12
I 12
.Xr print  ) .
.It Fl t
E 12
The files are assumed to contain data from
.Xr troff  1
(cat phototypesetter commands).
E 9
D 8
.IP \fB\-v\fP 5
E 8
I 8
D 12
.Tp Fl v
E 12
I 12
.It Fl v
E 12
E 8
The files are assumed to contain a raster image for devices like the
Benson Varian.
D 8
.IP \fB\-c\fP 5
E 8
I 8
D 9
.Tp Fl c
E 8
The files are assumed to contain data produced by
D 8
.IR cifplot (l).
.IP \fB\-f\fP 5
E 8
I 8
.Xr cifplot 1
.Tp Fl f
E 8
Use a filter which interprets the first character of each line as a
standard FORTRAN carriage control character.
E 9
E 2
D 8
.PP
E 8
I 8
D 12
.Tp
E 12
I 12
.El
E 12
.Pp
E 8
D 2
.I Lpq
prints the line printer queue.
Each entry in the queue is printed showing the owner of the queue entry,
an identification number,
the size of the entry in characters,
and the file which is to be printed.
E 2
I 2
D 9
The remaining single letter options have the following meaning.
E 9
I 9
These options apply to the handling of
the print job:
E 9
D 8
.IP \fB\-r\fP 5
E 8
I 8
D 12
.Tw Fl
I 9
.Tp Fl P
E 12
I 12
.Bl -tag -width indent
.It Fl P
E 12
Force output to a specific printer.  Normally,
the default printer is used (site dependent), or the value of the
environment variable
.Ev PRINTER
is used.
D 12
.Tp Fl h
E 12
I 12
.It Fl h
E 12
Suppress the printing of the burst page.
D 12
.Tp Fl m
E 12
I 12
.It Fl m
E 12
Send mail upon completion.
E 9
D 12
.Tp Fl r
E 12
I 12
.It Fl r
E 12
E 8
Remove the file upon completion of spooling or upon completion of
D 8
printing (with the \fB\-s\fP option).
.IP \fB\-m\fP 5
E 8
I 8
printing (with the
.Fl s
option).
I 9
D 12
.Tp Fl s
E 12
I 12
.It Fl s
E 12
Use symbolic links.  Usually files are copied to the spool directory.
E 9
The
.Fl s
option will use
.Xr symlink  2
to link data files rather than trying to copy them so large files can be
printed.  This means the files should
not be modified or removed until they have been printed.
D 9
.Tp Fl m
E 8
Send mail upon completion.
D 8
.IP \fB\-h\fP 5
E 8
I 8
.Tp Fl h
E 8
Suppress the printing of the burst page.
D 8
.IP \fB\-s\fP 5
E 8
I 8
.Tp Fl s
E 8
Use symbolic links.  Usually files are copied to the spool directory.
D 8
.PP 
E 2
The
D 2
.I id
is useful for removing a specific entry from the printer queue using
.IR lprm (1).
E 2
I 2
.B \-C
option takes the following argument as a job classification
E 8
I 8
.Tp Fl C
Uses the following argument as a job classification
E 8
for use on the burst page.  For example,
E 9
I 9
D 12
.Tp
E 12
I 12
.El
E 12
E 9
E 2
D 8
.PP
D 2
.I Print
.I pr's
a copy of each named file on the line printer.
It is a one line shell script:
E 2
I 2
.ti +0.5i
lpr \-C EECS foo.c
E 2
.PP
E 8
I 8
.Pp
D 9
.Dl lpr \-C EECS foo.c
.Pp
E 8
D 2
.DT
	pr $* | lpr
E 2
I 2
causes the system name (the name returned by
D 8
.IR hostname (1))
E 8
I 8
.Xr hostname  1  )
E 8
to be replaced on the burst page by EECS,
and the file foo.c to be printed.
D 8
.PP
The
.B \-J
option takes the following argument as the job name to print on the burst page.
E 8
I 8
.Tp Fl J
Uses the following argument as the job name to print on the burst page.
E 8
Normally, the first file's name is used.
I 5
D 8
.PP
The
.B \-U
option takes the following argument as the user name to print on the burst page,
and to use for accounting purposes.
E 8
I 8
.Tp Fl U
Uses the following argument as the user name to print on the burst page,
and for accounting purposes.
E 8
This option is only honored if the real user-id is daemon
(or that specified in the printcap file instead of daemon),
and is intended for those instances where print filters wish to requeue jobs.
E 5
D 8
.PP
The
.B \-T
option uses the next argument as the title used by
.IR pr (1)
E 8
I 8
.Tp Fl T
Uses the next argument as the title used by
.Xr pr  1
E 8
instead of the file name.
E 9
I 9
The remaining options apply to copies, the page display, and headers:
D 12
.Tw Fl
E 9
D 8
.PP
To get multiple copies of output, use the
.BI \-# num
option,
where
.I num
E 8
I 8
.Tc Fl \&#
.Ar num
.Cx
E 12
I 12
.Bl -tag -width indent
.It Fl \&# Ns Ar num
E 12
The quantity
.Ar num
E 8
is the number of copies desired of each file named.  For example,
D 8
.PP
.ti +0.5i
lpr \-#3 foo.c bar.c more.c
.PP
E 8
I 8
D 12
.Pp
.Dl lpr \-#3 foo.c bar.c more.c
.Pp
E 12
I 12
.Bd -literal -offset indent
lpr \-#3 foo.c bar.c more.c
.Ed
E 12
E 8
would result in 3 copies of the file foo.c, followed by 3 copies
D 8
of the file bar.c, etc.  On the other hand, 
.PP
.ti +0.5i
cat foo.c bar.c more.c | lpr \-#3
.PP
E 8
I 8
of the file bar.c, etc.  On the other hand,
I 12
.Bd -literal -offset indent
cat foo.c bar.c more.c \&| lpr \-#3
.Ed
E 12
.Pp
D 12
.Dl cat foo.c bar.c more.c \&| lpr \-#3
.Pp
E 12
E 8
D 9
will give three copies of the concatenation of the files.
E 9
I 9
will give three copies of the concatenation of the files. Often
a site will disable this feature to encourage use of a photocopier
instead.
D 12
.Tc Fl
.Op Cm 1234
.Ws
.Ar font
.Cx
E 12
I 12
D 13
.It Fl Oo Cm 1234 Oc Ar font
E 13
I 13
.It Xo
.Fl Ns Oo Cm 1234 Oc Ar font
.Xc
E 13
E 12
Specifies a
.Ar font
to be mounted on font position
.Ar i  .
The daemon
will construct a
.Li .railmag
file referencing
the font pathname.
D 12
.Tc Fl C
.Ws
.Ar class
.Cx
E 12
I 12
.It Fl C Ar class
E 12
Job classification
to use on the burst page.  For example,
I 12
.Bd -literal -offset indent
lpr \-C EECS foo.c
.Ed
E 12
.Pp
D 12
.Dl lpr \-C EECS foo.c
.Pp
E 12
causes the system name (the name returned by
.Xr hostname  1  )
D 12
to be replaced on the burst page by EECS,
E 12
I 12
to be replaced on the burst page by
.Tn EECS ,
E 12
and the file foo.c to be printed.
D 12
.Tc Fl J
.Ws
.Ar job
.Cx
E 12
I 12
.It Fl J Ar job
E 12
Job name to print on the burst page.
Normally, the first file's name is used.
D 12
.Tc Fl T
.Ws
.Ar title
.Cx
E 12
I 12
.It Fl T Ar title
E 12
Title name for
.Xr pr  1 ,
instead of the file name.
D 12
.Tc Fl U
.Ws
.Ar user
.Cx
E 12
I 12
.It Fl U Ar user
E 12
User name to print on the burst page,
also for accounting purposes.
This option is only honored if the real user-id is daemon
(or that specified in the printcap file instead of daemon),
and is intended for those instances where print filters wish to requeue jobs.
E 9
D 8
.PP
The
.B \-i
option causes the output to be indented. If the next argument
is numeric, it is used as the number of blanks to be printed before each
E 8
I 8
D 12
.Tc Fl i
.Ws
.Op numcols
.Cx
E 12
I 12
.It Fl i Op numcols
E 12
The output is indented. If the next argument
is numeric
D 12
.Pf \&( Ar numcols ) ,
E 12
I 12
.Pq Ar numcols ,
E 12
it is used as the number of blanks to be printed before each
E 8
line; otherwise, 8 characters are printed.
D 8
.PP
The
.B \-w
option takes the immediately following number to be
the page width for
.IR pr .
.PP
The
.B \-s
option will use
.IR symlink (2)
to link data files rather than trying to copy them so large files can be
printed.  This means the files should
not be modified or removed until they have been printed.
.PP
The option
.B \-1234
Specifies a font to be mounted on font position \fIi\fR.  The daemon
will construct a \fI.railmag\fR file referencing
\fI/usr/lib/vfont/name.size\fR.
E 2
.SH FILES
D 2
.ta 2i
/usr/spool/lpd/*	spool area
.br
/usr/lib/lpd	printer daemon
.br
/usr/lib/lpf	filter to handle banners and underlining
.SH SEE\ ALSO
pr(1)
E 2
I 2
.nf
.ta \w'/usr/spool/*/cf*       'u
/etc/passwd	personal identification
/etc/printcap	printer capabilities data base
/usr/lib/lpd*	line printer daemons
/usr/spool/*	directories used for spooling
/usr/spool/*/cf*	daemon control files
/usr/spool/*/df*	data files specified in "cf" files
/usr/spool/*/tf*	temporary copies of "cf" files
.fi
.SH "SEE ALSO"
lpq(1),
lprm(1),
pr(1),
symlink(2),
printcap(5),
lpc(8),
lpd(8)
.SH DIAGNOSTICS
E 8
I 8
D 12
.Tc Fl w
.Ar num
.Cx
E 12
I 12
.It Fl w Ns Ar num
E 12
Uses
.Ar num
as the page width for
.Xr pr 1 .
D 9
.Tp Fl 1234
Specifies a font to be mounted on font position
.Ar i  .
The daemon
will construct a
.Li .railmag
file referencing
the font pathname.
E 9
D 12
.Tp
E 12
I 12
.El
E 12
.Sh ENVIRONMENT
If the following environment variable exists, it is used by
.Nm lpr :
D 12
.Tw Fl
.Tp Ev PRINTER
E 12
I 12
.Bl -tag -width PRINTER
.It Ev PRINTER
E 12
Specifies an alternate default printer.
D 12
.Tp
E 12
I 12
.El
E 12
.Sh FILES
D 12
.Dw /var/spool/output/*/tf*
.Di L
.Dp Pa /etc/passwd
personal identification
.Dp Pa /etc/printcap
printer capabilities data base
.Dp Pa /usr/sbin/lpd*
line printer daemons
.Dp Pa /var/spool/output/*
directories used for spooling
.Dp Pa /var/spool/output/*/cf*
daemon control files
.Dp Pa /var/spool/output/*/df*
data files specified in "cf" files
.Dp Pa /var/spool/output/*/tf*
temporary copies of "cf" files
.Dp
E 12
I 12
.Bl -tag -width /var/spool/output/*/tf* -compact
.It Pa /etc/passwd
Personal identification.
.It Pa /etc/printcap
Printer capabilities data base.
.It Pa /usr/sbin/lpd*
Line printer daemons.
.It Pa /var/spool/output/*
Directories used for spooling.
.It Pa /var/spool/output/*/cf*
Daemon control files.
.It Pa /var/spool/output/*/df*
Data files specified in "cf" files.
.It Pa /var/spool/output/*/tf*
Temporary copies of "cf" files.
.El
E 12
.Sh SEE ALSO
.Xr lpq 1 ,
.Xr lprm 1 ,
.Xr pr 1 ,
.Xr symlink 2 ,
.Xr printcap 5 ,
.Xr lpc 8 ,
.Xr lpd 8
.Sh HISTORY
D 13
.Nm Lpr
D 12
appeared in 3 BSD.
E 12
I 12
appeared in
E 13
I 13
The
.Nm lpr
command appeared in
E 13
.Bx 3 .
E 12
D 9
.Sh BUGS
E 9
.Sh DIAGNOSTICS
E 8
If you try to spool too large a file, it will be truncated.
D 8
.I Lpr
E 8
I 8
.Nm Lpr
E 8
will object to printing binary files.
If a user other than root prints a file and spooling is disabled,
D 8
.I lpr
E 8
I 8
.Nm lpr
E 8
will print a message saying so and will not put jobs in the queue.
If a connection to
D 8
.I lpd
E 8
I 8
.Xr lpd 1
E 8
on the local machine cannot be made,
D 8
.I lpr
E 8
I 8
.Nm lpr
E 8
will say that the daemon cannot be started.
Diagnostics may be printed in the daemon's log file
regarding missing spool files by
D 8
.IR lpd .
E 2
.SH BUGS
E 8
I 8
.Xr lpd 1 .
.Sh BUGS
E 8
I 2
Fonts for
D 8
.I troff
E 8
I 8
.Xr troff 1
E 8
and
D 8
.I tex
E 8
I 8
.Xr tex
E 8
reside on the host with the printer. It is currently not possible to
use local font libraries.
E 2
E 1
