sbin/savecore/SCCS/s.savecore.8
h56963
s 00002/00002/00096
d D 8.1 93/06/05 11:17:35 bostic 13 12
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00002/00000/00096
d D 6.9 93/05/11 13:45:47 torek 12 11
c note that minfree code pretends -z does not exist
e
s 00055/00057/00041
d D 6.8 92/12/03 18:51:49 bostic 11 10
c update the man page, change system operand to -N, add -z
c wordsmithing
e
s 00016/00001/00082
d D 6.7 92/07/10 18:08:53 leres 10 8
c Fix flags.
e
s 00016/00001/00082
d R 6.7 92/07/10 18:05:59 leres 9 8
c Document flag.
e
s 00067/00041/00016
d D 6.6 91/03/16 17:08:52 cael 8 7
c macro and text revision (-mdoc version 3)
e
s 00002/00012/00055
d D 6.5 90/06/24 21:55:12 trent 7 6
c new copyright & pathname (savecore)
e
s 00014/00003/00053
d D 6.4 88/10/31 16:17:34 bostic 6 5
c written by Michael Toy; add Berkeley specific copyright notice
e
s 00008/00007/00048
d D 6.3 86/05/24 22:53:55 karels 5 4
c new logging
e
s 00000/00002/00055
d D 6.2 86/05/12 17:44:55 eric 4 3
c shutdownlog subsumed into syslog
e
s 00004/00004/00053
d D 6.1 85/04/27 13:49:58 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00013/00006/00044
d D 5.1 85/04/27 13:49:39 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00050/00000/00000
d D 4.1 85/04/27 13:49:23 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
D 6
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 6
I 6
D 8
.\" Copyright (c) 1980 The Regents of the University of California.
E 8
I 8
D 13
.\" Copyright (c) 1980, 1991 The Regents of the University of California.
E 8
.\" All rights reserved.
E 13
I 13
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 13
.\"
D 7
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 7
I 7
.\" %sccs.include.redist.man%
E 7
E 6
.\"
D 8
.\"	%W% (Berkeley) %G%
E 8
I 8
.\"     %W% (Berkeley) %G%
E 8
.\"
D 2
.TH SAVECORE 8 4/28/81
E 2
I 2
D 3
.TH SAVECORE 8 4/28/83
E 3
I 3
D 8
.TH SAVECORE 8 "%Q%"
E 3
E 2
.UC 4
.SH NAME
savecore \- save a core dump of the operating system
.SH SYNOPSIS
D 2
.B savecore
E 2
I 2
D 7
.B /etc/savecore
E 7
I 7
.B savecore
E 7
E 2
.I dirname
I 2
[
.I system
]
E 2
.SH DESCRIPTION
D 2
.PP
E 2
.I Savecore
D 2
is meant to be called at the end of the /etc/rc file.  Its function
E 2
I 2
is meant to be called near the end of the /etc/rc file.  Its function
E 8
I 8
.Dd %Q%
.Dt SAVECORE 8
.Os BSD 4
.Sh NAME
.Nm savecore
.Nd "save a core dump of the operating system"
.Sh SYNOPSIS
.Nm savecore
I 10
D 11
.Op Fl fv
E 10
.Ar dirname
.Op Ar system
I 10
.Nm savecore
E 11
.Fl c
I 11
.Nm savecore
.Op Fl fvz
.Op Fl N Ar system
.Ar directory
E 11
E 10
.Sh DESCRIPTION
.Nm Savecore
D 11
is meant to be called near the end of the initialization file
.Pa /etc/rc
(see
.Xr rc 8 ) .
Its function
E 8
E 2
is to save the core dump of the system (assuming one was made) and to
write a reboot message in the shutdown log.
E 11
I 11
copies the currently running kernel and its associated core dump into
.Fa directory ,
and enters a reboot message and information about the core dump into
the system log.
E 11
D 8
.PP
Savecore checks the core dump to be certain it corresponds with the
current running unix.  If it does it saves the core image in the file
.IR dirname /vmcore.n
D 5
and it's brother, the namelist,
E 5
I 5
and its brother, the namelist,
E 5
.IR dirname /vmunix.n
The trailing ".n" in the pathnames is replaced by a number which grows
every time
.I savecore
is run in that directory.
.PP
E 8
I 8
.Pp
I 10
D 11
Options supported by
.Nm savecore :
.Bl -tag -width dirname
E 11
I 11
The options are as follows:
.Bl -tag -width directory
E 11
.It Fl c
D 11
Clears the dump without saving it.
E 11
I 11
Clears the dump, so that future invocations of
.Nm savecore
will ignore it.
E 11
.It Fl f
D 11
Forces a dump to be taken even if the magic number indicates
there isn't a dump.
E 11
I 11
Forces a dump to be taken even if the dump doesn't appear correct or there
is insufficient disk space.
.It Fl N
Use
.Ar system
as the kernel instead of the default ``/vmunix''.
E 11
.It Fl v
D 11
Prints out some extra information.
E 11
I 11
Prints out some additional debugging information.
.It Fl z
Compresses the core dump and kernel (see
.Xr compress 1 ).
E 11
.El
.Pp
E 10
D 11
Operands supported by
.Nm savecore :
D 10
.Bl -tag -width Ar
E 10
I 10
.Bl -tag -width dirname
E 10
.It Ar dirname
The directory name where the core dump will be written.
.It Ar system
If the core dump was from a system other than
.Pa /vmunix ,
the name
of that system must be supplied as
.Ar system .
.El
.Pp
E 11
.Nm Savecore
D 11
checks the core dump to be certain it corresponds with the
current running unix.  If the core dump is current, it saves the core
image in
.Ar dirname Ns Pa /vmcore.n
and the namelist
in
.Ar dirname Ns Pa /vmunix.n
Sequence numbers are incremented and appended to the end of the pathnames
each time
E 11
I 11
checks the core dump in various ways to make sure that it is current and
that it corresponds to the currently running system.
If it passes these checks, it saves the core image in
.Ar directory Ns Pa /vmcore.#
and the system in
.Ar directory Ns Pa /vmunix.#
The ``#'' is the number from the first line of the file
.Ar directory Ns Pa /bounds ,
and it is incremented and stored back into the file each time
E 11
.Nm savecore
D 11
is run in the directory.
E 11
I 11
successfully runs.
E 11
.Pp
E 8
D 11
Before savecore writes out a core image, it reads a number from the file
D 8
.IR dirname /minfree.
E 8
I 8
.Ar dirname Ns Pa /minfree .
E 8
D 3
If there are fewer free blocks on the filesystem
which contains
E 3
I 3
D 5
If the number of free bytes on the filesystem which contains
E 5
I 5
If the number of free kilobytes on the filesystem which contains
E 5
E 3
D 8
.I dirname
E 8
I 8
.Ar dirname
E 8
D 3
than the number obtained from the minfree file, the core dump is not done.
E 3
I 3
D 5
is less than the number obtained from the minfree file times 1024,
the core dump is not done.
E 5
I 5
is less than the number obtained from the minfree file,
the core dump is not saved.
E 5
E 3
If the minfree file does not exist, savecore always writes out the core
file (assuming that a core dump was taken).
E 11
I 11
.Nm Savecore
also checks the available disk space before attempting to make the copies.
If there is insufficient disk space in the filesystem containing
.Ar directory ,
or if the file
.Ar directory Ns Pa /minfree
exists and the number of free kilobytes (for non-superusers) in the
filesystem after the copies were made would be less than the number
in the first line of this file, the copies are not attempted.
E 11
D 8
.PP
.I Savecore
D 5
also writes a reboot message in the shut down log.  If the system crashed
as a result of a panic,
E 5
I 5
also logs a reboot message using facility LOG_AUTH (see
.IR syslog (3))
E 8
I 8
.Pp
I 11
If
.Nm savecore
successfully copies the kernel and the core dump, the core dump is cleared
so that future invocations of
.Nm savecore
will ignore it.
.Pp
E 11
.Nm Savecore
D 11
also logs a reboot message using facility
.Dv LOG_AUTH
E 11
I 11
is meant to be called near the end of the initialization file
.Pa /etc/rc
E 11
(see
D 11
.Xr syslog 3 )
E 8
If the system crashed as a result of a panic,
E 5
D 8
.I savecore
E 8
I 8
.Nm savecore
E 8
D 5
records the panic string in the shut down log too.
E 5
I 5
logs the panic string too.
E 11
I 11
.Xr rc 8 ) .
E 11
E 5
I 2
D 8
.PP
If the core dump was from a system other than /vmunix, the name
of that system must be supplied as
.IR sysname .
E 2
.SH FILES
.DT
D 2
/usr/adm/shutdownlog	Shut down log
E 2
I 2
D 4
/usr/adm/shutdownlog	shut down log
E 2
.br
E 4
D 2
/vmunix			Current UNIX
E 2
I 2
/vmunix		current UNIX
E 2
.SH BUGS
E 8
I 8
.Sh FILES
.Bl -tag -width /vmunixxx -compact
.It Pa /vmunix
current
.Tn UNIX
.El
I 12
.Sh BUGS
The minfree code does not consider the effect of compression.
E 12
D 11
.Sh BUGS
E 8
I 2
Can be fooled into thinking a core dump is the wrong size.
E 11
I 11
.Sh SEE ALSO
.Xr compress 1 ,
.Xr syslogd 8
E 11
I 8
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.1 .
E 8
E 2
E 1
