sbin/reboot/SCCS/s.boot_hp300.8
h26557
s 00001/00001/00090
d D 8.2 94/04/19 15:22:52 mckusick 9 8
c add architecture to Dt field
e
s 00002/00002/00089
d D 8.1 93/06/09 19:05:07 bostic 8 7
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00000/00005/00091
d D 5.6 93/06/09 19:04:47 bostic 7 5
c fix "under development line"
e
s 00002/00002/00094
d R 8.1 93/06/05 11:10:50 bostic 6 5
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00012/00078/00084
d D 5.5 91/10/28 17:44:55 bostic 5 4
c break reboot man page up into machine specific and independent
e
s 00004/00004/00158
d D 5.4 91/07/23 13:48:03 cael 4 3
c Os change
e
s 00002/00002/00160
d D 5.3 91/04/20 11:55:40 cael 3 2
c fixed history
e
s 00099/00086/00063
d D 5.2 91/03/16 17:08:13 cael 2 1
c macro and text revision (-mdoc version 3)
e
s 00149/00000/00000
d D 5.1 90/06/29 20:27:10 bostic 1 0
c date and time created 90/06/29 20:27:10 by bostic
e
u
U
t
T
I 1
D 2
.\" Copyright (c) 1990 The Regents of the University of California.
E 2
I 2
D 8
.\" Copyright (c) 1990, 1991 The Regents of the University of California.
E 2
.\" All rights reserved.
E 8
I 8
.\" Copyright (c) 1990, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 8
.\"
.\" This code is derived from software contributed to Berkeley by
.\" the Systems Programming Group of the University of Utah Computer
D 2
.\" Science Department.
E 2
D 4
.\"
E 4
I 2
.\" Science Department.
E 2
D 4
.\" %sccs.include.redist.man%
E 4
.\"
D 2
.\"	%W% (Berkeley) %G%
E 2
I 2
D 4
.\"     %W% (Berkeley) %G%
E 4
I 4
.\" %sccs.include.redist.roff%
E 4
E 2
.\"
I 4
.\"	%W% (Berkeley) %G%
.\"
E 4
D 2
.TH REBOOT 8 "%Q%"
.UC 7
.SH NAME
reboot \- UNIX bootstrapping procedures
.SH SYNOPSIS
.B reboot
[
.B \-d
] [
.B \-n
] [
.B \-q
] [
.B \-s
]
.SH DESCRIPTION
.PP
UNIX is started by placing it at the beginning of physical memory
E 2
I 2
.Dd %Q%
D 5
.Dt REBOOT 8
E 5
I 5
D 9
.Dt BOOT_HP300 8
E 9
I 9
.Dt BOOT_HP300 8 hp300
E 9
E 5
D 4
.Os BSD 4.4
E 4
I 4
.Os
E 4
.Sh NAME
D 5
.Nm reboot
E 5
I 5
.Nm boot
E 5
.Nd
D 5
.Tn UNIX
bootstrapping procedures
.Sh SYNOPSIS
.Nm reboot
.Op Fl d
.Op Fl n
.Op Fl q
.Op Fl s
E 5
I 5
system bootstrapping procedures
E 5
.Sh DESCRIPTION
D 5
.Tn UNIX
is started by placing it at the beginning of physical memory
E 2
and transferring to the entry point.
Since the system is not reenterable,
it is necessary to read it in from disk or tape
each time it is to be bootstrapped.
D 2
.PP
.B Rebooting a running system.
When a UNIX is running and a reboot is desired,
.IR shutdown (8)
E 2
I 2
.Pp
.Sy Rebooting a running system .
When a
.Tn UNIX
is running and a reboot is desired,
.Xr shutdown 8
E 2
is normally used.
If there are no users then
D 2
.B reboot
E 2
I 2
.Nm reboot
E 2
can be used.
Reboot causes the disks to be synced and allows the system
to perform other shutdown activities such as resynchronizing
hardware time-of-day clocks.
A multi-user reboot (as described below) is then initiated.
This causes a system to be
booted and an automatic disk check to be performed.  If all this succeeds
without incident, the system is then brought up for many users.
D 2
.PP
E 2
I 2
.Pp
E 2
Options to reboot are:
D 2
.TP
.B \-d
option forces a memory dump to the swap area (see
.IR crash (8v))
before rebooting.
This can be used if the system is in a funny state that you would
like to ``snapshot'' and analyze later.
.TP
.B \-n
E 2
I 2
.Bl -tag -width Ds
.\" .It Fl d
.\" option forces a memory dump to the swap area (see
.\" .Xr crash 8 )
.\" before rebooting.
.\" This can be used if the system is in a funny state that you would
.\" like to ``snapshot'' and analyze later.
.It Fl n
E 2
option avoids the sync.  It can be used if a disk or the processor
is on fire. 
D 2
.TP
.B \-q
E 2
I 2
.It Fl q
E 2
reboots quickly and ungracefully, without shutting down running
processes first.
D 2
.TP
.B \-s
option reboots to single user mode.
.PP
.I Reboot
E 2
I 2
.\" .It Fl s
.\" option reboots to single user mode.
.El
.Pp
.Nm Reboot
E 2
normally logs the reboot using
D 2
.IR syslog (8)
E 2
I 2
.Xr syslog 8
E 2
and places a shutdown record in the login accounting file (see
D 2
.IR utmp (5).
E 2
I 2
.Xr utmp 5 .
E 2
These actions are inhibited if the
D 2
.B \-n
E 2
I 2
.Fl n
E 2
or
D 2
.B \-q
E 2
I 2
.Fl q
E 2
options are present.
D 2
.PP
.B "Power fail and crash recovery."
E 2
I 2
.Pp
E 5
.Sy Power fail and crash recovery.
E 2
Normally, the system will reboot itself at power-up or after crashes.
An automatic consistency check of the file systems will be performed,
and unless this fails, the system will resume multi-user operations.
D 2
.PP
.B "Cold starts."
E 2
I 2
.Pp
.Sy Cold starts.
E 2
D 5
On an HP300, the boot procedure uses the boot rom to load a boot program
E 5
I 5
On an HP300, the boot procedure uses the boot ROM to load a boot program
E 5
D 2
from an LIF format directory at the beginning of an attached disk.
The /usr/mdec directory contains a disk boot program ``bootrd''
E 2
I 2
from an
.Tn LIF
format directory at the beginning of an attached disk.
The
.Pa /usr/mdec
D 5
directory contains a disk boot program
.Pa bootrd
E 2
which should be placed in a new pack automatically by
E 5
I 5
directory contains a disk boot programs which should be placed in a
new pack automatically by
E 5
D 2
.IR newfs (8)
E 2
I 2
.Xr newfs 8
E 2
when the ``a'' partition file system on the pack is created.
D 2
.PP
E 2
I 2
.Pp
E 2
This
D 2
.I boot
E 2
I 2
.Em boot
E 2
program
finds the corresponding file on the given device 
D 2
.RI ( vmunix
E 2
I 2
.Pf ( Ar vmunix
E 2
by default),
loads that file into memory,
and starts the program at the entry address specified in the program header.
D 2
.PP
E 2
I 2
.Pp
E 2
The boot program can be interrupted by typing `^C' (ctrl-C).
This will force the boot program to interactively prompt for a system to boot.
If not interrupted, it will boot from the device from which the boot
program itself was loaded.
D 2
.PP
E 2
I 2
.Pp
E 2
The file specifications used for an interactive boot are of the form:
D 2
.IP
device(unit,minor)
.PP
E 2
I 2
.Pp
D 5
.Dl device(unit,minor)
E 5
I 5
.Dl device(unit, minor)
E 5
.Pp
E 2
where
D 2
.I device
E 2
I 2
.Ar device
E 2
is the type of the device to be searched,
D 2
.I unit
E 2
I 2
.Ar unit
E 2
is 8 * the hpib number plus the unit number of the disk or tape,
and
D 2
.I minor
E 2
I 2
.Ar minor
E 2
is the disk partition or tape file number.
Normal line editing characters can be used when typing the file specification.
D 5
Currently, ``rd'' is the only valid
E 5
I 5
Currently, ``rd'' and ``sd'' are the only valid
E 5
D 2
.I device
E 2
I 2
.Ar device
E 2
D 5
specifier.
E 5
I 5
specifiers.
E 5
D 2
.PP
E 2
I 2
.Pp
E 2
For example,
to boot from the `a' file system of unit 0 on HP-IB 2,
D 2
type \*(lqrd(16,0)vmunix\*(rq
E 2
I 2
type
D 5
.Ql rd(16,0)vmunix
E 5
I 5
.Ql rd(16, 0)vmunix
E 5
E 2
to the boot prompt.
For tapes, the minor device number gives a file offset.
D 2
.PP
E 2
I 2
.Pp
E 2
In an emergency, the bootstrap methods described in the paper
D 2
``Installing 4.3bsd on the HP300''
E 2
I 2
.%T Installing 4.3bsd on the HP300
E 2
can be used to boot from a distribution tape.
D 2
.SH FILES
.ta \w'/usr/mdec/installboot   'u
/vmunix	system code
.br
/usr/mdec/bootrd	LIF format boot block
.br
/usr/mdec/installboot	program to install boot blocks
.SH "SEE ALSO"
crash(8V),
fsck(8),
halt(8),
init(8),
newfs(8),
rc(8),
shutdown(8),
syslogd(8)
E 2
I 2
.Sh FILES
.Bl -tag -width /usr/mdec/installboot -compact
.It Pa /vmunix
system code
.It Pa /usr/mdec/bootrd
.Tn LIF
format boot block
.It Pa /usr/mdec/installboot
program to install boot blocks
.El
.Sh SEE ALSO
D 5
.Xr crash 8m ,
.Xr fsck 8 ,
E 5
.Xr halt 8 ,
D 5
.Xr init 8 ,
.Xr newfs 8 ,
.Xr rc 8 ,
.Xr shutdown 8 ,
.Xr syslogd 8
E 5
I 5
.Xr reboot 8 ,
.Xr shutdown 8
E 5
D 7
.Sh HISTORY
The
.Nm
D 3
command
.At
E 3
I 3
command is
.Ud .
E 7
E 3
E 2
E 1
