sbin/reboot/SCCS/s.boot_tahoe.8
h00108
s 00001/00001/00125
d D 8.2 94/04/19 15:22:54 mckusick 10 9
c add architecture to Dt field
e
s 00002/00002/00124
d D 8.1 93/06/09 19:04:15 bostic 9 8
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00000/00004/00126
d D 6.7 93/06/09 19:04:12 bostic 8 6
c fixed the under development line
e
s 00002/00002/00128
d R 8.1 93/06/05 11:10:58 bostic 7 6
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00008/00066/00122
d D 6.6 91/10/28 17:44:57 bostic 6 5
c break reboot man page up into machine specific and independent
e
s 00002/00002/00186
d D 6.5 91/08/05 03:03:41 cael 5 4
c verb fix
e
s 00128/00090/00060
d D 6.4 91/03/16 17:08:17 cael 4 3
c macro and text revision (-mdoc version 3)
e
s 00004/00014/00146
d D 6.3 90/06/24 21:49:25 trent 3 2
c new copyright & pathnames (reboot & wtmp)
e
s 00014/00003/00146
d D 6.2 88/10/29 21:59:05 bostic 2 1
c add Berkeley specific copyright
e
s 00149/00000/00000
d D 6.1 88/07/12 13:52:52 karels 1 0
c cloned from vax version
e
u
U
t
T
I 1
D 2
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 2
I 2
D 4
.\" Copyright (c) 1980 The Regents of the University of California.
E 4
I 4
D 9
.\" Copyright (c) 1980, 1991 The Regents of the University of California.
E 4
.\" All rights reserved.
E 9
I 9
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 9
.\"
D 3
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 3
I 3
.\" %sccs.include.redist.man%
E 3
E 2
.\"
D 4
.\"	%W% (Berkeley) %G%
E 4
I 4
.\"     %W% (Berkeley) %G%
E 4
.\"
D 4
.TH REBOOT 8 "%Q%"
.UC 4
.SH NAME
reboot \- UNIX bootstrapping procedures
.SH SYNOPSIS
D 3
.B /etc/reboot
E 3
I 3
.B reboot
E 3
[
.B \-n
] [
.B \-q
]
.SH DESCRIPTION
.PP
UNIX is started by placing it in memory
E 4
I 4
.Dd %Q%
D 6
.Dt REBOOT 8
.Os BSD 4
E 6
I 6
D 10
.Dt BOOT 8
E 10
I 10
.Dt BOOT 8 tahoe
E 10
.Os
E 6
.Sh NAME
D 6
.Nm reboot
E 6
I 6
.Nm boot
E 6
.Nd
D 6
.Tn UNIX
bootstrapping procedures
.Sh SYNOPSIS
.Nm reboot
.Op Fl n
.Op Fl q
E 6
I 6
system bootstrapping procedures
E 6
.Sh DESCRIPTION
D 6
.Pp
.Tn UNIX
is started by placing it in memory
E 4
at location zero and transferring to the entry point.
Since the system is not reenterable,
it is necessary to read it in from disk or tape
each time it is to be bootstrapped.
D 4
.PP
.B Rebooting a running system.
When a UNIX is running and a reboot is desired,
.IR shutdown (8)
E 4
I 4
.Pp
.Sy Rebooting a running system .
When a
.Tn UNIX
is running and a reboot is desired,
.Xr shutdown 8
E 4
is normally used.
If there are no users then
D 3
.B /etc/reboot
E 3
I 3
D 4
.B reboot
E 4
I 4
.Nm reboot
E 4
E 3
can be used.
Reboot causes the disks to be synced and allows the system
to perform other shutdown activities such as resynchronizing
hardware time-of-day clocks.
A multi-user reboot (as described below) is then initiated.
This causes a system to be
booted and an automatic disk check to be performed.  If all this succeeds
without incident, the system is then brought up for many users.
D 4
.PP
E 4
I 4
.Pp
E 4
Options to reboot are:
D 4
.TP
.B \-n
E 4
I 4
.Bl -tag -width Ds
.It Fl n
E 4
option avoids the sync.  It can be used if a disk or the processor
is on fire. 
D 4
.TP
.B \-q
E 4
I 4
.It Fl q
E 4
reboots quickly and ungracefully, without shutting down running
processes first.
D 4
.PP
.I Reboot
E 4
I 4
.El
.Pp
.Nm Reboot
E 4
normally logs the reboot using
D 4
.IR syslog (8)
E 4
I 4
.Xr syslog 8
E 4
and places a shutdown record in the login accounting file
D 3
/usr/adm/wtmp.
E 3
I 3
D 4
/var/log/wtmp.
E 4
I 4
.Pa /var/log/wtmp.
E 4
E 3
These actions are inhibited if the
D 4
.B \-n
E 4
I 4
.Fl n
E 4
or
D 4
.B \-q
E 4
I 4
.Fl q
E 4
options are present.
D 4
.PP
.B "Power fail and crash recovery."
E 4
I 4
.Pp
E 6
.Sy Power fail and crash recovery.
E 4
Normally, the system will reboot itself at power-up or after crashes.
D 6
An automatic consistency check of the file systems will be performed
as described in
D 4
.IR fsck (8).
E 4
I 4
.Xr fsck 8 .
E 6
I 6
An automatic consistency check of the file systems will be performed,
E 6
E 4
and unless this fails, the system will resume multi-user operations.
D 4
.PP
.B Cold starts.
E 4
I 4
.Pp
D 6
.Sy Cold starts .
E 6
I 6
.Sy Cold starts.
E 6
E 4
These are processor-type dependent.
D 4
On the CCI Power 6/32 and related processors,
E 4
I 4
On the
.Tn CCI
Power 6/32 and related processors,
E 4
the system will do a standard autoboot from drive 0
upon power-up or reset.
D 4
This automatic boot may be cancelled by typing a \*(lq#\*(rq
E 4
I 4
This automatic boot may be cancelled by typing a
.Ql \&#
E 4
in the first few seconds after reset.
D 4
This enters console mode; the console prompt is \*(lq>\*(rq or \*(lq#>\*(rq.
The boot flags can be set to any hexadecimal value \fIn\fP with the command
.IP
#> p23 \fIn\fP.
.LP
E 4
I 4
This enters console mode; the console prompt is
.Ql >
or
.Ql \&# .
The boot flags can be set to any hexadecimal value
.Fl n
with the command
.Pp
.Bd -filled -offset indent -compact
.Li \&#> p23
.Ar n .
.Ed
.Pp
E 4
The default device may be examined or set; see the Diagnostics and Debugging
manual for the processor for details on device naming and syntax.
After setting the boot flags and/or device,
a bootstrap sequence can be initiated with
D 4
.IP
#> fb
.LP
E 4
I 4
.Pp
.Dl #> fb
.Pp
E 4
A specific device or bootstrap file may be used; for example,
D 4
.IP
#> fb xfd(1,0)
.LP
would boot from the `a' partition on XFD drive 1.
.PP
E 4
I 4
.Pp
.Dl \&#> \&fb xfd(1,0)
.Pp
would boot from the `a' partition on
.Tn XFD
drive 1.
.Pp
E 4
The file specifications used for the boostrap
D 4
when loaded with the \*(lqaskme\*(rq flag
E 4
I 4
when loaded with the
.Dq askme
flag
E 4
(register 23 set to 1 or 3)
are of the form:
D 4
.IP
device(adaptor,controller,unit,minor)
.PP
E 4
I 4
.Pp
.Dl device(adaptor,controller,unit,minor)
.Pp
E 4
where
D 4
.I device
E 4
I 4
.Ar device
E 4
is the type of the device to be searched,
D 4
.I adaptor
is number of the VERSAbus (or VMEbus) to which the device is attached,
.I controller
E 4
I 4
.Ar adaptor
is number of the
.Tn VERSAbus
(or
.Tn VMEbus )
to which the device is attached,
.Ar controller
E 4
is the unit number of the controller on that buss,
D 4
.I unit
E 4
I 4
.Ar unit
E 4
is the unit number of the disk or tape,
and
D 4
.I minor
E 4
I 4
.Ar minor
E 4
is the disk partition or tape file number.
Leading adaptor or controller numbers default to 0.
Normal line editing characters can be used when typing the file specification.
The following list of supported devices may vary from installation to
installation:
D 4
.LP
.ta 5 10
.nf
	dk	SMD or ESDI disks on VDDC or SMD-E
	cy	tape on Ciprico Tapemaster controller
.fi
.PP
E 4
I 4
.Pp
.Bd -unfilled -offset indent -compact
dk	SMD or ESDI disks on VDDC or SMD-E
cy	tape on Ciprico Tapemaster controller
.Ed
.Pp
E 4
For example,
to boot from a file system which starts at cylinder 0
D 4
of unit 0 of an SMD-E disk, type \*(lqdk(0,0)vmunix\*(rq
to the boot prompt; \*(lqdk(2,1,0)vmunix\*(rq
would specify drive 1 on SMD-E controller 2.
.PP
E 4
I 4
of unit 0 of an
.Tn SMD-E
disk, type
.Ql dk(0,0)vmunix
to the boot prompt;
.Ql dk(2,1,0)vmunix
would specify drive 1 on
.Tn SMD-E
controller 2.
.Pp
E 4
In an emergency, the bootstrap methods described in the paper
D 4
``Installing and Operating 4.3BSD-tahoe UNIX on the Tahoe'' can be used
E 4
I 4
.%T "Installing and Operating 4.3 BSD-tahoe UNIX on the Tahoe"
can be used
E 4
to boot from a distribution tape.
D 4
.SH FILES
.ta \w'/vmunix   'u
/vmunix	system code
.br
/boot	system bootstrap
.SH "SEE ALSO"
crash(8),
disklabel(8),
fsck(8),
halt(8),
init(8),
rc(8),
shutdown(8),
syslogd(8)
.SH BUGS
E 4
I 4
.Sh FILES
.Bl -tag -width /vmunix -compact
.It Pa /vmunix
system code
.It Pa /boot
system bootstrap
.El
.Sh SEE ALSO
D 6
.Xr crash 8 ,
.Xr disklabel 8 ,
.Xr fsck 8 ,
E 6
.Xr halt 8 ,
D 6
.Xr init 8 ,
.Xr rc 8 ,
.Xr shutdown 8 ,
.Xr syslogd 8
E 6
I 6
.Xr reboot 8 ,
.Xr shutdown 8
E 6
.Sh BUGS
E 4
The disklabel format used by some versions of the console processor
D 4
is different than the format used by UNIX and the bootstrap.
E 4
I 4
is different than the format used by
.Tn UNIX
and the bootstrap.
.Sh HISTORY
D 8
The
.Nm
D 5
command
.Ud
E 5
I 5
command is
.Ud .
E 8
E 5
E 4
E 1
