usr.bin/uucp/uusnap/SCCS/s.uusnap.8
h28405
s 00002/00002/00052
d D 8.1 93/06/06 22:15:03 bostic 6 5
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00046/00024/00008
d D 6.4 91/03/16 18:11:15 cael 5 4
c macro and text revision (-mdoc version 3)
e
s 00002/00002/00030
d D 6.3 88/10/24 12:00:11 bostic 4 3
c remove refs to [18]C, add copyright if needed
e
s 00007/00007/00025
d D 6.2 86/04/24 22:23:10 mckusick 3 2
c update from rfg
e
s 00001/00001/00031
d D 6.1 85/04/27 16:01:22 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00032/00000/00000
d D 5.1 85/04/27 16:01:13 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
D 5
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 5
I 5
D 6
.\" Copyright (c) 1983, 1991 Regents of the University of California.
.\" All rights reserved.
E 6
I 6
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 6
E 5
.\"
D 5
.\"	%W% (Berkeley) %G%
E 5
I 5
.\" %sccs.include.redist.man%
E 5
.\"
D 2
.TH UUSNAP 8C "7 July 1983"
E 2
I 2
D 4
.TH UUSNAP 8C "%Q%"
E 4
I 4
D 5
.TH UUSNAP 8 "%Q%"
E 4
E 2
.UC 5
.SH NAME
uusnap \- show snapshot of the UUCP system
.SH SYNOPSIS
.B uusnap
.SH DESCRIPTION
D 3
Uusnap displays in tabular format a synopsis of the current UUCP
E 3
I 3
.I Uusnap
displays in tabular format a synopsis of the current UUCP
E 5
I 5
.\"     %W% (Berkeley) %G%
.\"
.Dd %Q%
.Dt UUSNAP 8
.Os BSD 4.2
.Sh NAME
.Nm uusnap
.Nd show snapshot of the
.Tn UUCP
system
.Sh SYNOPSIS
.Nm uusnap
.Sh DESCRIPTION
.Nm Uusnap
displays in tabular format a synopsis of the current
.Tn UUCP
E 5
E 3
situation.  The format of each line is as follows:
D 5
.PP
.ti +10
E 5
I 5
.Bd -literal -offset indent -compact

E 5
site   N Cmds   N Data   N Xqts   Message
D 5
.PP
E 5
I 5

.Ed
E 5
Where "site" is the name of the site with work, "N" is a count of
each of the three possible types of work (command, data, or remote execute),
and "Message" is the current status message for that
D 5
site as found in the STST file.
.PP
Included in "Message" may be the time left before UUCP can re-try the
D 3
call, and the count of the number of times that UUCP has tried to
reach the site.
E 3
I 3
call, and the count of the number of times that UUCP has tried
E 5
I 5
site as found in the
.Tn STST
file.
.Pp
Included in "Message" may be the time left before
.Tn UUCP
can re-try the
call, and the count of the number of times that
.Tn UUCP
has tried
E 5
(unsuccessfully) to reach the site.
E 3
D 5
.SH SEE ALSO
D 3
uucp(1C),
UUCP Implementation Guide
.SH AUTHOR
Randy King
E 3
I 3
D 4
uucp(1C), uux(1C), uuq(1C), uucico(8C)
E 4
I 4
uucp(1), uux(1), uuq(1), uucico(8)
E 4
.br
.I "UUCP Implementation Guide"
E 5
I 5
.Sh SEE ALSO
.Xr uucp 1 ,
.Xr uux 1 ,
.Xr uuq 1 ,
.Xr uucico 8
.Rs
.%T "UUCP Implementation Guide"
.Re
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.2 .
E 5
E 3
E 1
