usr.bin/systat/SCCS/s.systat.1
h34728
s 00004/00004/00393
d D 8.2 93/12/30 15:39:22 mckusick 17 16
c copyediting for Usenix manuals
e
s 00002/00002/00395
d D 8.1 93/07/01 14:38:50 bostic 16 15
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00015/00020/00382
d D 6.12 93/07/01 14:36:10 mckusick 15 13
c update swap display description
e
s 00002/00002/00400
d R 8.1 93/06/06 16:29:41 bostic 14 13
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00091/00101/00311
d D 6.11 91/07/29 23:33:35 cael 13 12
c mdoc version three
e
s 00002/00000/00410
d D 6.10 91/03/14 00:27:48 cael 12 10
c add .Vx so tmac.andoc will call tmac.mdoc-old
e
s 00001/00000/00410
d R 6.10 91/03/13 20:38:11 cael 11 10
c add .Vx so tmac.andoc will call tmac.mdoc-old
e
s 00000/00000/00410
d D 6.9 90/07/24 22:52:02 cael 10 9
c .Xr botch fix
e
s 00001/00001/00409
d D 6.8 90/07/24 22:40:57 cael 9 8
c .Xr botch fix
e
s 00217/00172/00193
d D 6.7 90/06/11 06:00:43 cael 8 7
c converted man page
e
s 00002/00001/00363
d D 6.6 87/10/03 13:57:42 karels 7 6
c show software interrupts
e
s 00001/00001/00363
d D 6.5 86/05/12 09:17:22 anne 6 5
c grammar
e
s 00014/00013/00350
d D 6.4 86/05/11 04:39:27 lepreau 5 3
c typos spelling and grammar
e
s 00001/00001/00362
d R 6.4 85/05/04 00:29:20 sam 4 3
c move to %Q%
e
s 00060/00040/00303
d D 6.3 85/05/02 00:18:34 sam 3 2
c correct manual page to reflect current code
e
s 00096/00000/00247
d D 6.2 85/04/29 22:02:14 mckusick 2 1
c elaborate on what is shown in the "vmstat" display
e
s 00247/00000/00000
d D 6.1 85/04/29 21:49:29 mckusick 1 0
c manual page first distributed with 4.3BSD
e
u
U
t
T
I 1
D 8
.\" Copyright (c) 1985 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 8
I 8
D 16
.\" Copyright (c) 1985, 1990 The Regents of the University of California.
.\" All rights reserved.
E 16
I 16
.\" Copyright (c) 1985, 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 16
E 8
.\"
D 8
.\"	%W% (Berkeley) %G%
E 8
I 8
D 13
.\" %sccs.include.redist.man%
E 13
I 13
.\" %sccs.include.redist.roff%
E 13
E 8
.\"
D 8
.TH SYSTAT 1 "%Q%"
.UC 6
.SH NAME
systat \- display system statistics on a crt
.SH SYNOPSIS
.B systat
[
.RI \- display
] [
refresh-interval
]
.SH DESCRIPTION
.B Systat
E 8
I 8
D 13
.\"     %W% (Berkeley) %G%
E 13
I 13
.\"	%W% (Berkeley) %G%
E 13
.\"
I 12
D 13
.Vx
.Vx
E 13
E 12
.Dd %Q%
.Dt SYSTAT 1
.Os BSD 4.3
.Sh NAME
.Nm systat
.Nd display system statistics on a crt
.Sh SYNOPSIS
.Nm systat
.Op Fl display
.Op Ar refresh-interval
.Sh DESCRIPTION
.Nm Systat
E 8
displays various system statistics in a screen oriented fashion
D 8
using the curses screen display library, 
.IR curses (3X).
.PP
E 8
I 8
using the curses screen display library,
D 9
.Xr curses  (3X ) .
E 9
I 9
.Xr curses 3 .
E 9
.Pp
E 8
While
D 8
.I systat
E 8
I 8
.Nm systat
E 8
is running the screen is usually divided into two windows (an exception
is the vmstat display which uses the entire screen).  The
upper window depicts the current system load average.  The
information displayed in the lower window may vary, depending on
user commands.  The last line on the screen is reserved for user
input and error messages.
D 8
.PP
E 8
I 8
.Pp
E 8
By default
D 8
.I systat
E 8
I 8
.Nm systat
E 8
displays the processes getting the largest percentage of the processor
D 13
in the lower window.  Other displays show swap space usage, disk i/o
E 13
I 13
in the lower window.  Other displays show swap space usage, disk
.Tn I/O
E 13
statistics (a la
D 8
.IR iostat (1)),
E 8
I 8
.Xr iostat  1  ) ,
E 8
virtual memory statistics (a la
D 8
.IR vmstat (1)),
E 8
I 8
.Xr vmstat  1  ) ,
E 8
network ``mbuf'' utilization, and network connections (a la
D 8
.IR netstat (1)).
.PP
Input is interpreted at two different levels. 
E 8
I 8
.Xr netstat  1  ) .
.Pp
Input is interpreted at two different levels.
E 8
A ``global'' command interpreter processes all keyboard input.
If this command interpreter fails to recognize a command, the
input line is passed to a per-display command interpreter.  This
allows each display to have certain display-specific commands.
D 8
.PP
Certain characters cause immediate action by 
.IR systat .
E 8
I 8
.Pp
Command line options:
D 13
.Pp
.Tw refresh_interval
.Tp Cx Fl
.Ar display
.Cx
E 13
I 13
.Bl -tag -width "refresh_interval"
.It Fl Ns Ar display
E 13
The
.Fl
flag expects
.Ar display
to be one of:
.Ic pigs ,
.Ic iostat ,
.Ic swap ,
.Ic mbufs ,
.Ic vmstat
or
.Ic netstat .
These displays can also be requested interactively (without the
.Dq Fl )
and are described in
full detail below.
D 13
.Tp Ar refresh-interval
E 13
I 13
.It Ar refresh-interval
E 13
The
.Ar refresh-value
specifies the screen refresh time interval in seconds.
D 13
.Tp
E 13
I 13
.El
E 13
.Pp
Certain characters cause immediate action by
.Nm systat  .
E 8
These are
D 8
.IP ^L
E 8
I 8
D 13
.Tw Fl
.Tp Ic \&^L
E 13
I 13
.Bl -tag -width Fl
.It Ic \&^L
E 13
E 8
Refresh the screen.
D 8
.IP ^G
E 8
I 8
D 13
.Tp Ic \&^G
E 13
I 13
.It Ic \&^G
E 13
E 8
Print the name of the current ``display'' being shown in
the lower window and the refresh interval.
D 8
.IP ^Z
Stop 
.IR systat .
.IP :
E 8
I 8
D 13
.Tp Ic \&^Z
E 13
I 13
.It Ic \&^Z
E 13
Stop
.Nm systat  .
D 13
.Tp Ic \&:
E 13
I 13
.It Ic \&:
E 13
E 8
Move the cursor to the command line and interpret the input
line typed as a command.  While entering a command the
current character erase, word erase, and line kill characters
may be used.
I 13
.El
E 13
D 8
.PP
E 8
I 8
.Pp
E 8
The following commands are interpreted by the ``global''
command interpreter.
D 8
.IP help
.br
E 8
I 8
D 13
.Tp Ic \&help
E 13
I 13
.Bl -tag -width Fl
.It Ic help
E 13
E 8
Print the names of the available displays on the command line.
D 8
.IP load
.br
E 8
I 8
D 13
.Tp Ic \&load
E 13
I 13
.It Ic load
E 13
E 8
Print the load average over the past 1, 5, and 15 minutes
on the command line.
D 8
.IP stop
.br
E 8
I 8
D 13
.Tp Ic \&stop
E 13
I 13
.It Ic stop
E 13
E 8
Stop refreshing the screen.
D 8
.IP "[ start ] [ number ]"
.br
E 8
I 8
D 13
.Tp Cx Op Ic start
.Cx \&\ \&
E 13
I 13
.It Xo
.Op Ic start
E 13
.Op Ar number
D 13
.Cx
E 13
I 13
.Xc
E 13
E 8
Start (continue) refreshing the screen.  If a second, numeric,
argument is provided it is interpreted as a refresh interval
(in seconds).
Supplying only a number will set the refresh interval to this
value.
D 8
.IP "quit"
.br
Exit 
.IR systat .
E 8
I 8
D 13
.Tp Ic \&quit
E 13
I 13
.It Ic quit
E 13
Exit
.Nm systat  .
E 8
(This may be abbreviated to
D 6
.IR q ).
E 6
I 6
D 8
.IR q .)
E 6
.PP
E 8
I 8
.Ic q  . )
D 13
.Tp
E 13
I 13
.El
E 13
.Pp
E 8
The available displays are:
D 8
.IP pigs
.br
E 8
I 8
D 13
.Tw Ic
.Tp Ic pigs
E 13
I 13
.Bl -tag -width Ic
.It Ic pigs
E 13
E 8
Display, in the lower window, those processes resident in main
memory and getting the
D 8
largest portion of the processor (the default display). 
E 8
I 8
largest portion of the processor (the default display).
E 8
When less than 100% of the
processor is scheduled to user processes, the remaining time
is accounted to the ``idle'' process.
D 8
.IP iostat
.br
E 8
I 8
D 13
.Tp Ic iostat
E 13
I 13
.It Ic iostat
E 13
E 8
Display, in the lower window, statistics about processor use
and disk throughput.  Statistics on processor use appear as
bar graphs of the amount of time executing in user mode (``user''),
D 8
in user mode running low priority processes (``nice''), in 
E 8
I 8
in user mode running low priority processes (``nice''), in
E 8
system mode (``system''), and idle (``idle'').  Statistics
on disk throughput show, for each drive, kilobytes of data transferred,
D 5
number disk transaction performed, and average seek time
E 5
I 5
number of disk transactions performed, and average seek time
E 5
(in milliseconds).  This information may be displayed as
bar graphs or as rows of numbers which scroll downward.  Bar
D 8
graphs are shown by default; commands specific to this display  
are discussed below.
.IP swap
.br
E 8
I 8
D 13
graphs are shown by default; 
E 13
I 13
graphs are shown by default;
E 13
.Pp
The following commands are specific to the
.Ic iostat
display; the minimum unambiguous prefix may be supplied.
D 13
.Dw Fl
.Dp Cm numbers
Show the disk i/o statistics in numeric form.  Values are
E 13
I 13
.Pp
.Bl -tag -width Fl -compact
.It Cm numbers
Show the disk
D 17
.Tn I/O statistics in numeric form.  Values are
E 17
I 17
.Tn I/O 
statistics in numeric form.  Values are
E 17
E 13
displayed in numeric columns which scroll downward.
D 13
.Dp Cm bars
Show the disk i/o statistics in bar graph form (default).
.Dp Cm msps
E 13
I 13
.It Cm bars
Show the disk
.Tn I/O
statistics in bar graph form (default).
.It Cm msps
E 13
Toggle the display of average seek time (the default is to
not display seek times).
D 13
.Dp
.Pp
.Tp Ic swap
E 13
I 13
.El
.It Ic swap
E 13
E 8
D 15
Display, in the lower window, swap space in use on each swap
device configured.  Two sets of bar graphs are shown.  The
upper graph displays swap space allocated to pure text segments
(code), the lower graph displays space allocated to stack and
data segments.  Allocated space is sorted by its size into buckets
of size dmmin, dmmin*2, dmmin*4, up to dmmax (to reflect allocation
policies imposed by the system).  The disk segment size, in sectors,
is displayed along the left hand side of the text,
and data and stack graphs.
Space allocated to the user structure and page
tables is not currently accounted for.
E 15
I 15
Show information about swap space usage on all the 
swap areas compiled into the kernel.
The first column is the device name of the partition.
The next column is the total space available in the partition.
The 
.Ar Used
column indicates the total blocks used so far;
the graph shows the percentage of space in use on each partition.
If there are more than one swap partition in use,
a total line is also shown.
Areas known to the kernel, but not in use are shown as not available.
E 15
D 8
.IP mbufs
.br
E 8
I 8
D 13
.Tp Ic mbufs
E 13
I 13
.It Ic mbufs
E 13
E 8
Display, in the lower window, the number of mbufs allocated
for particular uses, i.e. data, socket structures, etc.
D 8
.IP vmstat
.br
E 8
I 8
D 13
.Tp Ic vmstat
E 13
I 13
.It Ic vmstat
E 13
E 8
Take over the entire display and show a (rather crowded) compendium
of statistics related to virtual memory usage, process scheduling,
D 13
device interrupts, system name translation cacheing, disk i/o, etc.
E 13
I 13
device interrupts, system name translation cacheing, disk
.Tn I/O
etc.
E 13
I 2
D 3
.PP
E 3
I 3
D 8
.IP
E 8
I 8
.Pp
E 8
E 3
The upper left quadrant of the screen shows the number
of users logged in and the load average over the last one, five,
D 5
and fifteen minute interval.
E 5
I 5
and fifteen minute intervals.
E 5
Below this line are statistics on memory utilization.
The first row of the table reports memory usage only among
D 5
active process, that is process that have run in the previous 
E 5
I 5
D 8
active processes, that is processes that have run in the previous 
E 8
I 8
active processes, that is processes that have run in the previous
E 8
E 5
twenty seconds.
The second row reports on memory usage of all processes.
The first column reports on the number of physical pages
claimed by processes.
The second column reports the number of physical pages that
are devoted to read only text pages.
The third and fourth columns report the same two figures for
virtual pages, that is the number of pages that would be
needed if all processes had all of their pages.
Finally the last column shows the number of physical pages
on the free list.
D 3
.PP
E 3
I 3
D 8
.IP
E 8
I 8
.Pp
E 8
E 3
Below the memory display is the disk usage display.
It reports the number of seeks, transfers, and number
of kilobyte blocks transferred per second averaged over the
refresh period of the display (by default, five seconds).
D 5
For some disks it also reports the average millisecond per seek.
E 5
I 5
For some disks it also reports the average milliseconds per seek.
E 5
Note that the system only keeps statistics on at most four disks.
D 3
.PP
E 3
I 3
D 8
.IP
E 8
I 8
.Pp
E 8
E 3
Below the disk display is a list of the
average number of processes (over the last refresh interval)
D 5
that are runable (`r'), in page wait (`p'),
E 5
I 5
that are runnable (`r'), in page wait (`p'),
E 5
in disk wait other than paging (`d'),
sleeping (`s'), and swapped out but desiring to run (`w').
Below the queue length listing is a numerical listing and
a bar graph showing the amount of
system (shown as `='), user (shown as `>'),
nice (shown as `-'), and idle time (shown as ` ').
D 3
.PP
E 3
I 3
D 8
.IP
E 8
I 8
.Pp
E 8
E 3
At the bottom left are statistics on name translations.
D 5
It lists the number names translated in the previous interval,
E 5
I 5
It lists the number of names translated in the previous interval,
E 5
the number and percentage of the translations that were
handled by the system wide name translation cache, and
the number and percentage of the translations that were
handled by the per process name translation cache.
D 3
.PP
E 3
I 3
D 8
.IP
E 8
I 8
.Pp
E 8
E 3
Under the date in the upper right hand quadrant are statistics
on paging and swapping activity.
The first two columns report the average number of pages
brought in and out per second over the last refresh interval
due to page faults and the paging daemon.
The third and fourth columns report the average number of pages
brought in and out per second over the last refresh interval
due to swap requests initiated by the scheduler.
The first row of the display shows the average
number of disk transfers per second over the last refresh interval;
the second row of the display shows the average
number of pages transferred per second over the last refresh interval.
D 3
.PP
E 3
I 3
D 8
.IP
E 8
I 8
.Pp
E 8
E 3
Below the paging statistics is a line listing the average number of
total reclaims ('Rec'),
intransit blocking page faults (`It'),
swap text pages found in free list (`F/S'),
file system text pages found in free list (`F/F'),
D 13
reclaims from free list (`RFL'),
E 13
I 13
reclaims from free list
D 17
.Pp Sq RFL ,
E 17
E 13
pages freed by the clock daemon (`Fre'),
D 8
and sequential process pages freed (`SFr') 
E 8
I 8
and sequential process pages freed (`SFr')
E 8
per second over the refresh interval.
D 3
.PP
E 3
I 3
D 8
.IP
E 8
I 8
.Pp
E 8
E 3
Below this line are statistics on the average number of
zero filled pages (`zf') and demand filled text pages (`xf')
per second over the refresh period.
The first row indicates the number of requests that were
resolved, the second row shows the number that were set up,
D 17
and the last row shows the percentage of setup requests were
E 17
I 17
and the last row shows the percentage of setup requests that were
E 17
actually used.
Note that this percentage is usually less than 100%,
however it may exceed 100% if a large number of requests
are actually used long after they were set up during a
D 8
period when no new pages are being set up. 
E 8
I 8
period when no new pages are being set up.
E 8
Thus this figure is most interesting when observed over
a long time period, such as from boot time
(see below on getting such a display).
D 3
.PP
E 3
I 3
D 8
.IP
E 8
I 8
.Pp
E 8
E 3
Below the page fill statistics is a column that
lists the average number of context switches (`Csw'),
D 7
traps (`Trp'), system calls (`Sys'), interrupts (`Int'),
E 7
I 7
traps (`Trp'; includes page faults), system calls (`Sys'), interrupts (`Int'),
E 7
D 13
characters output to DZ ports using pseudo-DMA (`Pdm'),
E 13
I 13
characters output to DZ ports using
.No pseudo Ns -DMA
(`Pdm'),
E 13
I 7
network software interrupts (`Sof'),
E 7
page faults (`Flt'), pages scanned by the page daemon (`Scn'),
and revolutions of the page daemon's hand (`Rev')
per second over the refresh interval.
D 3
.PP
E 3
I 3
D 8
.IP
E 8
I 8
.Pp
E 8
E 3
Running down the right hand side of the display is a breakdown
of the interrupts being handled by the system.
At the top of the list is the total interrupts per second
over the time interval.
The rest of the column breaks down the total on a device
D 8
by device basis. 
E 8
I 8
by device basis.
E 8
Only devices that have interrupted at least once since boot time are shown.
E 2
D 8
.IP netstat
.br
Display, in the lower window, network connections.  By default,
network servers awaiting requests are not displayed.  Each address
is displayed in the format ``host.port'', with each shown symbolically,
when possible.  It is possible to have addresses displayed numerically,
limit the display to a set of ports, hosts, and/or protocols; see the
D 3
list commands below.
E 3
I 3
list of commands below.
E 3
.PP
Commands to switch between displays may be abbreviated to the
minimum unambiguous prefix; for example, ``io'' for ``iostat''.
Certain information may be discarded when the screen size is
insufficient for display.  For example, on a machine with 10
drives the 
.I iostat
bar graph displays only 3 drives on a 24 line terminal.  When
a bar graph would overflow the allotted screen space it is
truncated and the actual value is printed ``over top'' of the bar.
.PP
The following commands are specific to the 
.I iostat
display; the minimum unambiguous prefix may be supplied.
.IP numbers
Show the disk i/o statistics in numeric form.  Values are
displayed in numeric columns which scroll downward.
.IP bars
Show the disk i/o statistics in bar graph form (default).
.IP msps
Toggle the display of average seek time (the default is to
not display seek times).
D 3
.IP "ignore [ drives ]"
Do not display information about the drives indicated.  Multiple
drives may be specified, separated by spaces.
.IP "display [ drives ]"
Display information about the drives indicated.  Multiple drives
may be specified, separated by spaces.
E 3
.PP
E 8
I 8
.Pp
E 8
The following commands are specific to the
D 8
.I vmstat
E 8
I 8
.Ic vmstat
E 8
display; the minimum unambiguous prefix may be supplied.
D 8
.IP boot
E 8
I 8
D 13
.Dp Cm boot
E 13
I 13
.Pp
.Bl -tag -width Ar -compact
.It Cm boot
E 13
E 8
D 5
Display cummulative statistics since the system was booted.
E 5
I 5
Display cumulative statistics since the system was booted.
E 5
D 8
.IP run
E 8
I 8
D 13
.Dp Cm run
E 13
I 13
.It Cm run
E 13
E 8
Display statistics as a running total from the point this
command is given.
D 8
.IP time
E 8
I 8
D 13
.Dp Cm time
E 13
I 13
.It Cm time
E 13
E 8
Display statistics averaged over the refresh interval (the default).
D 8
.IP zero
E 8
I 8
D 13
.Dp Cm zero
E 13
I 13
.It Cm zero
E 13
E 8
Reset running statistics to zero.
D 8
.PP
D 3
The following commands are specific to the
E 3
I 3
The following commands are common to each display which shows
information about disk drives.  These commands are used to
select a set of drives to report on, should your system have
more drives configured than can normally be displayed on the
screen.
.IP "ignore [ drives ]"
Do not display information about the drives indicated.  Multiple
drives may be specified, separated by spaces.
.IP "display [ drives ]"
Display information about the drives indicated.  Multiple drives
may be specified, separated by spaces.
.PP
The following command is specific to the
E 3
.I netstat
display; the minimum unambiguous prefix may be supplied.
.IP all
E 8
I 8
D 13
.Dp
.Tp Ic netstat
E 13
I 13
.El
.It Ic netstat
E 13
Display, in the lower window, network connections.  By default,
network servers awaiting requests are not displayed.  Each address
is displayed in the format ``host.port'', with each shown symbolically,
when possible.  It is possible to have addresses displayed numerically,
limit the display to a set of ports, hosts, and/or protocols
(the minimum unambiguous prefix may be supplied):
.Pp
D 13
.Dw Ar
.Dp Cm all
E 13
I 13
.Bl -tag -width Ar -compact
.It Cm all
E 13
E 8
Toggle the displaying of server processes awaiting requests (this
D 8
is the equivalent of the 
.B \-a
E 8
I 8
is the equivalent of the
.Fl a
E 8
flag to
D 8
.IR netstat (1)).
.IP numbers
E 8
I 8
.Ar netstat  1  ) .
D 13
.Dp Cm numbers
E 13
I 13
.It Cm numbers
E 13
E 8
Display network addresses numerically.
D 8
.IP names
E 8
I 8
D 13
.Dp Cm names
E 13
I 13
.It Cm names
E 13
E 8
Display network addresses symbolically.
D 3
.IP "port name"
Limit the display to connections on the specified port (the port
is matched against the port both on the local and the foreign side
of a connection).  A port
.I name
may be specified symbolically, e.g. ``ftp'', or numerically (base 10).
This command may be specified many times to create a set of ports
for matching.
.IP "host name"
Limit the display to connections to or from the specified host.  A
host
.I name
may be specified symbolically or numerically in the Internet dot
notation.  This command may be specified many times to create a set
of hosts for matching.
.IP "protocol name"
Limit the display to connections using the specified protocol (currently
``tcp'' or ``udp'').  The commands
.I tcp
and
.I udp
are shorthands for ``protocol tcp'' and ``protocol udp'', respectively.
E 3
I 3
D 8
.PP
The remaining commands are common to displays which report
network connections (currently only the
.I netstat
display).   These commands may be used to select a specific set
of connections for
.I systat
to report on.
.IP "\fIprotocol\fP"
E 8
I 8
D 13
.Dp Ar protocol
E 13
I 13
.It Ar protocol
E 13
E 8
Display only network connections using the indicated protocol
(currently either ``tcp'' or ``udp'').
D 8
.IP "ignore [items]"
E 8
I 8
D 13
.Dp Cx Cm ignore
.Cx \&\ \&
.Op Ar items
.Cx
E 13
I 13
.It Cm ignore Op Ar items
E 13
E 8
Do not display information about connections associated with
the specified hosts or ports.  Hosts and ports may be specified
D 15
by name (``ucbmonet'', ``ftp''), or numerically.  Host addresses
E 15
I 15
by name (``vangogh'', ``ftp''), or numerically.  Host addresses
E 15
use the Internet dot notation (``128.32.0.9'').  Multiple items
may be specified with a single command by separating them with
spaces.
D 8
.IP "display [items]"
E 8
I 8
D 13
.Dp Cx Cm display
.Cx \&\ \&
.Op Ar items
.Cx
E 13
I 13
.It Cm display Op Ar items
E 13
E 8
Display information about the connections associated with the
D 8
specified hosts or ports.  As for 
.IR ignore ,
D 5
items may be names or numbers.
E 5
I 5
.I items
E 8
I 8
specified hosts or ports.  As for
.Ar ignore  ,
.Op Ar items
E 8
may be names or numbers.
E 5
D 8
.IP "show [ports|hosts]"
E 8
I 8
D 13
.Dp Cx Cm show
.Cx \&\ \&
.Op Ar ports\&|hosts
.Cx
E 13
I 13
.It Cm show Op Ar ports\&|hosts
E 13
E 8
Show, on the command line, the currently selected protocols,
hosts, and ports.  Hosts and ports which are being ignored
are prefixed with a `!'.  If
D 8
.I ports
E 8
I 8
.Ar ports
E 8
or
D 8
.I hosts
D 5
are supplied as an argument to 
E 5
I 5
is supplied as an argument to 
E 5
.IR show ,
E 8
I 8
.Ar hosts
is supplied as an argument to
.Cm show  ,
E 8
D 5
then only the request information will be displayed.
E 5
I 5
then only the requested information will be displayed.
E 5
E 3
D 8
.IP "reset"
E 8
I 8
D 13
.Dp Cm reset
E 13
I 13
.It Cm reset
E 13
E 8
Reset the port, host, and protocol matching mechanisms to the default
(any protocol, port, or host).
D 8
.SH FILES
.nf
.ta \w'/dev/services   'u
/vmunix	for the namelist
/dev/kmem	for information in main memory
/dev/drum	for information about swapped out processes
/etc/hosts	for host names
/etc/networks	for network names
/etc/services	for port names
.SH AUTHOR
D 3
The unknown hacker.
E 3
I 3
The unknown hacker.  The 
.I pigs
E 8
I 8
D 13
.Dp
.Tp
E 13
I 13
.El
.El
E 13
.Pp
Commands to switch between displays may be abbreviated to the
minimum unambiguous prefix; for example, ``io'' for ``iostat''.
Certain information may be discarded when the screen size is
insufficient for display.  For example, on a machine with 10
drives the
.Ic iostat
bar graph displays only 3 drives on a 24 line terminal.  When
a bar graph would overflow the allotted screen space it is
truncated and the actual value is printed ``over top'' of the bar.
.Pp
The following commands are common to each display which shows
information about disk drives.  These commands are used to
select a set of drives to report on, should your system have
more drives configured than can normally be displayed on the
screen.
D 13
.Dw Tx
.Dp Cx Cm ignore
.Cx \&\ \&
.Op Ar drives
.Cx
E 13
I 13
.Pp
.Bl -tag -width Tx -compact
.It Cm ignore Op Ar drives
E 13
Do not display information about the drives indicated.  Multiple
drives may be specified, separated by spaces.
D 13
.Dp Cx Cm display
.Cx \&\ \&
.Op Ar drives
.Cx
E 13
I 13
.It Cm display Op Ar drives
E 13
Display information about the drives indicated.  Multiple drives
may be specified, separated by spaces.
D 13
.Dp
E 13
I 13
.El
E 13
.Sh FILES
D 13
.Dw /etc/networks
.Di L
.Dp Pa /vmunix
for the namelist
.Dp Pa /dev/kmem
for information in main memory
.Dp Pa /dev/drum
for information about swapped out processes
.Dp Pa /etc/hosts
for host names
.Dp Pa /etc/networks
for network names
.Dp Pa /etc/services
for port names
.Dp
.Sh AUTHOR
The unknown hacker.  The
.Ic pigs
E 8
display is derived from a program of the same name
written by Bill Reeves.
E 13
I 13
.Bl -tag -width /etc/networks -compact
.It Pa /vmunix
For the namelist.
.It Pa /dev/kmem
For information in main memory.
.It Pa /dev/drum
For information about swapped out processes.
.It Pa /etc/hosts
For host names.
.It Pa /etc/networks
For network names.
.It Pa /etc/services
For port names.
.El
E 13
E 3
D 8
.SH BUGS
E 8
I 8
.Sh HISTORY
D 13
.Nm
appeared in 4.3 BSD.
E 13
I 13
The
.Nm systat
program appeared in
.Bx 4.3 .
E 13
.Sh BUGS
E 8
D 15
Takes 2-10 percent of the cpu.  Certain displays presume
a 24 line by 80 character terminal.  The swap space display
should account for space allocated to the user structure and
D 5
page tables.   The
E 5
I 5
page tables.  The
E 15
I 15
Takes 2-10 percent of the cpu.
Certain displays presume a minimum of 80 characters per line.
The
E 15
E 5
D 8
.I vmstat
E 8
I 8
.Ic vmstat
E 8
display looks out of place because it is (it was added in as
D 5
a separate display rather than create a new program). 
E 5
I 5
D 17
a separate display rather than create a new program).
E 17
I 17
a separate display rather than created as a new program).
E 17
E 5
D 8
.PP
E 8
I 8
D 15
.Pp
E 8
The whole
D 5
thing is pretty hoakey, it was included in the distribution under
E 5
I 5
thing is pretty hokey and was included in the distribution under
E 5
serious duress.
E 15
E 1
