sbin/restore/SCCS/s.restore.8
h21918
s 00180/00161/00220
d D 8.4 95/05/01 23:30:06 mckusick 17 16
c reflect new option handling
e
s 00002/00000/00379
d D 8.3 94/06/01 20:43:58 ah 16 15
c page breaks for 4.4BSD manuals
e
s 00002/00002/00377
d D 8.2 93/12/11 23:43:19 mckusick 15 14
c copyediting for Usenix manuals
e
s 00002/00002/00377
d D 8.1 93/06/05 11:11:59 bostic 14 13
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00011/00005/00368
d D 6.11 91/08/28 15:28:29 mckusick 13 12
c merge restore and rrestore
e
s 00034/00034/00339
d D 6.10 91/07/23 13:45:40 cael 12 11
c sorted some of the options lexically, removed .Tp
e
s 00219/00227/00154
d D 6.9 91/03/16 17:08:27 cael 11 10
c macro and text revision (-mdoc version 3)
e
s 00004/00014/00377
d D 6.8 90/06/24 21:52:07 trent 10 9
c new copyright & pathnames
e
s 00014/00003/00377
d D 6.7 88/10/24 16:38:25 bostic 9 8
c Berkeley copyright notice
e
s 00001/00001/00379
d D 6.6 87/07/31 21:25:26 lepreau 8 7
c missed a restoresymtab
e
s 00016/00008/00364
d D 6.5 86/03/27 18:06:58 mckusick 7 6
c document the -b option
e
s 00007/00000/00365
d D 6.4 85/06/07 22:36:39 lepreau 6 5
c doc 's' option
e
s 00001/00001/00364
d D 6.3 85/06/06 00:42:11 lepreau 5 4
c restoresymtab -> restoresymtable
e
s 00008/00000/00357
d D 6.2 85/05/27 17:38:18 mckusick 4 3
c make 'R' into 'setmodes' - a real option!
e
s 00001/00001/00356
d D 6.1 85/04/27 13:47:30 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00327/00110/00030
d D 5.1 85/04/27 13:46:36 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00140/00000/00000
d D 4.1 85/04/27 13:45:53 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
D 9
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 9
I 9
D 11
.\" Copyright (c) 1985 The Regents of the University of California.
E 11
I 11
D 14
.\" Copyright (c) 1985, 1991 The Regents of the University of California.
E 11
.\" All rights reserved.
E 14
I 14
.\" Copyright (c) 1985, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 14
.\"
D 10
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 10
I 10
.\" %sccs.include.redist.man%
E 10
E 9
.\"
D 11
.\"	%W% (Berkeley) %G%
E 11
I 11
.\"     %W% (Berkeley) %G%
E 11
.\"
D 2
.TH RESTOR 8 "4/1/81"
E 2
I 2
D 3
.TH RESTORE 8 "19 January 1983"
E 3
I 3
D 11
.TH RESTORE 8 "%Q%"
E 3
E 2
.UC 4
.SH NAME
D 2
restor \- incremental file system restore
E 2
I 2
restore \- incremental file system restore
E 2
.SH SYNOPSIS
D 2
.B /etc/restor
key [ argument ... ]
E 2
I 2
D 10
.B /etc/restore
E 10
I 10
.B restore
E 10
key [ name ... ]
E 2
.SH DESCRIPTION
D 2
.I Restor
is used to read magtapes dumped with the
.I dump
E 2
I 2
.PP
.I Restore
reads tapes dumped with the
.IR dump (8)
E 2
command.
I 2
Its actions are controlled by the
.I key
argument.
E 11
I 11
.Dd %Q%
.Dt RESTORE 8
.Os BSD 4
.Sh NAME
.Nm restore
.Nd "restore files or file systems from backups made with dump"
.Sh SYNOPSIS
.Nm restore
D 17
.Ar key
.Op Ar name Ar ...
E 17
I 17
.Fl i
.Op Fl chmvy
.Op Fl b Ar blocksize
.Op Fl f Ar file
.Op Fl s Ar fileno
.Nm restore
.Fl R
.Op Fl cvy
.Op Fl b Ar blocksize
.Op Fl f Ar file
.Op Fl s Ar fileno
.Nm restore
.Fl r
.Op Fl cvy
.Op Fl b Ar blocksize
.Op Fl f Ar file
.Op Fl s Ar fileno
.Nm restore
.Fl t
.Op Fl chvy
.Op Fl b Ar blocksize
.Op Fl f Ar file
.Op Fl s Ar fileno
.Op file ...
.Nm restore
.Fl x
.Op Fl chmvy
.Op Fl b Ar blocksize
.Op Fl f Ar file
.Op Fl s Ar fileno
.Op file ...
.Pp
.in -\\n(iSu
(The
.Bx 4.3
option syntax is implemented for backward compatibility, but
is not documented here.)
E 17
.Sh DESCRIPTION
E 11
E 2
The
D 11
.I key
E 11
I 11
.Nm restore
command performs the inverse function of
.Xr dump 8 .
A full backup of a file system may be restored and
subsequent incremental backups layered on top of it.
Single files and
directory subtrees may be restored from full or partial
backups.
.Nm Restore
D 13
cannot work across a network, to do this, see the companion
command
.Xr rrestore .
E 13
I 13
works across a network;
to do this see the
.Fl f
flag described below.
E 13
D 17
The actions
of
.Nm restore
are controlled by the given
.Cm key ,
which
E 11
D 2
specifies what is to be done.
.I Key
is one of the characters
.B rRxt
optionally combined with
.BR f .
.TP
.B  f
Use the first
.I argument
as the name of the tape instead
of the default.
.TP
.B  r or R
The tape
is read and loaded into the file system
specified in
.I argument.
This should not be done lightly (see below).
If the key is
.B R
.I restor
asks which tape of a multi volume set to start on.
This allows restor to be interrupted and then
restarted (an
.I icheck
\-s must be done before restart).
.TP
.B  x
Each file on the
tape named by an 
.I argument
is extracted.
The file extracted is placed in a file with a numeric name
supplied by
.I restor
(actually the inode number).
In order to keep the amount of tape read to a minimum,
the following procedure is recommended:
.IP
Mount volume 1 of the set of dump tapes.
.IP
Type the
.I restor
command.
.IP
.I Restor
will announce whether or not it found the files,
give the number it will name the file, and rewind the tape.
.IP
It then
asks you to `mount the desired tape volume'.
Type the number of the volume you choose.
On a
multivolume dump the recommended procedure is to mount the
last through the first volume in that order.
.I Restor
checks to see if any of the files requested are on the
mounted tape (or a later tape, thus the reverse order) and doesn't
read through the tape if no files are.
If you are working with a single volume dump or the number of files
being restored is large, respond to the query with `1' and
.I restor
will read the tapes in sequential order.
.IP
If you have a hierarchy to restore you can use
.IR dumpdir (8)
to produce the list of names and a shell script to move
the resulting files to their homes.
.TP
.B t
Print the date the tape was written and the date
the filesystem was dumped from.
E 2
I 2
is a string of characters containing
at most one function letter and possibly
one or more function modifiers.
E 17
Other arguments to the command are file or directory
names specifying the files that are to be restored.
Unless the
D 11
.B h
E 11
I 11
D 17
.Cm h
E 11
key is specified (see below),
E 17
I 17
.Fl h
flag is specified (see below),
E 17
the appearance of a directory name refers to
the files and (recursively) subdirectories of that directory.
E 2
D 11
.PP
E 11
I 11
.Pp
E 11
D 2
The
E 2
I 2
D 17
The function portion of
the key is specified by one of the following letters:
E 17
I 17
Exactly one of the following flags is required:
E 17
D 11
.TP 5n
.B  r
The tape
is read and loaded into the current directory.
This should not be done lightly; the
E 2
.B r
D 2
option should only be used to restore
E 2
I 2
key should only be used to restore
E 2
a complete dump tape onto a clear file system
D 2
or to restore an incremental dump tape onto this.
E 2
I 2
or to restore an incremental dump tape after a full level zero restore.
E 2
Thus
D 2
.PP
	/etc/mkfs /dev/rrp0g 145673
E 2
I 2
.IP "" 5n
D 10
	/etc/newfs /dev/rrp0g eagle
E 10
I 10
	newfs /dev/rrp0g eagle
E 10
E 2
.br
D 2
	restor r /dev/rrp0g
.PP
E 2
I 2
D 10
	/etc/mount /dev/rp0g /mnt
E 10
I 10
	mount /dev/rp0g /mnt
E 10
.br
	cd /mnt
.br
	restore r
.IP "" 5n
E 2
is a typical sequence to restore a complete dump.
Another
D 2
.I restor
E 2
I 2
.I restore
E 2
can be done to get an incremental dump
in on top of this.
E 11
I 11
.Bl -tag -width Ds
D 17
.It Cm r
Restore (rebuild a file system).
The target file system should be made pristine with
.Xr newfs 8 ,
mounted and the
user
.Xr cd Ns 'd
into the pristine file system
before starting the restoration of the initial level 0 backup. If the
level 0 restores successfully, the
.Cm r
key may be used to restore
any necessary incremental backups on top of the level 0.
The
.Cm r
key precludes an interactive file extraction and can be
D 15
detrimental to ones health if not used carefully (not to mention
E 15
I 15
detrimental to one's health if not used carefully (not to mention
E 15
the disk). An example:
.Bd -literal -offset indent
newfs /dev/rrp0g eagle
mount /dev/rp0g /mnt
cd /mnt

restore rf /dev/rst8
.Ed
.Pp
E 11
D 2
.PP
E 2
I 2
Note that 
D 11
.I restore
E 11
I 11
.Nm restore
E 11
leaves a file 
D 8
.I restoresymtab
E 8
I 8
D 11
.I restoresymtable
E 11
I 11
.Pa restoresymtable
E 11
E 8
in the root directory to pass information between incremental
restore passes.
D 11
This file should be removed when the last incremental tape has been
E 11
I 11
This file should be removed when the last incremental has been
E 11
restored.
D 11
.br
E 2
A
D 2
.I dump
E 2
I 2
.IR dump (8)
E 2
followed by a
D 2
.I mkfs
E 2
I 2
.IR newfs (8)
E 2
and a
D 2
.I restor
is used to
change the size of a file system.
.SH FILES
default tape unit varies with installation
E 2
I 2
.I restore
is used to change the size of a file system.
.TP 5n
.B  R
.I Restore
E 11
I 11
.Pp
.Nm Restore ,
in conjunction with
.Xr newfs 8
and
.Xr dump 8 ,
may be used to modify file system parameters
such as size or block size.
.It Cm R
.Nm Restore
E 11
requests a particular tape of a multi volume set on which to restart
a full restore
(see the
D 11
.B r
E 11
I 11
.Cm r
E 11
key above).
D 11
This allows
.I restore
to be interrupted and then restarted.
.TP 5n
.B  x
The named files are extracted from the tape.
If the named file matches a directory whose contents 
had been written onto the tape,
E 11
I 11
This is useful if the restore has been interrupted.
.It Cm x
The named files are read from the given media.
If a named file matches a directory whose contents 
are on the backup
E 11
and the
D 11
.B h
E 11
I 11
.Cm h
E 11
key is not specified,
the directory is recursively extracted.
The owner, modification time,
and mode are restored (if possible).
If no file argument is given,
then the root directory is extracted,
which results in the entire content of the
D 11
tape being extracted,
E 11
I 11
backup being extracted,
E 11
unless the
D 11
.B h
E 11
I 11
.Cm h
E 11
key has been specified.
D 11
.TP 5n
.B  t
E 11
I 11
.It Cm t
E 11
The names of the specified files are listed if they occur
D 11
on the tape.
E 11
I 11
on the backup.
E 11
If no file argument is given,
then the root directory is listed,
which results in the entire content of the
D 11
tape being listed,
E 11
I 11
backup being listed,
E 11
unless the
D 11
.B h
E 11
I 11
.Cm h
E 11
key has been specified.
Note that the
D 11
.B t
E 11
I 11
.Cm t
E 11
key replaces the function of the old
D 11
.I dumpdir
E 11
I 11
.Xr dumpdir 8
E 11
program.
I 16
.ne 1i
E 16
D 11
.TP 5n
.B  i
This mode allows interactive restoration of files from a dump tape.
After reading in the directory information from the tape,
.I restore
E 11
I 11
.It Cm i
E 17
I 17
.It Fl i
E 17
This mode allows interactive restoration of files from a dump.
After reading in the directory information from the dump,
.Nm restore
E 11
provides a shell like interface that allows the user to move
around the directory tree selecting files to be extracted.
The available commands are given below;
for those commands that require an argument,
the default is the current directory.
D 11
.IP "" 10n
.ti -5n
E 2
.br
D 2
rst*
.SH "SEE ALSO"
dump(8), mkfs(8), dumpdir(8)
E 2
I 2
.B ls
[arg] \-
E 11
I 11
.Bl -tag -width Fl
D 12
.It Ic help
List a summary of the available commands.
.It Ic \&ls Op Ar arg
E 11
List the current or specified directory.
Entries that are directories are appended with a ``/''.
Entries that have been marked for extraction are prepended with a ``*''.
If the verbose key is set the inode number of each entry is also listed.
D 11
.ti -5n
.sp
.B cd
arg \-
E 11
I 11
.It Ic \&cd Ar arg
E 11
Change the current working directory to the specified argument.
D 11
.ti -5n
.sp
.B pwd
\-
E 11
I 11
.It Ic pwd
E 11
Print the full pathname of the current working directory.
E 12
D 11
.ti -5n
.sp
.B add
[arg] \-
E 11
I 11
.It Ic add Op Ar arg
E 11
The current directory or specified argument is added to the list of
files to be extracted.
If a directory is specified, then it and all its descendents are
added to the extraction list
(unless the
D 11
.B h
E 11
I 11
D 17
.Cm h
E 11
key is specified on the command line).
E 17
I 17
.Fl h
flag is specified on the command line).
E 17
Files that are on the extraction list are prepended with a ``*''
when they are listed by 
D 11
.BR ls .
.ti -5n
.sp
.B delete
[arg] \-
E 11
I 11
.Ic ls .
I 12
.It Ic \&cd Ar arg
Change the current working directory to the specified argument.
E 12
.It Ic delete Op Ar arg
E 11
The current directory or specified argument is deleted from the list of
files to be extracted.
If a directory is specified, then it and all its descendents are
deleted from the extraction list
(unless the
D 11
.B h
E 11
I 11
D 17
.Cm h
E 11
key is specified on the command line).
E 17
I 17
.Fl h
flag is specified on the command line).
E 17
The most expedient way to extract most of the files from a directory 
is to add the directory to the extraction list and then delete
those files that are not needed.
D 11
.ti -5n
.sp
.B extract
\-
E 11
I 11
.It Ic extract
E 11
All the files that are on the extraction list are extracted
D 11
from the dump tape.
.I Restore
E 11
I 11
from the dump.
.Nm Restore
E 11
will ask which volume the user wishes to mount.
The fastest way to extract a few files is to
start with the last volume, and work towards the first volume.
I 12
.It Ic help
List a summary of the available commands.
.It Ic \&ls Op Ar arg
List the current or specified directory.
Entries that are directories are appended with a ``/''.
Entries that have been marked for extraction are prepended with a ``*''.
D 17
If the verbose key is set the inode number of each entry is also listed.
E 17
I 17
If the verbose
flag is set the inode number of each entry is also listed.
E 17
.It Ic pwd
Print the full pathname of the current working directory.
.It Ic quit
Restore immediately exits,
even if the extraction list is not empty.
E 12
D 11
.ti -5n
.sp
I 4
.B setmodes
\-
E 11
I 11
.It Ic setmodes
E 11
All the directories that have been added to the extraction list
have their owner, modes, and times set;
D 11
nothing is extracted from the tape.
E 11
I 11
nothing is extracted from the dump.
E 11
This is useful for cleaning up after a restore has been prematurely aborted.
D 11
.ti -5n
.sp
E 4
.B verbose
\-
E 11
I 11
.It Ic verbose
E 11
The sense of the 
D 11
.B v
E 11
I 11
D 17
.Cm v
E 11
key is toggled.
When set, the verbose key causes the 
E 17
I 17
.Fl v
flag is toggled.
When set, the verbose flag causes the 
E 17
D 11
.B ls
E 11
I 11
.Ic ls
E 11
command to list the inode numbers of all entries.
It also causes
D 11
.I restore
E 11
I 11
.Nm restore
E 11
to print out information about each file as it is extracted.
D 11
.ti -5n
.sp
.B help
\-
List a summary of the available commands.
.ti -5n
.sp
.B quit
\-
E 11
I 11
D 12
.It Ic quit
E 11
Restore immediately exits,
even if the extraction list is not empty.
D 11
.sp
.PP
E 11
I 11
.Tp
E 12
.El
I 17
.It Fl R
.Nm Restore
requests a particular tape of a multi volume set on which to restart
a full restore
(see the
.Fl r
flag below).
This is useful if the restore has been interrupted.
.It Fl r
Restore (rebuild a file system).
The target file system should be made pristine with
.Xr newfs 8 ,
mounted and the user
.Xr cd Ns 'd
into the pristine file system
before starting the restoration of the initial level 0 backup. If the
level 0 restores successfully, the
.Fl r
flag may be used to restore
any necessary incremental backups on top of the level 0.
The
.Fl r
flag precludes an interactive file extraction and can be
detrimental to one's health if not used carefully (not to mention
the disk). An example:
.Bd -literal -offset indent
newfs /dev/rrp0g eagle
mount /dev/rp0g /mnt
cd /mnt

restore rf /dev/rst8
.Ed
.Pp
Note that 
.Nm restore
leaves a file 
.Pa restoresymtable
in the root directory to pass information between incremental
restore passes.
This file should be removed when the last incremental has been
restored.
.Pp
.Nm Restore ,
in conjunction with
.Xr newfs 8
and
.Xr dump 8 ,
may be used to modify file system parameters
such as size or block size.
.It Fl t
The names of the specified files are listed if they occur
on the backup.
If no file argument is given,
then the root directory is listed,
which results in the entire content of the
backup being listed,
unless the
.Fl h
flag has been specified.
Note that the
.Fl t
flag replaces the function of the old
.Xr dumpdir 8
program.
.ne 1i
.It Fl x
The named files are read from the given media.
If a named file matches a directory whose contents 
are on the backup
and the
.Fl h
flag is not specified,
the directory is recursively extracted.
The owner, modification time,
and mode are restored (if possible).
If no file argument is given,
then the root directory is extracted,
which results in the entire content of the
backup being extracted,
unless the
.Fl h
flag has been specified.
E 17
I 12
.El
E 12
.Pp
E 11
D 17
The following characters may be used in addition to the letter
that selects the function desired.
E 17
I 17
The following additional options may be specified:
E 17
D 11
.TP 5n
D 7
.B  v
Normally
E 7
I 7
.B b
E 11
I 11
.Bl -tag -width Ds
D 17
.It Cm b
E 11
The next argument to 
E 7
D 11
.I restore
D 7
does its work silently.
The
.B v
(verbose)
key causes it to type the name of each file it treats
preceded by its file type.
E 7
I 7
is used as the block size of the tape (in kilobytes).
If the \fB-b\fP option is not specified,
.I restore
tries to determine the tape block size dynamically.
E 7
.TP 5n
.B f
E 11
I 11
.Nm restore
is used as the block size of the media (in kilobytes).
E 17
I 17
.It Fl b Ar blocksize
The number of kilobytes per dump record.
E 17
If the
.Fl b
option is not specified,
.Nm restore
D 17
tries to determine the media block size dynamically.
.It Cm f
E 11
The next argument to 
E 17
I 17
tries to determine the block size dynamically.
.It Fl c
Normally,
E 17
D 11
.I restore
E 11
I 11
.Nm restore
E 11
D 17
is used as the name of the archive instead
D 11
of /dev/rmt?. 
If the name of the file is ``\-'',
.I restore 
E 11
I 11
of
.Pa /dev/rmt? . 
E 17
I 17
will try to determine dynamically whether the dump was made from an
old (pre-4.4) or new format file sytem.  The
.Fl c
flag disables this check, and only allows reading a dump in the old
format.
.It Fl f Ar file
Read the backup from
.Ar file ;
.Ar file
may be a special device file
like
.Pa /dev/rmt12
(a tape drive),
.Pa /dev/rsd1c
(a disk drive),
an ordinary file,
or
.Ql Fl
(the standard input).
E 17
I 13
If the name of the file is of the form
.Dq host:file ,
I 17
or
.Dq user@host:file ,
E 17
.Nm restore
reads from the named file on the remote host using
.Xr rmt 8 .
E 13
D 17
If the name of the file is
.Ql Fl ,
.Nm restore
E 11
reads from standard input.
Thus,
D 11
.IR dump (8)
E 11
I 11
.Xr dump 8
E 11
and
D 11
.I restore
E 11
I 11
.Nm restore
E 11
can be used in a pipeline to dump and restore a file system
with the command
D 11
.IP "" 5n
	dump 0f - /usr | (cd /mnt; restore xf -)
I 7
.TP 5n
.B  v
E 11
I 11
.Bd -literal -offset indent
dump 0f - /usr | (cd /mnt; restore xf -)
.Ed
E 17
.Pp
I 12
D 17
.It Cm h
.Nm Restore
extracts the actual directory, 
E 17
I 17
.It Fl h
Extract the actual directory, 
E 17
rather than the files that it references.
This prevents hierarchical restoration of complete subtrees
from the dump.
I 16
D 17
.ne 1i
E 16
.It Cm m
.Nm Restore
will extract by inode numbers rather than by file name.
E 17
I 17
.It Fl m
Extract by inode numbers rather than by file name.
E 17
This is useful if only a few files are being extracted,
and one wants to avoid regenerating the complete pathname
to the file.
D 17
.It Cm s
The next argument to
.Nm restore
is a number which
selects the file on a multi-file dump tape.  File numbering
starts at 1.
E 12
.It Cm v
E 17
I 17
.It Fl s Ar fileno
Read from the specified
.Ar fileno
on a multi-file tape.
File numbering starts at 1.
.It Fl v
E 17
E 11
Normally
D 11
.I restore
E 11
I 11
.Nm restore
E 11
does its work silently.
The
D 11
.B v
E 11
I 11
D 17
.Cm v
E 17
I 17
.Fl v
E 17
E 11
(verbose)
D 17
key causes it to type the name of each file it treats
E 17
I 17
flag causes it to type the name of each file it treats
E 17
preceded by its file type.
E 7
D 11
.TP 5n
.B y
.I Restore
will not ask whether it should abort the restore if gets a tape error.
It will always try to skip over the bad tape block(s) and continue as
E 11
I 11
D 17
.It Cm y
.Nm Restore
D 15
will not ask whether it should abort the restore if gets an error.
E 15
I 15
will not ask whether it should abort the restore if it gets an error.
E 15
It will always try to skip over the bad block(s) and continue as
E 11
best it can.
E 17
I 17
.It Fl y
Do not ask the user whether to abort the restore in the event of an error.
Always try to skip over the bad block(s) and continue.
E 17
D 11
.TP 5n
.B m
.I Restore
E 11
I 11
D 12
.It Cm m
.Nm Restore
E 11
will extract by inode numbers rather than by file name.
This is useful if only a few files are being extracted,
and one wants to avoid regenerating the complete pathname
to the file.
D 11
.TP 5n
.B h
.I Restore
E 11
I 11
.It Cm h
.Nm Restore
E 11
extracts the actual directory, 
rather than the files that it references.
This prevents hierarchical restoration of complete subtrees
D 11
from the tape.
I 6
.TP 5n
.B s
E 11
I 11
from the dump.
.It Cm s
E 11
The next argument to
D 11
.I restore
E 11
I 11
.Nm restore
E 11
is a number which
selects the file on a multi-file dump tape.  File numbering
starts at 1.
E 12
E 6
E 2
D 11
.SH DIAGNOSTICS
E 11
I 11
.El
.Sh DIAGNOSTICS
E 11
D 2
There are various diagnostics
involved with reading the tape and writing the disk.
There are also diagnostics if the i-list or the free list
of the file system is not large enough to hold the dump.
E 2
I 2
D 17
Complaints about bad key characters.
E 2
D 11
.PP
E 11
I 11
.Pp
E 17
E 11
I 2
Complaints if it gets a read error.
If 
D 11
.B y
has been specified, or the user responds ``y'',
.I restore
E 11
I 11
D 17
.Cm y
E 17
I 17
.Fl y
E 17
has been specified, or the user responds
.Ql y ,
.Nm restore
E 11
will attempt to continue the restore.
D 11
.PP
E 2
If the dump extends over more than one tape,
D 2
it may ask you to change tapes.
Reply with a new-line when the next tape has been mounted.
E 2
I 2
.I restore
will ask the user to change tapes.
E 11
I 11
.Pp
If a backup was made using more than one tape volume,
.Nm restore
will notify the user when it is time to mount the next volume.
E 11
If the
D 11
.B x
E 11
I 11
D 17
.Cm x
E 17
I 17
.Fl x
E 17
E 11
or
D 11
.B i
E 11
I 11
D 17
.Cm i
E 11
key has been specified,
E 17
I 17
.Fl i
flag has been specified,
E 17
D 11
.I restore
E 11
I 11
.Nm restore
E 11
will also ask which volume the user wishes to mount.
The fastest way to extract a few files is to
start with the last volume, and work towards the first volume.
D 11
.PP
E 11
I 11
.Pp
E 11
There are numerous consistency checks that can be listed by
D 11
.IR restore .
E 11
I 11
.Nm restore .
E 11
Most checks are self-explanatory or can ``never happen''.
Common errors are given below.
D 11
.IP "Converting to new file system format." 5n
.br
E 11
I 11
.Pp
.Bl -tag -width Ds -compact
.It Converting to new file system format.
E 11
A dump tape created from the old file system has been loaded.
It is automatically converted to the new file system format.
D 11
.IP "<filename>: not found on tape" 5n
.br
E 11
I 11
.Pp
.It <filename>: not found on tape
E 11
The specified file name was listed in the tape directory,
but was not found on the tape.
This is caused by tape read errors while looking for the file,
and from using a dump tape created on an active file system.
D 11
.IP "expected next file <inumber>, got <inumber>" 5n
.br
E 11
I 11
.Pp
.It expected next file <inumber>, got <inumber>
E 11
A file that was not listed in the directory showed up.
D 11
This can occur when using a dump tape created on an active file system.
.IP "Incremental tape too low" 5n
.br
E 11
I 11
This can occur when using a dump created on an active file system.
.Pp
.It Incremental dump too low
E 11
When doing incremental restore,
D 11
a tape that was written before the previous incremental tape,
E 11
I 11
a dump that was written before the previous incremental dump,
E 11
or that has too low an incremental level has been loaded.
D 11
.IP "Incremental tape too high" 5n
.br
E 11
I 11
.Pp
.It Incremental dump too high
E 11
When doing incremental restore,
D 11
a tape that does not begin its coverage where the previous incremental 
tape left off,
E 11
I 11
a dump that does not begin its coverage where the previous incremental 
dump left off,
E 11
or that has too high an incremental level has been loaded.
D 11
.IP "Tape read error while restoring <filename>" 5n
.ti -5n
.br
Tape read error while skipping over inode <inumber>
.ti -5n
.br
Tape read error while trying to resynchronize
.br
A tape read error has occurred.
E 11
I 11
.Pp
.It Tape read error while restoring <filename>
.It Tape read error while skipping over inode <inumber>
.It Tape read error while trying to resynchronize
A tape (or other media) read error has occurred.
E 11
If a file name is specified,
then its contents are probably partially wrong.
If an inode is being skipped or the tape is trying to resynchronize,
then no extracted files have been corrupted,
though files may not be found on the tape.
D 11
.IP "resync restore, skipped <num> blocks" 5n
.br
After a tape read error, 
.I restore
E 11
I 11
.Pp
.It resync restore, skipped <num> blocks
After a dump read error, 
.Nm restore
E 11
may have to resynchronize itself.
This message lists the number of blocks that were skipped over.
D 11
.SH FILES
/dev/rmt?	the default tape drive
.br
/tmp/rstdir*	file containing directories on the tape.
.br
/tmp/rstmode*	owner, mode, and time stamps for directories.
.br
D 5
\&./restoresymtab	information passed between incremental restores.
E 5
I 5
\&./restoresymtable	information passed between incremental restores.
E 5
.SH SEE ALSO
rrestore(8C) dump(8), newfs(8), mount(8), mkfs(8)
E 2
.SH BUGS
D 2
There is redundant information on the tape
that could be used in case of tape reading problems.
Unfortunately,
.I restor
doesn't use it.
E 2
I 2
.I Restore
E 11
I 11
.El
.Sh FILES
.Bl -tag -width "./restoresymtable" -compact
.It Pa /dev/rmt?
the default tape drive
.It Pa /tmp/rstdir*
file containing directories on the tape.
.It Pa /tmp/rstmode*
owner, mode, and time stamps for directories.
.It Pa \&./restoresymtable
information passed between incremental restores.
.El
.Sh SEE ALSO
D 13
.Xr rrestore 8
E 13
.Xr dump 8 ,
.Xr newfs 8 ,
.Xr mount 8 ,
D 13
.Xr mkfs 8
E 13
I 13
.Xr mkfs 8 ,
.Xr rmt 8
E 13
.Sh BUGS
.Nm Restore
E 11
can get confused when doing incremental restores from
D 11
dump tapes that were made on active file systems.
.PP
E 11
I 11
D 17
dump that were made on active file systems.
E 17
I 17
dumps that were made on active file systems.
E 17
.Pp
E 11
A level zero dump must be done after a full restore.
Because restore runs in user code,
it has no control over inode allocation;
D 17
thus a full restore must be done to get a new set of directories
E 17
I 17
thus a full dump must be done to get a new set of directories
E 17
reflecting the new inode numbering,
even though the contents of the files is unchanged.
I 11
.Sh HISTORY
The
D 12
.Nm
E 12
I 12
.Nm restore
E 12
command appeared in
.Bx 4.2 .
E 11
E 2
E 1
