sbin/mount_cd9660/SCCS/s.mount_cd9660.8
h18407
s 00031/00058/00042
d D 8.3 94/03/27 08:31:46 bostic 3 2
c Jan-Simon Pendry and my new mount code
c mount_cd9660 pretty much completely rewritten for cleanliness, KNF, and ANSI
e
s 00001/00001/00099
d D 8.2 94/01/23 23:55:25 mckusick 2 1
c ISOFS => CD9660
e
s 00100/00000/00000
d D 8.1 94/01/21 18:27:41 mckusick 1 0
c date and time created 94/01/21 18:27:41 by mckusick
e
u
U
t
T
I 1
.\" Copyright (c) 1993, 1994
.\"     The Regents of the University of California.  All rights reserved.
.\" All rights reserved.
.\"
.\" This code is derived from software donated to Berkeley by
.\" Christopher G. Demetriou.
.\"
.\" %sccs.include.redist.roff%
.\"
.\"     %W% (Berkeley) %G%
.Dd %Q%
D 2
.Dt MOUNT_ISOFS 8
E 2
I 2
.Dt MOUNT_CD9660 8
E 2
D 3
.Os NetBSD 0.9
E 3
I 3
.Os BSD 4
E 3
.Sh NAME
.Nm mount_cd9660
.Nd mount an ISO-9660 filesystem
.Sh SYNOPSIS
.Nm mount_cd9660
D 3
.Op Fl F Ar fsoptions
.Op Fl norrip
.Op Fl gen
.Op Fl extattr
.Pa special
.Pa node
E 3
I 3
.Op Fl egr
.Op Fl o Ar options
.Ar special | node
E 3
.Sh DESCRIPTION
The
.Nm mount_cd9660
D 3
command attaches the ISO-9660 filesystem residing on
the device
E 3
I 3
command attaches the ISO-9660 filesystem residing on the device
E 3
.Pa special
D 3
to the global filesystem namespace at the location
indicated by
E 3
I 3
to the global filesystem namespace at the location indicated by
E 3
.Pa node .
This command is normally executed by
.Xr mount 8
at boot time.
.Pp
D 3
If the filesystem includes Rockridge extensions, they are
used unless the
.Fl norrip
flag is used.  If that option is given to
.Nm
then the Rockridge extensions will be ignored.
.Pp
Version numbers on files are normally stripped on directory listings.
If you want to see those, use the
.Fl gen
flag.
Otherwise, if there are files with different version numbers on the disk,
only the last one will be listed.
In either case, you may open a file with or without explicitly stating the
version number.
.Pp
If a disk contains extended attributes, they are normally ignored.
You can enable the usage of extended attributes with the
.Fl extattr
flag.
.Sh EXAMPLES
.Bd -literal -offset indent -compact
mount_cd9660 /dev/cd0d /cdrom
mount_cd9660 \-norrip /dev/cd0d /cdrom
mount_cd9660 \-norrip \-gen /dev/cd0d /cdrom
mount \-t cd9660 /dev/cd0d /cdrom
mount \-t cd9660 \-o \-norrip /dev/cd0d /cdrom
mount \-t cd9660 \-o \-gen,\-extattr /dev/cd0d /cdrom
.Ed
E 3
I 3
The options are as follows:
.Bl -tag -width indent
.It Fl e
Enable the use of extended attributes.
.It Fl g
Do not strip version numbers on files.
(By default, if there are files with different version numbers on the disk,
only the last one will be listed.)
In either case, files may be opened without explicitly stating a
version number.
.It Fl o
Options are specified with a
.Fl o
flag followed by a comma separated string of options.
See the
.Xr mount 8
man page for possible options and their meanings.
.It Fl r
Do not use any Rockridge extensions included in the filesystem.
.El
E 3
.Sh SEE ALSO
.Xr mount 2 ,
.Xr unmount 2 ,
D 3
.Xr fstab 5
E 3
I 3
.Xr fstab 5 ,
.Xr mount 8
E 3
.Sh BUGS
D 3
The cd9660 filesystem should support the original "High Sierra"
("CDROM001") format;
it does not.
E 3
I 3
The cd9660 filesystem does not support the original "High Sierra"
("CDROM001") format.
E 3
.Pp
POSIX device node mapping is currently not supported.
.Pp
Version numbers are not stripped if Rockridge extensions are in use.
In this case, accessing files that don't have Rockridge names without
version numbers gets the one with the lowest version number and not
the one with the highest.
.Pp
D 3
The filesystem name might need some rethinking, and some would
say it should run as a user process.
.Pp
E 3
There is no ECMA support.
.Sh HISTORY
The
.Nm mount_cd9660
D 3
utility first appeared in NetBSD 0.8.
Handling of Rockridge extensions was added for NetBSD 0.9.
.Sh AUTHORS
.Bl -tag
Pace Willisson <pace@blitz.com>, <pace@bsdi.com> wrote the
original version of the ISO-9660 filesystem.
.Pp
Atsushi Murai <amurai@spec.co.jp> wrote the Rockridge support.
.Pp
Chris Demetriou <cgd@berkeley.edu> wrote the man page.
.El
E 3
I 3
utility first appeared 4.4BSD.
E 3
E 1
