usr.bin/at/at/SCCS/s.at.1
h38619
s 00002/00002/00187
d D 8.3 94/04/18 07:39:26 bostic 12 11
c typo
e
s 00001/00001/00188
d D 8.2 94/04/18 07:09:41 bostic 11 10
c typo
e
s 00002/00002/00187
d D 8.1 93/06/29 16:25:50 bostic 10 9
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00005/00006/00184
d D 6.6 93/06/29 16:25:37 mckusick 9 7
c grammer nits
e
s 00002/00002/00188
d R 8.1 93/06/06 14:20:40 bostic 8 7
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00033/00039/00157
d D 6.5 91/03/14 01:38:43 cael 7 6
c updated to -mdoc version 3
e
s 00040/00030/00156
d D 6.4 90/07/24 22:41:02 cael 6 5
c .Xr botch fix
e
s 00166/00110/00020
d D 6.3 90/06/11 05:52:58 cael 5 4
c converted man page
e
s 00001/00001/00129
d D 6.2 86/03/20 11:42:56 bloom 4 3
c fix gramatical error
e
s 00075/00045/00055
d D 6.1 85/04/29 14:07:27 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00001/00001/00099
d D 5.1 85/04/29 14:07:01 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00100/00000/00000
d D 4.1 85/04/29 14:06:23 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
D 5
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 5
I 5
D 10
.\" Copyright (c) 1980, 1990 The Regents of the University of California.
.\" All rights reserved.
E 10
I 10
D 12
.\" Copyright (c) 1980, 1990, 1993
E 12
I 12
.\" Copyright (c) 1980, 1990, 1993, 1994
E 12
.\"	The Regents of the University of California.  All rights reserved.
E 10
E 5
.\"
D 5
.\"	%W% (Berkeley) %G%
E 5
I 5
.\" %sccs.include.redist.man%
E 5
.\"
D 2
.TH AT 1 
E 2
I 2
D 3
.TH AT 1 "18 January 1983"
E 3
I 3
D 5
.TH AT 1 "%Q%"
E 3
E 2
.UC 4
.SH NAME
at \- execute commands at a later time
.SH SYNOPSIS
D 3
.B at
E 3
I 3
.B "at [ -c ] [ -s ] [ -m ]"
E 3
time
D 3
[
day
]
[
file
]
E 3
I 3
[ day ]
[ file ]
E 3
.SH DESCRIPTION
.I At
D 3
squirrels away a copy of the named
E 3
I 3
spools away a copy of the named
E 3
.I file
D 3
(standard input default)
E 3
to be used as input to
.IR sh (1)
D 3
(or
.IR csh (1)
if you normally use it)
at a specified later time.
A
E 3
I 3
or
.IR csh (1).
If the
.B \-c
flag (for 
.IR (csh (1)))
or the
.B \-s
flag (for
.IR (sh (1)))
is specified, then that shell will be used to execute the job;
if no shell is specified, 
the current environment shell is used.
If no file name is specified, 
.I at
prompts for commands from standard input until a ^D is typed. 
.PP
If the 
.B \-m
flag is specified, mail will be sent to the user after the job
E 5
I 5
.\"     %W% (Berkeley) %G%
.\"
.Dd %Q%
.Dt AT 1
D 6
.Dd %Q%
E 6
.Os BSD 4
.Sh NAME
.Nm at
D 6
.Sd run command(s) at a specific time
E 6
I 6
.Nd schedule execution of commands `at' a given time
E 6
.Sh SYNOPSIS
.Nm at
.Op Fl c
D 7
.Op Fl s
E 7
.Op Fl m
I 7
.Op Fl s
E 7
.Ar time
.Op Ar day
.Op Ar command_file
.Sh DESCRIPTION
.Nm At
D 6
allows commands to be run at a user specified time.
The commands can be given to
E 6
I 6
schedules execution of commands at the specified
.Ar time .
The commands may be given to
E 6
.Nm
via the
.Ar command_file
or accepted from the standard input.
.Nm At
will pass these commands to the appropriate
D 6
shell at the requested time.
E 6
I 6
shell at the requested time. While awaiting
execution, the jobs reside in a spool directory
and may be examined by the
.Xr atq 1
program.
.Pp
Options available:
D 7
.Pp
E 6
.Tp Fl c
E 7
I 7
.Bl -tag -width Ds
.It Fl c
E 7
.Ar Command_file
contains
.Xr csh 1
commands.
D 7
.Tp Fl s
E 7
I 7
.It Fl s
E 7
.Ar Command_file
contains
.Xr sh 1
commands.
D 7
.Tp Fl m
E 7
I 7
.It Fl m
E 7
Mail will be sent to the user after the job
E 5
has been run. If errors occur during execution of the job, then
a copy of the error diagnostics will be sent to the user. If
no errors occur, then a short message is sent informing the
user that no errors occurred.
D 5
.PP
E 5
I 5
D 7
.Tp
E 7
I 7
.El
E 7
.Pp
D 6
If no file name is specified,
E 6
I 6
If a
.Ar command_file
is not specified,
E 6
.Nm at
prompts for commands from standard input until a
D 6
.Li \&^D is typed.
E 6
I 6
.Ql \&^D
is typed.
E 6
.Pp
E 5
The format of the spool file is as follows:
D 9
A four line header that includes the owner of the job, the name of the job,
E 9
I 9
a four line header that includes the owner of the job, the name of the job,
E 9
the shell used to run the job, and whether mail will be
D 6
set after the job is executed. The header is followed by a
E 3
D 5
.I cd
D 3
command to the current directory is inserted
at the beginning,
followed by assignments to all environment variables (excepting the
variable TERM, which is useless in this context.)
E 3
I 3
command to the current directory and a 
.I umask
E 5
I 5
.Ic cd
E 6
I 6
sent after the job is executed. The header is followed by a
.Nm cd
E 6
command to the current directory and a
D 6
.Ic umask
E 6
I 6
.Nm umask
E 6
E 5
command to set the modes on any files created by the job.
D 5
Then 
.I at
E 5
I 5
D 7
Then
.Nm at
E 7
I 7
.Nm At
E 7
E 5
copies all relevant environment variables to the spool file.
E 3
When the script is run, it uses the user and group ID
D 3
of the creator of the copy file.
E 3
I 3
of the creator of the spool file.
E 3
D 5
.PP
E 5
I 5
.Pp
E 5
The
D 5
.I time
is 1 to 4 digits, with an optional following
`A', `P', `N' or `M' for
AM, PM, noon or midnight.
One and two digit numbers are taken to be hours, three and four digits
to be hours and minutes.
If no letters follow the digits, a 24 hour clock time is understood.
.PP
The optional
.I day
is either
(1) a month name followed by a day number,
or
D 3
(2) a day of the week; if the word `week' follows
invocation is moved seven days further off.
E 3
I 3
(2) a day of the week; 
if the word `week' follows, invocation is moved
seven days further off.
E 3
Names of months and days may be recognizably truncated.
Examples of legitimate commands are
.IP
at 8am jan 24
.br
D 3
at 1530 fr week
E 3
I 3
at -c -m 1530 fr week
.br
at -s -m 1200n week
E 3
.PP
.I At
D 3
programs are executed by periodic execution
of the command
.I /usr/lib/atrun
from
E 3
I 3
programs are executed by periodic execution 
of the command 
.IR
/usr/lib/atrun 
from 
E 3
.IR cron (8).
The granularity of
.I at
D 3
depends upon how often
.I atrun
is executed.
E 3
I 3
depends upon the how often atrun is executed.
E 3
.PP
D 3
Standard output or error output is lost unless redirected.
E 3
I 3
Error output is lost unless redirected or the
.I \-m
flag is requested, in which case a copy of the errors is sent to
the user via 
.IR mail (1).
E 3
.SH FILES
D 3
.ta 2i
/usr/lib/atrun	executor (run by 
.IR cron (8)).
.sp
in /usr/spool/at:
.ta .5i 2i
.br
\&	yy.ddd.hhhh.*	activity for year yy, day dd, hour hhhh.
.br
\&	lasttimedone	last \fIhhhh\fR
.br
\&	past	activities in progress
E 3
I 3
.nf
/usr/spool/at                spooling area
/usr/spool/at/yy.ddd.hhhh.*  job file
/usr/spool/at/past           directory where jobs are executed from
/usr/spool/at/lasttimedone   last time atrun was run
/usr/lib/atrun               executor (run by cron(8))
.fi
E 3
.SH "SEE ALSO"
I 3
atq(1),
atrm(1),
E 3
calendar(1),
D 3
pwd(1),
E 3
sleep(1),
cron(8)
.SH DIAGNOSTICS
E 5
I 5
.Ar time
is either a 24 hour military time
.Em hhmm,
where
.Em hh
is hour and
.Em mm
is minutes, or the traditional 12 hour time
with qualifying options:
D 7
.Df I
D 6
.Dp Li am
E 6
I 6
.Dp Li am , a
E 7
I 7
.Pp
.Bl -tag -width "am , a" -offset 12n -compact
.It Li am , a
E 7
E 6
am
D 6
.Dp Li a
am
.Dp Li pm
E 6
I 6
D 7
.Dp Li pm , p
E 7
I 7
.It Li pm , p
E 7
E 6
pm
D 6
.Dp Li p
pm
E 6
D 7
.Dp Li n
E 7
I 7
.It Li n
E 7
noon
D 7
.Dp Li m
E 7
I 7
.It Li m
E 7
midnight
D 7
.Dp
.De
E 7
I 7
.El
.Pp
E 7
D 6
The time can be abbreviated as shown below in the EXAMPLES.
E 6
I 6
The time can be abbreviated as shown below in EXAMPLES.
E 6
.Pp
A
.Ar day
of the week may be specified by the first two
letters of its name. A week (7 days) may be specified by 
the argument
D 7
.Em week .
E 7
I 7
.Ar week .
E 7
If a month name is given, the following argument is expected to
D 6
be the day.
E 6
I 6
be the day (numeric).
E 6
.Sh ENVIRONMENT
D 6
If no shell is specified,
E 6
I 6
If a shell is not specified,
E 6
the current environment variable
.Ev SHELL
is used.
D 6
Examples
E 6
I 6
.Sh EXAMPLES
E 6
D 7
.Pp
D 6
.Dp Li at 10p
E 6
I 6
.Tw Ar
.Tp Li at 10p
E 7
I 7
.Bl -tag -width Ds
.It Li at 10p
E 7
E 6
Execute at 10pm today, or tomorrow
if 10pm has past. Use the shell
found in the environment variable
.Ev SHELL.
D 6
.Dp Li at -c -m 1705 mo
E 6
I 6
D 7
.Tp Li at -c -m 1705 mo
E 7
I 7
D 9
.It Li at -c -m 1705 mo
E 9
I 9
.It Li at -c -m 1705 \&mo
E 9
E 7
E 6
Execute at 5:05pm on Monday using
.Xr csh 1
and send mail upon completion or
termination of the job.
D 6
.Dp Li at -s -m 1200n week
E 6
I 6
D 7
.Tp Li at -s -m 1200n week
E 7
I 7
.It Li at -s -m 1200n week
E 7
E 6
D 9
Use
.Xr sh 1 ,
send mail upon completetion, start at noon o'clock,
one week from today.
E 9
I 9
Execute at noon one week from today, using
.Xr sh 1
D 11
and send mail upon completetion.
E 11
I 11
and send mail upon completion.
E 11
E 9
D 6
.Dp Li at -s 8a apr 1
Try it for fun.
.Dp
.Pp
E 6
I 6
D 7
.Tp Li at -s 8a apr 1
E 7
I 7
.It Li at -s 8a apr 1
E 7
Ideally this would be given late in March.  The
commands would be run at 8 am on April first, using
the
.Xr sh 1 .
D 7
.Tp
E 7
I 7
.El
E 7
E 6
.Sh ERRORS
Errors must be collected via the
.Fl m
option or by redirecting the standard output
from inside the
.Ar command_file.
.Sh FILES
D 7
.Dw /var/spool/at/yy.ddd.hhhh.*
D 6
.Ds L
E 6
I 6
.Di L
E 6
.Dp Pa /var/spool/at
E 7
I 7
.Bl -tag -width /var/spool/at/yy.ddd.hhhh.* -compact
.It Pa /var/spool/at
E 7
spooling area
D 7
.Dp Pa /var/spool/at/yy.ddd.hhhh.*
E 7
I 7
.It Pa /var/spool/at/yy.ddd.hhhh.*
E 7
job file
D 7
.Dp Pa /var/spool/at/past
E 7
I 7
.It Pa /var/spool/at/past
E 7
directory where jobs are executed from
D 7
.Dp Pa /var/spool/at/lasttimedone
E 7
I 7
.It Pa /var/spool/at/lasttimedone
E 7
last time atrun was run
D 7
.Dp Pa /var/libexec/atrun
E 7
I 7
.It Pa /var/libexec/atrun
E 7
executor (run by
.Xr cron 8 )
D 7
.Dp
E 7
I 7
.El
E 7
.Sh SEE ALSO
.Xr atq 1 ,
.Xr atrm 1 ,
.Xr calendar 1 ,
.Xr cron 8
.Xr sleep 1 ,
.Sh DIAGNOSTICS
E 5
Complains about various syntax errors and times out of range.
D 5
.SH BUGS
Due to the granularity of the execution of
D 3
.I /usr/lib/atrun,
E 3
I 3
.IR /usr/lib/atrun,
E 3
there may be bugs in scheduling things almost
exactly 24 hours into the future.
I 3

E 5
I 5
D 7
.Sh HISTORY
D 6
.Nm
E 6
I 6
.Nm At
E 6
appeared in Version 7 AT&T UNIX.
E 7
.Sh BUGS
The queueing mechanism
.Pa /usr/libexec/atrun ,
is scheduled by
.Xr cron 8 .
D 7
Frequency with which
.Xr cron 8
runs
.Pa /usr/libexec/atrun
is site dependent.
E 7
If it is run infrequently, a job may
D 12
fall thru the cracks.
E 12
I 12
fall through the cracks.
E 12
.Pp
There are known problems attempting to specify
a time of 2400 hours to
.Nm at .
.Pp
E 5
If the system crashes, mail is not sent to the user informing them that
the job was not completed.
D 5

E 5
I 5
.Pp
E 5
Sometimes old spool files are not removed from the directory
D 4
/usr/spool/at/past. This is usually do to a system crash,
E 4
I 4
D 5
/usr/spool/at/past. This is usually due to a system crash,
E 5
I 5
D 6
/var/spool/at/past. This is usually due to a system crash,
E 6
I 6
.Pa /var/spool/at/past .
This is usually due to a system crash,
E 6
E 5
E 4
and requires that they be removed by hand.
I 7
.Sh HISTORY
An
.Nm
command appeared in Version 7 AT&T UNIX.
E 7
E 3
E 1
