usr.bin/tip/SCCS/s.tip.1
h39789
s 00001/00001/00424
d D 8.4 94/04/18 07:40:44 bostic 15 14
c typo
e
s 00005/00005/00420
d D 8.3 93/12/30 15:39:26 mckusick 14 13
c copyediting for Usenix manuals
e
s 00015/00002/00410
d D 8.2 93/11/16 12:39:49 bostic 13 12
c Here's a patch to the man page to fix a problem and
c describe ~C which is what causes consh() to be called.
c From: Paul A Vixie <paul@vix.com>
e
s 00002/00002/00410
d D 8.1 93/06/06 16:34:45 bostic 12 11
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00117/00105/00295
d D 6.8 91/07/27 17:23:39 cael 11 10
c mdoc version three
e
s 00002/00000/00398
d D 6.7 91/03/14 00:28:28 cael 10 8
c add .Vx so tmac.andoc will call tmac.mdoc-old
e
s 00001/00000/00398
d R 6.7 91/03/13 20:38:32 cael 9 8
c add .Vx so tmac.andoc will call tmac.mdoc-old
e
s 00017/00008/00381
d D 6.6 90/07/24 22:52:14 cael 8 7
c .Xr botch fix
e
s 00214/00243/00175
d D 6.5 90/06/11 06:01:02 cael 7 6
c converted man page
e
s 00016/00006/00402
d D 6.4 88/09/28 21:07:05 bostic 6 5
c add Berkeley copyright
e
s 00008/00000/00400
d D 6.3 86/05/05 15:23:08 sam 5 4
c add ~^Y command
e
s 00004/00000/00396
d D 6.2 85/11/29 19:54:00 donn 4 3
c Documented the '~$' (local process -> remote host) command.
e
s 00001/00001/00395
d D 6.1 85/04/29 18:26:47 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00363/00177/00033
d D 5.1 85/04/29 18:25:42 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00210/00000/00000
d D 4.1 85/04/29 18:24:29 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
D 6
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 6
I 6
D 7
.\" Copyright (c) 1980 The Regents of the University of California.
E 7
I 7
D 12
.\" Copyright (c) 1980, 1990 The Regents of the University of California.
E 7
.\" All rights reserved.
E 12
I 12
.\" Copyright (c) 1980, 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 12
E 6
.\"
I 6
D 7
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 7
I 7
D 11
.\" %sccs.include.redist.man%
E 11
I 11
.\" %sccs.include.redist.roff%
E 11
E 7
.\"
E 6
D 7
.\"	%W% (Berkeley) %G%
E 7
I 7
D 11
.\"     %W% (Berkeley) %G%
E 11
I 11
.\"	%W% (Berkeley) %G%
E 11
E 7
.\"
I 10
D 11
.Vx
.Vx
E 11
E 10
D 2
.TH CU 1C 4/1/81
E 2
I 2
D 3
.TH TIP 1C "18 July 1983"
E 3
I 3
D 6
.TH TIP 1C "%Q%"
E 6
I 6
D 7
.TH TIP 1 "%Q%"
E 6
E 3
E 2
.UC 4
.SH NAME
D 2
cu \- call UNIX
E 2
I 2
tip, cu \- connect to a remote system
E 2
.SH SYNOPSIS
D 2
.B cu
telno
E 2
I 2
.B tip
E 2
[
D 2
.B \-t
]
E 2
I 2
.B \-v
] [
.BI \- speed
] system-name
.br
.B tip
E 2
[
D 2
.BI \- n
E 2
I 2
.B \-v
] [
.BI \- speed
] phone-number
.br
.B cu
phone-number
E 2
[
I 2
.B \-t
] [
E 2
.B \-s
D 2
speed ]
[
.B \-a
acu ]
[
E 2
I 2
.I speed
] [
.B \ -a
.I acu
] [
E 2
.B \-l
D 2
line ]
[
.B \-b
E 2
I 2
.I line
] [
.B \-#
E 2
]
.SH DESCRIPTION
D 2
.I Cu
calls up another UNIX system,
a terminal,
or possibly a non-UNIX system.
It manages an interactive conversation with possible
transfers of text files.
.I Telno
is the telephone number,
with minus signs at appropriate places for delays.
E 2
I 2
.I Tip
E 7
I 7
.Dd %Q%
.Dt TIP 1
.Os BSD 4
.Sh NAME
.Nm tip ,
.Nm cu
.Nd connect to a remote system
.Sh SYNOPSIS
.Nm tip
.Op Fl v
D 11
.Cx Fl
.Ar speed
.Cx
E 11
I 11
.Fl Ns Ns Ar speed 
E 11
.Ar system\-name
.Nm tip
.Op Fl v
D 11
.Cx Fl
.Ar speed
.Cx
E 11
I 11
.Fl Ns Ns Ar speed 
E 11
.Ar phone\-number
.Nm cu
.Ar phone\-number
.Op Fl t
.Op Fl s Ar speed
.Op Fl a Ar acu
.Op Fl l Ar line
.Op Fl #
.Sh DESCRIPTION
.Nm Tip
E 7
and
D 7
.I cu
E 7
I 7
.Ar cu
E 7
establish a full-duplex connection to another machine,
giving the appearance of being logged in directly on the
remote cpu.  It goes without saying that you must have a login
on the machine (or equivalent) to which you wish to connect.
The preferred interface is
D 7
.IR tip .
E 7
I 7
.Nm tip  .
E 7
E 2
The
D 2
.BR \-t ""
flag is used to dial out to a terminal.
.I Speed
gives the transmission speed (110, 134, 150, 300, 1200);
300 is the default value.
E 2
I 2
D 7
.I cu
E 7
I 7
.Ar cu
E 7
interface is included for those people attached to the
D 11
``call UNIX'' command of version 7.  This manual page
E 11
I 11
``call
.Ux Ns ''
command of version 7.  This manual page
E 11
D 7
describes only 
.IR tip .
E 2
.PP
E 7
I 7
describes only
.Nm tip  .
.Pp
D 8
Options:
E 8
I 8
Available Option:
D 11
.Tw Ds
E 8
.Tp Fl v
E 11
I 11
.Bl -tag -width indent
.It Fl v
E 11
Set verbose mode.
D 11
.Tp
E 11
I 11
.El
E 11
.Pp
E 7
D 2
The
.B \-a
and
.B \-l
values may be used to
specify pathnames
for the ACU and communications line devices.
They can be used to override the following
built-in choices:
E 2
I 2
Typed characters are normally transmitted directly to the remote
machine (which does the echoing as well).  A tilde (`~') appearing
as the first character of a line is an escape signal; the following
are recognized:
D 7
.TP 10
.B ~^D ~.
E 7
I 7
D 11
.Tw Ds
.Tp Ic \&~^D \&~ .
E 11
I 11
.Bl -tag -width flag
.It Ic \&~^D No or Ic \&~ .
E 11
E 7
Drop the connection and exit
(you may still be logged in on the
remote machine).
D 7
.TP 10
\fB~c \fP [\fIname\fP]
E 7
I 7
D 11
.Pp
.Tp Cx Ic \&~c
.Cx \&\ \&
.Op Ar name
.Cx
E 11
I 11
.It Ic \&~c Op Ar name 
E 11
E 7
D 8
Change directory to name (no argument
E 8
I 8
Change directory to
.Ar name
(no argument
E 8
implies change to your home directory).
D 7
.TP 10
.B ~!
E 7
I 7
D 11
.Tp Ic \&~!
E 11
I 11
.It Ic \&~!
E 11
E 7
Escape to a shell (exiting the shell will
return you to tip).
D 7
.TP 10
.B ~>
E 7
I 7
D 11
.Tp Ic \&~>
E 11
I 11
.It Ic \&~>
E 11
E 7
Copy file from local to remote.
D 7
.I Tip
E 7
I 7
.Nm Tip
E 7
prompts for the name of a local file to transmit.
D 7
.TP 10
.B ~<
E 7
I 7
D 11
.Tp Ic \&~<
E 11
I 11
.It Ic \&~<
E 11
E 7
Copy file from remote to local.
D 7
.I Tip
E 7
I 7
.Nm Tip
E 7
prompts first for the name of the file to be sent, then for
a command to be executed on the remote machine.
D 7
.TP 10
\fB~p\fP \fIfrom\fP [ \fIto\fP ]
E 7
I 7
D 11
.Tp Cx Ic \&~p
.Cx \&\ \&
.Ar from
.Cx \&\ \&
.Op Ar to
.Cx
E 7
Send a file to a remote UNIX host.  The put command causes the remote UNIX
E 11
I 11
.It Ic \&~p Ar from Op Ar to 
Send a file to a remote
.Ux
host.  The put command causes the remote
.Ux
E 11
system to run the command string ``cat > 'to''', while
D 7
.I tip
E 7
I 7
.Nm tip
E 7
sends it the ``from''
file.  If the ``to'' file isn't specified the ``from'' file name is used.
D 11
This command is actually a UNIX specific version of the ``~>'' command.
D 7
.TP 10
\fB~t\fP \fIfrom\fP [ \fIto\fP ]
Take a file from a remote UNIX host. 
E 7
I 7
.Tp Cx Ic \&~t
.Cx \&\ \&
.Ar from
.Cx \&\ \&
.Op Ar to
.Cx
Take a file from a remote UNIX host.
E 11
I 11
This command is actually a
.Ux
specific version of the ``~>'' command.
.It Ic \&~t Ar from Op Ar to 
Take a file from a remote
.Ux
host.
E 11
E 7
As in the put command the ``to'' file
D 7
defaults to the ``from'' file name if it isn't specified. 
E 7
I 7
defaults to the ``from'' file name if it isn't specified.
E 7
The remote host
executes the command string ``cat 'from';echo ^A'' to send the file to
D 7
.IR tip .
.TP 10
.B ~|
E 7
I 7
.Nm tip  .
D 11
.Tp Ic \&~
E 7
Pipe the output from a remote command to a local UNIX process.
The command string sent to the local UNIX system is processed by the shell.
D 7
.TP 10
I 4
.B ~$
E 7
I 7
.Tp Ic \&~$
E 7
Pipe the output from a local UNIX process to the remote host.
The command string sent to the local UNIX system is processed by the shell.
D 7
.TP 10
E 4
.B ~#
Send a BREAK to the remote system. 
E 7
I 7
.Tp Ic \&~#
Send a BREAK to the remote system.
E 11
I 11
D 13
.It Ic \&~
E 13
I 13
.It Ic \&~|
E 13
Pipe the output from a remote command to a local
.Ux
process.
The command string sent to the local
.Ux
system is processed by the shell.
.It Ic \&~$
Pipe the output from a local
.Ux
process to the remote host.
The command string sent to the local
.Ux
system is processed by the shell.
I 13
.It Ic \&~C
Fork a child process on the local system to perform special protocols
such as \s-1XMODEM\s+1.  The child program will be run with the following
somewhat unusual arrangement of file descriptors:
.nf
.in +1i
0 <-> local tty in
1 <-> local tty out
2 <-> local tty out
3 <-> remote tty in
4 <-> remote tty out
.in -1i
.fi
E 13
.It Ic \&~#
Send a
.Dv BREAK
to the remote system.
E 11
E 7
For systems which don't support the
necessary
D 7
.I ioctl
E 7
I 7
.Ar ioctl
E 7
call the break is simulated by a sequence of line speed changes
D 11
and DEL characters.
D 7
.TP 10
.B ~s
E 7
I 7
.Tp Ic \&~s
E 11
I 11
and
.Dv DEL
characters.
.It Ic \&~s
E 11
E 7
Set a variable (see the discussion below).
D 7
.TP 10
.B ~^Z
E 7
I 7
D 11
.Tp Ic \&~^Z
E 11
I 11
.It Ic \&~^Z
E 11
E 7
Stop
D 7
.I tip
E 7
I 7
.Nm tip
E 7
(only available with job control).
D 7
.TP 10
I 5
.B ~^Y
E 7
I 7
D 11
.Tp Ic \&~^Y
E 11
I 11
.It Ic \&~^Y
E 11
E 7
Stop only the ``local side'' of
D 7
.I tip
E 7
I 7
.Nm tip
E 7
(only available with job control);
the ``remote side'' of
D 7
.IR tip ,
E 7
I 7
.Nm tip  ,
E 7
the side that displays output from the remote host, is left running.
D 7
.TP 10
E 5
.B ~?
E 7
I 7
D 11
.Tp Ic \&~?
E 11
I 11
.It Ic \&~?
E 11
E 7
Get a summary of the tilde escapes
D 7
.sp
E 2
.PP
D 2
.BR \-a " /dev/cua0"
.BR \-l " /dev/cul0"
E 2
I 2
.I Tip
E 7
I 7
D 11
.Tp
E 11
I 11
.El
E 11
.Pp
.Nm Tip
E 7
D 8
uses the file /etc/remote to find how to reach a particular
E 8
I 8
uses the file
.Pa /etc/remote
to find how to reach a particular
E 8
system and to find out how it should operate while talking
to the system;
refer to
D 7
.IR remote (5)
E 7
I 7
.Xr remote  5
E 7
for a full description.
Each system has a default baud rate with which to
establish a connection.  If this value is not suitable, the baud rate
D 11
to be used may be specified on the command line, e.g. ``tip -300 mds''.
E 11
I 11
to be used may be specified on the command line, e.g.
.Ql "tip -300 mds" .
E 11
E 2
D 7
.PP
E 7
I 7
.Pp
E 7
D 2
The
.BI \- n
option, where
.I n
is a single digit,
changes the last character of the ACU and communications line to
.IR n .
It is an abbreviation for
.BI "\-a /dev/cua" n " \-l /dev/cul" n .
E 2
I 2
When
D 7
.I tip
E 7
I 7
.Nm tip
E 7
establishes a connection it sends out a
connection message to the remote system; the default value, if any,
D 7
is defined in /etc/remote.
E 2
.PP
E 7
I 7
is defined in
D 8
.Pa /etc/remote (see
E 8
I 8
.Pa /etc/remote
(see
E 8
.Xr remote 5 ) .
.Pp
E 7
D 2
After making the connection,
.I cu
runs as two processes:
the
.I send
process reads the standard input and
passes most of it to the remote system;
the
.I receive
process reads from the remote system and passes
most data to the standard output.
Lines beginning with `~' have special meanings.
E 2
I 2
When
D 7
.I tip
E 7
I 7
.Nm tip
E 7
prompts for an argument (e.g. during setup of
a file transfer) the line typed may be edited with the standard
erase and kill characters.  A null line in response to a prompt,
or an interrupt, will abort the dialogue and return you to the
remote machine.
E 2
D 7
.PP
D 2
The
.I send
process interprets the following:
.TP 18
~\|\fB.\|
terminate the conversation.
.br
.ns
.TP 18
~EOT
terminate the conversation
.TP 18
~<file
send the contents of
.I file
to the remote system,
as though typed at the terminal.
.TP 18
\~^Z
suspend the cu process.
Note that the control-Z must be followed by a newline.
.TP 18
\~#
sends a break.
.TP 18
~!
invoke an interactive shell on the local system.
.TP 18
~!cmd ...
run the command on the local system
(via
.BR "sh \-c" ")."
.TP 18
~$cmd ...
run the command locally and send its output
to the remote system.
.TP 18
~%take from [to]
copy file `from' (on the remote system)
to file `to' on the local system.
If `to' is omitted,
the `from' name is used both places.
.TP 18
~%put from [to]
copy file `from' (on local system)
to file `to' on remote system.
If `to' is omitted, the `from' name is used both places.
.TP 18
~:
during an output diversion, this toggles whether the operation of
.I cu
will be silent, i.e., whether information received from the foreign
system will be written to the standard output.
This allows a ``progress report'' during long transfers.
.TP 18
~~\fB\|.\|.\|.\fR
send
the line `~\|.\|.\|.'.
E 2
I 2
.I Tip
E 7
I 7
.Pp
.Nm Tip
E 7
guards against multiple users connecting to a remote system
by opening modems and terminal lines with exclusive access,
and by honoring the locking protocol used by
D 7
.IR uucp (1C).
E 2
.PP
D 2
Both the
.I send
and
.I receive
processes handles output diversions of the following form:
E 2
I 2
During file transfers 
.I tip
E 7
I 7
D 13
.Xr uucp 1 .
E 13
I 13
.Xr uucico 8 .
E 13
.Pp
During file transfers
.Nm tip
E 7
provides a running count of the number of lines transferred.
When using the ~> and ~< commands, the ``eofread'' and ``eofwrite''
variables are used to recognize end-of-file when reading, and
specify end-of-file when writing (see below).  File transfers
normally depend on tandem mode for flow control.  If the remote
system does not support tandem mode, ``echocheck'' may be set
to indicate
D 7
.I tip
E 7
I 7
.Nm tip
E 7
should synchronize with the remote system on the echo of each
transmitted character.
E 2
D 7
.PP
E 7
I 7
.Pp
E 7
D 2
\&~>[>][:]file
.br
zero or more lines to be written to file
.br
\&~>
E 2
I 2
When
D 7
.I tip
E 7
I 7
.Nm tip
E 7
must dial a phone number to connect to a system it will print
various messages indicating its actions.
D 7
.I Tip
E 7
I 7
.Nm Tip
E 7
D 11
supports the DEC DN-11 and Racal-Vadic 831 auto-call-units;
the DEC DF02 and DF03, Ventel 212+, Racal-Vadic 3451, and
E 11
I 11
supports the
.Tn DEC DN Ns-11
and
Racal-Vadic 831 auto-call-units;
the
.Tn DEC DF Ns \&02
and
.Tn DF Ns \&03 ,
Ventel 212+, Racal-Vadic 3451, and
E 11
Bizcomp 1031 and 1032 integral call unit/modems.
E 2
D 7
.PP
D 2
In any case, output is diverted (or appended, if `>>' used) to the file.
If `:' is used,
the diversion is
.I silent,
i.e., it is written only to the file.
If `:' is omitted,
output is written both to the file and to the standard output.
The trailing `~>' terminates the diversion.
E 2
I 2
.SM
.B VARIABLES
E 2
.PP
D 2
The use of
.B  ~%put
requires
.I stty
E 2
I 2
.I Tip
E 7
I 7
.Ss VARIABLES
.Nm Tip
E 7
maintains a set of
D 7
.I variables
E 7
I 7
.Ar variables
E 7
which control its operation.
D 14
Some of these variable are read-only to normal users (root is allowed
E 14
I 14
Some of these variables are read-only to normal users (root is allowed
E 14
to change anything of interest).  Variables may be displayed
and set through the ``s'' escape.  The syntax for variables is patterned
after
D 7
.IR vi (1)
E 7
I 7
.Xr vi  1
E 7
E 2
and
D 2
.I cat
on the remote side.
It also requires that the
current erase and kill characters on the remote
system be identical to the current ones on the local system.
Backslashes are inserted at appropriate places.
E 2
I 2
D 7
.IR Mail (1).
E 7
I 7
.Xr Mail  1  .
E 7
Supplying ``all''
as an argument to the set command displays all variables readable by
the user.  Alternatively, the user may request display of a particular
variable by attaching a `?' to the end.  For example ``escape?''
displays the current escape character.
E 2
D 7
.PP
E 7
I 7
.Pp
E 7
D 2
The use of
.B  ~%take
requires the existence of
.I echo
and
.I tee
on the remote system.
Also,
.B "stty tabs"
mode is required on the remote system if
tabs are to be copied without expansion.
.PP
Finally, the
.BR \-b
flag specifies that nulls are to be turned into breaks.
This allows the break key (and also control-shift-@) to send a break.
.SH FILES
/dev/cua0
E 2
I 2
Variables are numeric, string, character, or boolean values.  Boolean
variables are set merely by specifying their name; they may be reset
by prepending a `!' to the name.  Other variable types are set by
concatenating an `=' and the value.  The entire assignment must not
have any blanks in it.  A single set command may be used to interrogate
as well as set a number of variables.
Variables may be initialized at run time by placing set commands
(without the ``~s'' prefix in a file
D 7
.I .tiprc
E 7
I 7
.Pa .tiprc
E 7
in one's home directory).  The
D 7
.B \-v
E 7
I 7
.Fl v
E 7
option causes
D 7
.I tip
E 7
I 7
.Nm tip
E 7
to display the sets as they are made.
D 7
Certain common variables have abbreviations. 
E 7
I 7
Certain common variables have abbreviations.
E 7
The following is a list of common variables,
their abbreviations, and their default values.
D 7
.TP
.B beautify
.br
E 7
I 7
D 11
.Tw Ar
.Tp Ar beautify
E 11
I 11
.Bl -tag -width Ar
.It Ar beautify
E 11
E 7
(bool) Discard unprintable characters when a session is being scripted;
D 7
abbreviated 
.IR be .
.TP
.B baudrate
.br
E 7
I 7
abbreviated
.Ar be  .
D 11
.Tp Ar baudrate
E 11
I 11
.It Ar baudrate
E 11
E 7
(num) The baud rate at which the connection was established;
abbreviated
D 7
.IR ba .
.TP
.B dialtimeout
.br
E 7
I 7
.Ar ba  .
D 11
.Tp Ar dialtimeout
E 11
I 11
.It Ar dialtimeout
E 11
E 7
(num) When dialing a phone number, the time (in seconds)
to wait for a connection to be established; abbreviated
D 7
.IR dial .
.TP
.B echocheck
.br
E 7
I 7
.Ar dial  .
D 11
.Tp Ar echocheck
E 11
I 11
.It Ar echocheck
E 11
E 7
(bool) Synchronize with the remote host during file transfer by
waiting for the echo of the last character transmitted; default is
D 7
.IR off .
.TP
.B eofread
.br
E 7
I 7
.Ar off  .
D 11
.Tp Ar eofread
E 11
I 11
.It Ar eofread
E 11
E 7
D 14
(str) The set of characters which signify and end-of-tranmission
E 14
I 14
D 15
(str) The set of characters which signify an end-of-tranmission
E 15
I 15
(str) The set of characters which signify an end-of-transmission
E 15
E 14
during a ~< file transfer command; abbreviated
D 7
.IR eofr .
.TP
.B eofwrite
.br
E 7
I 7
.Ar eofr  .
D 11
.Tp Ar eofwrite
E 11
I 11
.It Ar eofwrite
E 11
E 7
(str) The string sent to indicate end-of-transmission during
a ~> file transfer command; abbreviated
D 7
.IR eofw .
.TP
.B eol
.br
E 7
I 7
.Ar eofw  .
D 11
.Tp Ar eol
E 11
I 11
.It Ar eol
E 11
E 7
(str) The set of characters which indicate an end-of-line.
D 7
.I Tip
E 7
I 7
.Nm Tip
E 7
will recognize escape characters only after an end-of-line.
D 7
.TP
.B escape
.br
E 7
I 7
D 11
.Tp Ar escape
E 11
I 11
.It Ar escape
E 11
E 7
(char) The command prefix (escape) character; abbreviated
D 7
.IR es ;
E 7
I 7
.Ar es  ;
E 7
default value is `~'.
D 7
.TP
.B exceptions
.br
E 7
I 7
D 11
.Tp Ar exceptions
E 11
I 11
.It Ar exceptions
E 11
E 7
(str) The set of characters which should not be discarded
due to the beautification switch; abbreviated
D 7
.IR ex ;
E 7
I 7
.Ar ex  ;
E 7
default value is ``\et\en\ef\eb''.
D 7
.TP
.B force
.br
E 7
I 7
D 11
.Tp Ar force
E 11
I 11
.It Ar force
E 11
E 7
(char) The character used to force literal data transmission;
abbreviated
D 7
.IR fo ;
E 7
I 7
.Ar fo  ;
E 7
default value is `^P'.
D 7
.TP
.B framesize
.br
E 7
I 7
D 11
.Tp Ar framesize
E 11
I 11
.It Ar framesize
E 11
E 7
(num) The amount of data (in bytes) to buffer between file system
writes when receiving files; abbreviated
D 7
.IR fr .
.TP
.B host
.br
E 7
I 7
.Ar fr  .
D 11
.Tp Ar host
E 11
I 11
.It Ar host
E 11
E 7
(str) The name of the host to which you are connected; abbreviated
D 7
.IR ho .
.TP
.B prompt
.br
E 7
I 7
.Ar ho  .
D 11
.Tp Ar prompt
E 11
I 11
.It Ar prompt
E 11
E 7
D 14
(char) The character which indicates and end-of-line on the remote
E 14
I 14
(char) The character which indicates an end-of-line on the remote
E 14
host; abbreviated
D 7
.IR pr ;
E 7
I 7
.Ar pr  ;
E 7
default value is `\en'.  This value is used to synchronize during
data transfers.  The count of lines transferred during a file transfer
D 14
command is based on recipt of this character.
E 14
I 14
command is based on receipt of this character.
E 14
D 7
.TP
.B raise
.br
(bool) Upper case mapping mode; abbreviated 
.IR ra ;
default value is 
.IR off .
E 7
I 7
D 11
.Tp Ar raise
E 11
I 11
.It Ar raise
E 11
(bool) Upper case mapping mode; abbreviated
.Ar ra  ;
default value is
.Ar off  .
E 7
When this mode is enabled, all lower case letters will be mapped to
upper case by
D 7
.I tip
E 7
I 7
.Nm tip
E 7
for transmission to the remote machine.
D 7
.TP
.B raisechar
.br
E 7
I 7
D 11
.Tp Ar raisechar
E 11
I 11
.It Ar raisechar
E 11
E 7
(char) The input character used to toggle upper case mapping mode;
abbreviated
D 7
.IR rc ;
E 7
I 7
.Ar rc  ;
E 7
default value is `^A'.
D 7
.TP
.B record
.br
E 7
I 7
D 11
.Tp Ar record
E 11
I 11
.It Ar record
E 11
E 7
(str) The name of the file in which a session script is recorded;
abbreviated
D 7
.IR rec ;
E 7
I 7
.Ar rec  ;
E 7
default value is ``tip.record''.
D 7
.TP
.B script
.br
E 7
I 7
D 11
.Tp Ar script
E 11
I 11
.It Ar script
E 11
E 7
(bool) Session scripting mode; abbreviated
D 7
.IR sc ;
default is 
.IR off .
E 7
I 7
.Ar sc  ;
default is
.Ar off  .
E 7
When
D 7
.I script
is 
.IR true ,
.I tip
E 7
I 7
.Ar script
is
.Li true  ,
.Nm tip
E 7
will record everything transmitted by the remote machine in
the script record file specified in
D 7
.IR record .
E 7
I 7
.Ar record  .
E 7
If the
D 7
.I beautify
E 7
I 7
.Ar beautify
E 7
D 11
switch is on, only printable ASCII characters will be included in
E 11
I 11
switch is on, only printable
.Tn ASCII
characters will be included in
E 11
the script file (those characters betwee 040 and 0177).  The
variable
D 7
.I exceptions
E 7
I 7
.Ar exceptions
E 7
is used to indicate characters which are an exception to the normal
beautification rules.
D 7
.TP
.B tabexpand
E 2
.br
E 7
I 7
D 11
.Tp Ar tabexpand
E 11
I 11
.It Ar tabexpand
E 11
E 7
D 2
/dev/cul0
E 2
I 2
(bool) Expand tabs to spaces during file transfers; abbreviated
D 7
.IR tab ;
E 7
I 7
.Ar tab  ;
E 7
default value is
D 7
.IR false .
E 7
I 7
.Ar false  .
E 7
Each tab is expanded to 8 spaces.
D 7
.TP
.B verbose
E 2
.br
E 7
I 7
D 11
.Tp Ar verbose
E 11
I 11
.It Ar verbose
E 11
E 7
D 2
/dev/null
E 2
I 2
(bool) Verbose mode; abbreviated
D 7
.IR verb ;
default is 
.IR true .
When verbose mode is enabled, 
.I tip
E 7
I 7
.Ar verb  ;
default is
.Ar true  .
When verbose mode is enabled,
.Nm tip
E 7
prints messages while dialing, shows the current number
of lines transferred during a file transfer operations,
and more.
D 7
.TP
.B SHELL
E 2
.br
E 7
I 7
D 11
.Tp
E 11
I 11
.El
E 11
.Sh ENVIRONMENT
.Nm Tip
D 8
uses the followinf environment variables:
.Tp Ar SHELL
E 8
I 8
uses the following environment variables:
D 11
.Tw Fl
.Tp Ev SHELL
E 11
I 11
.Bl -tag -width Fl
.It Ev SHELL
E 11
E 8
E 7
D 2
/usr/spool/uucp/LCK..cu[al][0-7]
.SH "SEE ALSO"
rv(4), tty(4)
E 2
I 2
(str) The name of the shell to use for the ~! command; default
value is ``/bin/sh'', or taken from the environment.
D 7
.TP
.B HOME
.br
E 7
I 7
D 8
.Tp Ar HOME
E 8
I 8
D 11
.Tp Ev HOME
E 11
I 11
.It Ev HOME
E 11
E 8
E 7
(str) The home directory to use for the ~c command; default
value is taken from the environment.
D 7
.PP
.SH FILES
.ta \w'/usr/spool/uucp/LCK..*   'u
.nf
/etc/remote	global system descriptions
/etc/phones	global phone number data base
${REMOTE}	private system descriptions
${PHONES}	private phone numbers
~/.tiprc	initialization file.
/usr/spool/uucp/LCK..*	lock file to avoid conflicts with \fIuucp\fP
.fi
E 2
.SH DIAGNOSTICS
E 7
I 7
D 8
.Tp Ar HOST
E 8
I 8
D 11
.Tp Ev HOST
E 11
I 11
.It Ev HOST
E 11
E 8
Check for a default host if none specified.
D 11
.Tp
E 11
I 11
.El
E 11
.Pp
The variables
.Ev ${REMOTE}
and
.Ev ${PHONES}
are also exported.
.Sh FILES
D 11
.Dw /var/spool/uucp/LCK..*
.Di L
.Dp Pa /etc/remote
global system descriptions
.Dp Pa /etc/phones
global phone number data base
.Dp ${REMOTE}
private system descriptions
.Dp ${PHONES}
private phone numbers
.Dp ~/.tiprc
initialization file.
I 8
.Dp Pa tip.record
record file
E 8
.Dp /var/log/aculog
line access log
.Dp Pa /var/spool/uucp/LCK..*
lock file to avoid conflicts with
.Xr uucp
.Dp
E 11
I 11
.Bl -tag -width /var/spool/uucp/LCK..* -compact
.It Pa /etc/remote
Global system descriptions.
.It Pa /etc/phones
Global phone number data base.
.It ${REMOTE}
Private system descriptions.
.It ${PHONES}
Private phone numbers.
.It ~/.tiprc
Initialization file.
.It Pa tip.record
Record file.
.It /var/log/aculog
Line access log.
.It Pa /var/spool/uucp/LCK..*
Lock file to avoid conflicts with
.Xr uucp .
.El
E 11
.Sh DIAGNOSTICS
E 7
D 2
Exit code is
zero for normal exit,
nonzero (various values) otherwise.
E 2
I 2
Diagnostics are, hopefully, self explanatory.
D 7
.SH "SEE ALSO"
D 6
remote(5),
phones(5)
E 6
I 6
remote(5), phones(5)
E 6
E 2
.SH BUGS
E 7
I 7
.Sh SEE ALSO
.Xr remote 5 ,
.Xr phones 5
.Sh HISTORY
D 11
.Nm Tip
appeared in 4.2 BSD.
E 11
I 11
The
.Nm tip
appeared command in
.Bx 4.2 .
E 11
.Sh BUGS
E 7
D 2
Only
.IR mail (1)
uses syntax anything like the syntax of
.I cu.
E 2
I 2
The full set of variables is undocumented and should, probably, be
D 14
paired down.
E 14
I 14
pared down.
E 14
E 2
E 1
