usr.bin/nfsstat/SCCS/s.nfsstat.1
h37997
s 00002/00002/00060
d D 8.1 93/06/06 15:45:29 bostic 10 9
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00003/00003/00059
d D 5.8 93/03/23 18:57:54 cael 9 8
c update .Os and history from .Ud to .Bx 4.4
e
s 00003/00002/00059
d D 5.7 91/07/30 18:26:21 cael 8 7
c formalize HISTORY
e
s 00025/00025/00036
d D 5.6 91/04/23 17:52:42 bostic 7 6
c consistency/cleanup/ANSI/lint pass -- add -M, -N
e
s 00020/00020/00041
d D 5.5 91/04/22 18:44:41 cael 6 5
c converted to version 3 mdoc; add -i option (bostic)
e
s 00003/00001/00058
d D 5.4 91/03/14 00:23:39 cael 5 3
c add .Vx so tmac.andoc will call tmac.mdoc-old
e
s 00001/00000/00059
d R 5.4 91/03/13 20:36:01 cael 4 3
c add .Vx so tmac.andoc will call tmac.mdoc-old
e
s 00000/00000/00059
d D 5.3 90/07/24 22:49:26 cael 3 2
c .Xr botch fix
e
s 00046/00044/00013
d D 5.2 90/06/11 05:57:50 cael 2 1
c converted man page
e
s 00057/00000/00000
d D 5.1 89/07/16 15:54:08 mckusick 1 0
c date and time created 89/07/16 15:54:08 by mckusick
e
u
U
t
T
I 1
D 2
.\" Copyright (c) 1989 The Regents of the University of California.
E 2
I 2
D 10
.\" Copyright (c) 1989, 1990 The Regents of the University of California.
E 2
.\" All rights reserved.
E 10
I 10
.\" Copyright (c) 1989, 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 10
.\"
D 2
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 2
I 2
.\" %sccs.include.redist.man%
E 2
.\"
D 2
.\"	%W% (Berkeley) %G%
E 2
I 2
.\"     %W% (Berkeley) %G%
E 2
.\"
I 5
D 6
.Vx
.Vx
E 6
E 5
D 2
.TH NFSSTAT 1 "%Q%"
.UC 7
.SH NAME
nfsstat \- report NFS statistics
.SH SYNOPSIS
.B nfsstat
[
.B interval
[
.B system
[
.B corefile
] ] ]
.SH DESCRIPTION
.I Nfsstat
E 2
I 2
.Dd %Q%
.Dt NFSSTAT 1
D 5
.Os BSD 4.4
E 5
I 5
D 9
.Os
E 9
I 9
.Os BSD 4.4
E 9
E 5
.Sh NAME
.Nm nfsstat
D 6
.Nd report NFS statistics
E 6
I 6
.Nd display
.Tn NFS
statistics
E 6
.Sh SYNOPSIS
.Nm nfsstat
D 6
.Ob
.Ar interval
E 6
I 6
D 7
.Op Fl i
E 6
.Op Ar system Op Ar corefile
E 7
I 7
.Op Fl M Ar core
.Op Fl N Ar system
.Op Fl w Ar wait
E 7
D 6
.Oe
E 6
.Sh DESCRIPTION
.Nm Nfsstat
E 2
D 6
delves into the system and normally reports certain statistics kept about
D 2
.SM NFS
E 2
I 2
.Li NFS
E 6
I 6
displays statistics kept about
.Tn NFS
E 6
E 2
client and server activity.
D 6
If
E 6
I 6
.Pp
The options are as follows:
.Bl -tag -width Ds
D 7
.It Fl i
Subsequent lines are summaries over the last
E 6
D 2
.I interval
E 2
I 2
.Ar interval
E 2
D 6
is specified, then successive lines are summaries over the last
D 2
.I interval
E 2
I 2
.Ar interval
E 6
E 2
seconds.
D 2
The command ``nfsstat 5'' will print what
.SM NFS
E 2
I 2
The command
.Dq Li nfsstat 5
will print what
E 7
I 7
.It Fl M
Extract values associated with the name list from the specified core
instead of the default
.Pa /dev/kmem .
.It Fl N
Extract the name list from the specified system instead of the default
.Pa /vmunix .
.It Fl w
Display a shorter summary of
E 7
D 6
.Li NFS
E 6
I 6
.Tn NFS
E 6
E 2
D 7
is doing every five seconds.
E 7
I 7
activity for both the client and server at
.Ar wait
second intervals.
E 7
I 6
.El
E 6
D 2
.PP
A second argument is taken 
E 2
I 2
D 7
.Pp
D 6
A second argument is taken
E 2
to be the file containing the system's namelist.
E 6
I 6
A second argument is taken to be the file containing the system's namelist.
E 6
D 2
Otherwise, /vmunix is used.
E 2
I 2
Otherwise,
.Pa /vmunix
is used.
E 2
A third argument tells
D 2
.I nfsstat
E 2
I 2
.Nm nfsstat
E 2
where to look for
D 2
.IR core .
Otherwise, /dev/kmem is used.
.SH FILES
/dev/kmem, /vmunix
.SH SEE ALSO
.IR netstat (1),
.IR vmstat (1)
E 2
I 2
.Pa core  .
Otherwise,
.Pa /dev/kmem
is used.
E 7
.Sh FILES
D 6
.Dw /dev/kmem
.Di L
.Dp Pa /dev/kmem
.Dp Pa /vmunix
.Dp
E 6
I 6
.Bl -tag -width /dev/kmem -compact
D 7
.It Pa /dev/kmem
E 7
.It Pa /vmunix
I 7
default kernel namelist
.It Pa /dev/kmem
default memory file
E 7
.El
E 6
.Sh SEE ALSO
D 7
.Xr netstat  1  ,
.Xr vmstat  1
E 7
I 7
.Xr fstat 1 ,
.Xr netstat 1 ,
.Xr ps 1 ,
.Xr systat 1 ,
.Xr vmstat 1 ,
.Xr iostat 8 ,
.Xr pstat 8 ,
E 7
.Sh HISTORY
D 8
.Nm Nfsstat
D 6
appears in 4.4 BSD.
E 6
I 6
is
E 8
I 8
The
.Nm nfsstat
D 9
command is
E 8
.Ud .
E 9
I 9
command appears in
.Bx 4.4 .
E 9
E 6
E 2
E 1
