sbin/tunefs/SCCS/s.tunefs.8
h27370
s 00030/00002/00110
d D 8.3 95/05/03 15:08:32 mckusick 11 10
c add description for -A, -N, and -t
e
s 00001/00001/00111
d D 8.2 93/12/11 23:43:24 mckusick 10 9
c copyediting for Usenix manuals
e
s 00002/00002/00110
d D 8.1 93/06/05 11:25:50 bostic 9 8
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00001/00000/00111
d D 6.7 92/08/20 14:15:42 bostic 8 7
c add dumpfs to see all section
e
s 00058/00039/00053
d D 6.6 91/03/16 17:09:11 cael 7 6
c macro and text revision (-mdoc version 3)
e
s 00001/00001/00091
d D 6.5 90/06/24 21:56:52 trent 6 5
c new pathname (tunefs)
e
s 00004/00003/00088
d D 6.4 86/05/22 13:27:30 mckusick 5 4
c explain it clearly
e
s 00003/00002/00088
d D 6.3 86/05/21 22:10:31 mckusick 4 3
c update citations
e
s 00016/00003/00074
d D 6.2 85/09/12 00:02:15 mckusick 3 2
c allow specification of optimization preference
e
s 00001/00001/00076
d D 6.1 85/04/27 16:00:42 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00077/00000/00000
d D 5.1 85/04/27 16:00:34 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
D 7
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 7
I 7
D 9
.\" Copyright (c) 1983, 1991 Regents of the University of California.
.\" All rights reserved.
E 9
I 9
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 9
E 7
.\"
D 7
.\"	%W% (Berkeley) %G%
E 7
I 7
.\" %sccs.include.redist.man%
E 7
.\"
D 2
.TH TUNEFS 8 "20 February 1983"
E 2
I 2
D 7
.TH TUNEFS 8 "%Q%"
E 2
.UC 5
.SH NAME
tunefs \- tune up an existing file system
.SH SYNOPSIS
D 6
.B /etc/tunefs
E 6
I 6
.B tunefs
E 6
.I tuneup-options
.IR special | filesys
.SH DESCRIPTION
.I Tunefs
E 7
I 7
.\"     %W% (Berkeley) %G%
.\"
.Dd %Q%
.Dt TUNEFS 8
.Os BSD 4.2
.Sh NAME
.Nm tunefs
.Nd tune up an existing file system
.Sh SYNOPSIS
.Nm tunefs
I 11
.Op Fl AN
E 11
.Op Fl a Ar maxcontig
.Op Fl d Ar rotdelay
.Op Fl e Ar maxbpg
.Op Fl m Ar minfree
.Bk -words
.Op Fl o Ar optimize_preference
.Ek
I 11
.Op Fl t Ar trackskew
E 11
.Op Ar special | Ar filesys
.Sh DESCRIPTION
D 11
.Nm Tunefs
E 7
is designed to change the dynamic parameters of a file system
E 11
I 11
The
.Nm tunefs
program is designed to change the dynamic parameters of a file system
E 11
which affect the layout policies.
I 11
The
.Fl N
flag displays all the settable options
(after any changes from the tuning options)
but does not cause any of them to be changed.
The
.Fl A
flag causes the values to be updated in all the alternate
superblocks instead of just the standard superblock.
If this option is not used,
then use of a backup superblock by
.Xr fsck 8
will lose anything changed by
.Nm tunefs .
The
.Fl A
flag is ignored when the
.Fl N
flag is specified.
.Pp
E 11
The parameters which are to be changed are indicated by the flags
given below:
D 7
.IP "\fB\-a\fP maxcontig"
.br
E 7
I 7
.Bl -tag -width Ds
.It Fl a Ar maxcontig
E 7
This specifies the maximum number of contiguous blocks that will
D 7
be laid out before forcing a rotational delay (see \-d below).
E 7
I 7
be laid out before forcing a rotational delay (see
.Fl d
below).
E 7
The default value is one, since most device drivers require
an interrupt per disk transfer.
Device drivers that can chain several buffers together in a single
transfer should set this to the maximum chain length.
D 7
.IP "\fB\-d\fP rotdelay"
.br
E 7
I 7
.It Fl d Ar rotdelay
E 7
This specifies the expected time (in milliseconds)
to service a transfer completion
interrupt and initiate a new transfer on the same disk.
It is used to decide how much rotational spacing to place between
successive blocks in a file.
D 7
.IP "\fB\-e\fP maxbpg"
.br
E 7
I 7
.It Fl e Ar maxbpg
E 7
This indicates the maximum number of blocks any single file can
allocate out of a cylinder group before it is forced to begin
allocating blocks from another cylinder group.
Typically this value is set to about one quarter of the total blocks
in a cylinder group.
The intent is to prevent any single file from using up all the
blocks in a single cylinder group,
D 7
thus degrading access times for all files subsequently allocated 
E 7
I 7
thus degrading access times for all files subsequently allocated
E 7
in that cylinder group.
The effect of this limit is to cause big files to do long seeks
more frequently than if they were allowed to allocate all the blocks
in a cylinder group before seeking elsewhere.
D 7
For file systems with exclusively large files, 
E 7
I 7
For file systems with exclusively large files,
E 7
this parameter should be set higher.
D 7
.IP "\fB\-m\fP minfree"
.br
E 7
I 7
.It Fl m Ar minfree
E 7
This value specifies the percentage of space held back
from normal users; the minimum free space threshold.
The default value used is 10%.
This value can be set to zero, however up to a factor of three
in throughput will be lost over the performance obtained at a 10%
threshold.
Note that if the value is raised above the current usage level,
users will be unable to allocate files until enough files have
been deleted to get under the higher threshold.
I 3
D 7
.IP "\fB\-o\fP optimization preference"
.br
E 7
I 7
.It Fl o Ar optimize_preference
E 7
The file system can either try to minimize the time spent
D 10
allocating blocks, or it can attempt minimize the space
E 10
I 10
allocating blocks, or it can attempt to minimize the space
E 10
fragmentation on the disk.
If the value of minfree (see above) is less than 10%,
then the file system should optimize for space to avoid
running out of full sized blocks.
For values of minfree greater than or equal to 10%,
fragmentation is unlikely to be problematical, and
the file system can be optimized for time.
I 11
.It Fl t Ar trackskew
This specifies the skew in sectors from one track to the next in a cylinder.
The default value is zero, indicating that each track in a cylinder begins at
the same rotational position.
E 11
E 3
D 7
.SH "SEE ALSO"
fs(5),
newfs(8),
mkfs(8)
.PP
D 3
McKusick, Joy, Leffler; "A Fast File System for Unix",
Computer Systems Research Group, Dept of EECS, Berkeley, CA 94720;
TR #7, September 1982.
E 3
I 3
M. McKusick, W. Joy, S. Leffler, R. Fabry,
``A Fast File System for UNIX'',
\fIACM Transactions on Computer Systems 2\fP, 3.
pp 181-197, August 1984.
D 4
(reprinted in the System Manager's Manual and in Volume 2c)
E 4
I 4
(reprinted in the System Manager's Manual, SMM:14)
E 4
E 3
.SH BUGS
E 7
I 7
.El
.Sh SEE ALSO
.Xr fs 5 ,
I 8
.Xr dumpfs 8 ,
I 11
.Xr fsck 8 ,
E 11
E 8
.Xr newfs 8 ,
.Xr mkfs 8
.Rs
.%A M. McKusick
.%A W. Joy
.%A S. Leffler
.%A R. Fabry
.%T "A Fast File System for UNIX"
.%J "ACM Transactions on Computer Systems 2"
.%N 3
.%P pp 181-197
.%D August 1984
.%O "(reprinted in the BSD System Manager's Manual, SMM:5)"
.Re
.Sh BUGS
E 7
This program should work on mounted and active file systems.
Because the super-block is not kept in the buffer cache,
D 5
the program will only take effect if it is run on dismounted file systems.
D 4
(if run on the root file system, the system must be rebooted)
E 4
I 4
To take effect on the root file system, the system must be rebooted
after being tuned.
E 5
I 5
the changes will only take effect if the program
is run on dismounted file systems.
To change the root file system, the system must be rebooted
after the file system is tuned.
E 5
E 4
D 7
.PP
E 7
I 7
.Pp
E 7
You can tune a file system, but you can't tune a fish.
I 7
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.2 .
E 7
E 1
