usr.bin/from/SCCS/s.from.1
h45859
s 00001/00001/00056
d D 8.2 93/12/30 15:38:41 mckusick 12 11
c copyediting for Usenix manuals
e
s 00002/00002/00055
d D 8.1 93/06/06 14:40:09 bostic 11 10
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00019/00025/00038
d D 6.7 91/07/26 19:11:23 cael 10 9
c mdoc version three
e
s 00002/00000/00061
d D 6.6 91/03/14 00:17:35 cael 9 7
c add .Vx so tmac.andoc will call tmac.mdoc-old
e
s 00001/00000/00061
d R 6.6 91/03/13 20:33:17 cael 8 7
c add .Vx so tmac.andoc will call tmac.mdoc-old
e
s 00000/00000/00061
d D 6.5 90/07/24 22:45:24 cael 7 6
c .Xr botch fix
e
s 00057/00041/00004
d D 6.4 90/06/24 19:04:14 cael 6 5
c converted man page
e
s 00027/00015/00018
d D 6.3 88/09/29 10:13:35 bostic 5 4
c add Berkeley copyright, -f flag
e
s 00001/00001/00032
d D 6.2 86/04/20 05:19:01 lepreau 4 3
c prmail is gone
e
s 00001/00001/00032
d D 6.1 85/04/29 14:25:53 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00001/00001/00032
d D 5.1 85/04/29 14:25:46 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00033/00000/00000
d D 4.1 85/04/29 14:25:39 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
D 5
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 5
I 5
D 6
.\" Copyright (c) 1980 The Regents of the University of California.
E 6
I 6
D 11
.\" Copyright (c) 1980, 1990 The Regents of the University of California.
E 6
.\" All rights reserved.
E 11
I 11
.\" Copyright (c) 1980, 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 11
E 5
.\"
I 5
D 6
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 6
I 6
D 10
.\" %sccs.include.redist.man%
E 10
I 10
.\" %sccs.include.redist.roff%
E 10
E 6
.\"
E 5
D 6
.\"	%W% (Berkeley) %G%
E 6
I 6
D 10
.\"     %W% (Berkeley) %G%
E 10
I 10
.\"	%W% (Berkeley) %G%
E 10
E 6
.\"
I 9
D 10
.Vx
.Vx
E 10
E 9
D 2
.TH FROM 1
E 2
I 2
D 3
.TH FROM 1 "18 January 1983"
E 3
I 3
D 6
.TH FROM 1 "%Q%"
E 3
E 2
.UC 4
.SH NAME
D 5
from \- who is my mail from?
E 5
I 5
from \- who is mail from?
E 5
.SH SYNOPSIS
.B from
[
.B \-s
sender
D 5
]
[
user
]
E 5
I 5
][
.B \-f
file ] [ user ]
E 5
.SH DESCRIPTION
.I From
D 5
prints out the mail header lines in your mailbox file
to show you who your mail is from.
If
E 5
I 5
prints out the mail header lines from your mailbox.
If either
.I file
or
E 5
.I user
D 5
is specified, then \fIuser\fP's mailbox is examined instead of your own.
If the -s option is given, then only headers for mail sent by
.I sender
are printed.
E 5
I 5
is specified, then the supplied file, or \fIuser\fP's mailbox, is
examined instead of your mailbox.
.PP
If the -s option is given, then only mail from addresses containing
the supplied string are printed.
E 5
.SH FILES
/usr/spool/mail/*
.SH "SEE ALSO"
D 4
biff(1), mail(1), prmail(1)
E 4
I 4
biff(1), mail(1)
E 6
I 6
.Dd %Q%
.Dt FROM 1
.Os BSD 4
.Sh NAME
.Nm from
D 10
.Nd tell who is mail from?
E 10
I 10
.Nd print names of those who have sent mail
E 10
.Sh SYNOPSIS
.Nm from
.Op Fl s Ar sender
.Op Fl f Ar file
.Op Ar user
.Sh DESCRIPTION
.Nm From
prints
D 10
out the mail header lines from your mailbox.
E 10
I 10
out the mail header lines from the invoker's mailbox.
E 10
.Pp
Options:
D 10
.Tw Fl
.Tc Fl f
.Ws
.Ar file
.Cx
E 10
I 10
.Bl -tag -width Fl
.It Fl f Ar file 
E 10
The supplied file
D 10
is examined instead of the your mailbox.
E 10
I 10
is examined instead of the invoker's mailbox.
E 10
If the
.Fl f
option is used, the
.Ar user
argument should not be used.
D 10
.Tc Fl s
.Ws
.Ar sender
.Cx
E 10
I 10
.It Fl s Ar sender 
E 10
Only mail from addresses containing
the
supplied string are printed.
D 10
.Tp
E 10
I 10
.El
E 10
.Pp
If
.Ar user
is given, the
D 10
.Sf Ar user 's
mailbox, is examined instead of your own mailbox.
E 10
I 10
.Ar user Ns 's
mailbox, is examined instead of the invoker's own mailbox.
D 12
(Priviledges are required.)
E 12
I 12
(Privileges are required.)
E 12
E 10
.Sh FILES
D 10
.Dw /var/mail/*
.Di L
.Dp Pa /var/mail/*
.Dp
E 10
I 10
.Bl -tag -width /var/mail/* -compact
.It Pa /var/mail/*
.El
E 10
.Sh SEE ALSO
.Xr biff 1 ,
.Xr mail 1
.Sh HISTORY
D 10
.Nm From
appeared in 3 BSD.
E 10
I 10
The
.Nm from
command appeared in
.Bx 3.0 .
E 10
E 6
E 4
E 1
