usr.sbin/amd/mk-amd-map/SCCS/s.mk-amd-map.8
h06537
s 00000/00000/00033
d D 8.1 93/06/28 07:09:29 bostic 2 1
c 4.4BSD snapshot (revision 8.1)
e
s 00033/00000/00000
d D 5.1 93/06/28 07:09:24 bostic 1 0
c date and time created 93/06/28 07:09:24 by bostic
e
u
U
t
T
I 1
.\" Copyright (c) 1993 Jan-Simon Pendry
.\" Copyright (c) 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" %sccs.include.redist.man%
.\"
.\"     %W% (Berkeley) %G%
.\"
.Dd "%Q%"
.Dt MK-AMD-MAP 8
.Os BSD 4.4
.Sh NAME
.Nm mk-amd-map
.Nd create database maps for Amd
.Sh SYNOPSIS
.Nm
.Op Fl p
.Ar mapname
.Sh DESCRIPTION
.Nm
creates the database maps used by the keyed map lookups in
.Xr amd 8 .
It reads input from the named file
and outputs them to a correspondingly named
hashed database.
.Pp
The
.Fl p
option prints the map on standard output instead of generating
a database.  This is usually used to merge continuation lines
into one physical line.
.Sh SEE ALSO
.Xr amd 8
E 1
