usr.sbin/portmap/SCCS/s.portmap.8
h42442
s 00002/00002/00082
d D 8.1 93/06/06 14:03:30 bostic 4 3
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00052/00042/00032
d D 5.3 91/03/16 18:13:06 cael 3 2
c macro and text revision (-mdoc version 3)
e
s 00027/00014/00047
d D 5.2 90/09/27 10:42:19 mckusick 2 1
c lint (from Torek)
e
s 00061/00000/00000
d D 5.1 90/08/23 15:59:31 mckusick 1 0
c from Sun RPC version 4.0
e
u
U
t
T
I 1
.\" Copyright (c) 1987 Sun Microsystems
D 3
.\" Copyright (c) 1990 The Regents of the University of California.
E 3
I 3
D 4
.\" Copyright (c) 1990, 1991 The Regents of the University of California.
E 3
.\" All rights reserved.
E 4
I 4
.\" Copyright (c) 1990, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 4
.\"
.\" %sccs.include.redist.man%
.\"
D 3
.\"	%W% (Berkeley) %G%
E 3
I 3
.\"     %W% (Berkeley) %G%
E 3
.\"
D 3
.TH PORTMAP 8 "%Q%"
.UC 6
.SH NAME
portmap \- DARPA port to RPC program number mapper
.SH SYNOPSIS
D 2
.B /usr/etc/rpc.portmap
E 2
I 2
.B portmap
[
.B \-d
]
E 2
.SH DESCRIPTION
.IX  "portmap command"  ""  "\fLportmap\fP \(em DARPA to RPC mapper"
.IX  DARPA "to RPC mapper \(em \fLportmap\fP"
D 2
.B portmap
E 2
I 2
.B Portmap
E 3
I 3
.Dd %Q%
.Dt PORTMAP 8
.Os BSD 4.3
.Sh NAME
.Nm portmap
.Nd
.Tn DARPA
port to
.Tn RPC
program number mapper
.Sh SYNOPSIS
.Nm portmap
.Op Fl d
.Sh DESCRIPTION
.Nm Portmap
E 3
E 2
is a server that converts
D 3
.SM RPC
E 3
I 3
.Tn RPC
E 3
program numbers into
D 3
.SM DARPA
E 3
I 3
.Tn DARPA
E 3
protocol port numbers.
It must be running in order to make
D 3
.SM RPC
E 3
I 3
.Tn RPC
E 3
calls.
D 2
.LP
E 2
I 2
D 3
.PP
E 3
I 3
.Pp
E 3
E 2
When an
D 3
.SM RPC
E 3
I 3
.Tn RPC
E 3
server is started, it will tell
D 3
.B portmap
E 3
I 3
.Nm portmap
E 3
what port number it is listening to, and what
D 3
.SM RPC
E 3
I 3
.Tn RPC
E 3
program numbers it is prepared to serve.
When a client wishes to make an
D 3
.SM RPC
E 3
I 3
.Tn RPC
E 3
call to a given program number,
it will first contact
D 3
.B portmap
E 3
I 3
.Nm portmap
E 3
on the server machine to determine
the port number where
D 3
.SM RPC
E 3
I 3
.Tn RPC
E 3
packets should be sent.
D 2
.LP
Normally, standard
E 2
I 2
D 3
.PP
.B Portmap
E 3
I 3
.Pp
.Nm Portmap
E 3
must be started before any
E 2
D 3
.SM RPC
E 3
I 3
.Tn RPC
E 3
D 2
servers are started by
.BR inetd (8C),
so
E 2
I 2
servers are invoked.
D 3
.PP
E 3
I 3
.Pp
E 3
Normally
E 2
D 3
.B portmap
E 3
I 3
.Nm portmap
E 3
D 2
must be started before
.B inetd
is invoked.
E 2
I 2
forks and dissociates itself from the terminal
like any other daemon.
D 3
.B Portmap
E 3
I 3
.Nm Portmap
E 3
then logs errors using
D 3
.IR syslog (3).
The
.B \-d
(debug) option prevents
.B portmap
E 3
I 3
.Xr syslog 3 .
.Pp
Option available:
.Bl -tag -width Ds
.It Fl d
(debug) prevents
.Nm portmap
E 3
from running as a daemon,
and causes errors and debugging information
to be printed to the standard error output.
E 2
D 3
.SH "SEE ALSO"
D 2
.BR inetd.conf (5),
.BR rpcinfo (8),
.BR inetd (8)
E 2
I 2
inetd.conf(5),
rpcinfo(8),
inetd(8)
E 2
.SH BUGS
E 3
I 3
.El
.Sh SEE ALSO
.Xr inetd.conf 5 ,
.Xr rpcinfo 8 ,
.Xr inetd 8
.Sh BUGS
E 3
If
D 3
.B portmap
E 3
I 3
.Nm portmap
E 3
crashes, all servers must be restarted.
I 3
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.3
E 3
E 1
