share/man/man5/SCCS/s.hosts.5
h56228
s 00001/00001/00082
d D 8.2 93/12/11 23:16:34 mckusick 9 8
c copyediting for Usenix manuals
e
s 00002/00002/00081
d D 8.1 93/06/05 13:52:58 bostic 8 7
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00051/00033/00032
d D 6.6 91/05/10 13:46:02 cael 7 6
c mdoc version three
e
s 00001/00011/00064
d D 6.5 90/06/23 18:02:24 trent 6 5
c new copyright notice
e
s 00014/00003/00061
d D 6.4 89/02/14 17:38:05 bostic 5 4
c add Berkeley specific copyright notice
e
s 00019/00013/00045
d D 6.3 86/05/14 19:45:23 bloom 4 3
c emphasis name server more, fix formatting
e
s 00010/00004/00048
d D 6.2 86/05/06 15:44:12 kjd 3 2
c Changes for name server
e
s 00001/00001/00051
d D 6.1 85/05/15 18:55:05 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00052/00000/00000
d D 5.1 85/05/15 18:54:48 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
D 5
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 5
I 5
D 7
.\" Copyright (c) 1983 The Regents of the University of California.
E 7
I 7
D 8
.\" Copyright (c) 1983, 1991 The Regents of the University of California.
E 7
.\" All rights reserved.
E 8
I 8
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 8
.\"
D 6
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 6
I 6
D 7
.\" %sccs.include.redist.man%
E 7
I 7
.\" %sccs.include.redist.roff%
E 7
E 6
E 5
.\"
D 7
.\"	%W% (Berkeley) %G%
E 7
I 7
.\"     %W% (Berkeley) %G%
E 7
.\"
D 2
.TH HOSTS 5  "15 January 1983"
E 2
I 2
D 7
.TH HOSTS 5  "%Q%"
E 2
.UC 5
.SH NAME
hosts \- host name data base
.SH DESCRIPTION
E 7
I 7
.Dd %Q%
.Dt HOSTS 5
.Os BSD 4.2
.Sh NAME
.Nm hosts
.Nd host name data base
.Sh DESCRIPTION
E 7
The
D 7
.I hosts
E 7
I 7
.Nm hosts
E 7
file contains information regarding
D 4
the known hosts on the DARPA Internet.
E 4
I 4
the known hosts on the network.
E 4
For each host a single line should be present
with the following information:
D 7
.HP 10
E 7
I 7
.Bd -unfilled -offset indent
E 7
official host name
D 7
.br
.ns
.HP 10
E 7
Internet address
D 7
.br
.ns
.HP 10
E 7
aliases
D 7
.PP
E 7
I 7
.Ed
.Pp
E 7
Items are separated by any number of blanks and/or
tab characters.  A ``#'' indicates the beginning of
a comment; characters up to the end of the line are
not interpreted by routines which search the file.
D 4
This file is normally created from the official host
E 4
I 4
D 7
.PP
E 7
I 7
.Pp
E 7
When using the name server
D 7
.IR named (8),
E 7
I 7
.Xr named 8 ,
E 7
this file provides a backup when the name server
is not running.
For the name server, it is suggested that only a few addresses
be included in this file.
These include  address for the local interfaces that 
D 7
.IR ifconfig (8C)
E 7
I 7
.Xr ifconfig 8
E 7
needs at boot time and a few machines on the local network.
D 7
.PP
E 7
I 7
.Pp
E 7
This file may be created from the official host
E 4
data base maintained at the Network Information Control
D 7
Center (NIC), though local changes may be required
E 7
I 7
Center
.Pq Tn NIC , 
though local changes may be required
E 7
to bring it up to date regarding unofficial aliases
D 4
and/or unknown hosts.
E 4
I 4
D 7
and/or unknown hosts.  As the data base maintained at NIC
E 7
I 7
and/or unknown hosts.  As the data base maintained at
.Tn NIC
E 7
D 9
is incomplete, use of the name server is recommend for
E 9
I 9
is incomplete, use of the name server is recommended for
E 9
D 7
sites on the DARPA Internet.
E 4
.PP
E 7
I 7
sites on the
.Tn DARPA
Internet.
.Pp
E 7
Network addresses are specified in the conventional
D 7
``.'' notation using the \fIinet_addr\fP() routine
E 7
I 7
``.'' (dot) notation using the
.Xr inet_addr 3
routine
E 7
from the Internet address manipulation library,
D 7
.IR inet (3N).
E 7
I 7
.Xr inet 3 .
E 7
Host names may contain any printable
character other than a field delimiter, newline,
or comment character.
I 3
D 4
.PP
When using the name server this file is used as a backup for when 
.IR named (8)
is not running.
For the name server it is suggested that only a few addresses
be included in this file.
These include  address for the local interfaces that 
.IR ifconfig (8C)
needs at boot time and a few machines on the local network.
E 4
E 3
D 7
.SH FILES
/etc/hosts
.SH "SEE ALSO"
D 3
gethostent(3N)
.SH BUGS
A name server should be used instead of a static file.
A binary indexed file format should be available for fast access.
E 3
I 3
D 4
gethostent(3N), ifconfig(8C), named(8), Name Server Operations Guide for BIND
E 4
I 4
gethostbyname(3N), ifconfig(8C), named(8)
.br
Name Server Operations Guide for BIND
E 7
I 7
.Sh FILES
.Bl -tag -width /etc/hosts -compact
.It Pa /etc/hosts
The
.Nm hosts
file resides in
.Pa /etc .
.El
.Sh SEE ALSO
.Xr gethostbyname 3 ,
.Xr ifconfig 8 ,
.Xr named 8
.Rs
.%T "Name Server Operations Guide for BIND"
.Re
.Sh HISTORY
The
.Nm
file format appeared in
.Bx 4.2 .
E 7
E 4
E 3
E 1
