share/man/man5/SCCS/s.networks.5
h01714
s 00002/00002/00060
d D 8.1 93/06/05 13:53:03 bostic 7 6
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00041/00027/00021
d D 6.5 91/05/10 14:01:06 cael 6 5
c mdoc version three
e
s 00001/00011/00047
d D 6.4 90/06/23 18:02:11 trent 5 4
c new copyright notice
e
s 00014/00003/00044
d D 6.3 89/02/14 17:38:07 bostic 4 3
c add Berkeley specific copyright notice
e
s 00000/00001/00047
d D 6.2 86/05/06 16:13:32 kjd 3 2
c Fix bugs section
e
s 00001/00001/00047
d D 6.1 85/05/15 18:58:51 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00048/00000/00000
d D 5.1 85/05/15 18:58:44 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
D 4
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 4
I 4
D 6
.\" Copyright (c) 1983 The Regents of the University of California.
E 6
I 6
D 7
.\" Copyright (c) 1983, 1991 The Regents of the University of California.
E 6
.\" All rights reserved.
E 7
I 7
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 7
.\"
D 5
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 5
I 5
D 6
.\" %sccs.include.redist.man%
E 6
I 6
.\" %sccs.include.redist.roff%
E 6
E 5
E 4
.\"
D 6
.\"	%W% (Berkeley) %G%
E 6
I 6
.\"     %W% (Berkeley) %G%
E 6
.\"
D 2
.TH NETWORKS 5  "15 January 1983"
E 2
I 2
D 6
.TH NETWORKS 5  "%Q%"
E 2
.UC 5
.SH NAME
networks \- network name data base
.SH DESCRIPTION
E 6
I 6
.Dd %Q%
.Dt NETWORKS 5
.Os BSD 4.2
.Sh NAME
.Nm networks
.Nd network name data base
.Sh DESCRIPTION
E 6
The
D 6
.I networks
E 6
I 6
.Xr networks
E 6
file contains information regarding
D 6
the known networks which comprise the DARPA Internet.
E 6
I 6
the known networks which comprise the
.Tn DARPA
Internet.
E 6
For each network a single line should be present with the following information:
D 6
.HP 10
E 6
I 6
.Bd -unfilled -offset indent
E 6
official network name
D 6
.br
.ns
.HP 10
E 6
network number
D 6
.br
.ns
.HP 10
E 6
aliases
D 6
.PP
E 6
I 6
.Ed
.Pp
E 6
Items are separated by any number of blanks and/or tab characters.
A ``#'' indicates the beginning of a comment; characters up to the end of
the line are not interpreted by routines which search the file.
This file is normally created from the official network data base
D 6
maintained at the Network Information Control Center (NIC), though local
E 6
I 6
maintained at the Network Information Control Center
.Pq Tn NIC , 
though local
E 6
changes may be required to bring it up to date regarding unofficial aliases
and/or unknown networks.
D 6
.PP
E 6
I 6
.Pp
E 6
Network number may be specified in the conventional
D 6
``.'' notation using the \fIinet_network\fP() routine
E 6
I 6
``.''  (dot) notation using the
.Xr inet_network 3
routine
E 6
from the Internet address manipulation library,
D 6
.IR inet (3N).
E 6
I 6
.Xr inet 3 .
E 6
Network names may contain any printable character other than a field
delimiter, newline, or comment character.
D 6
.SH FILES
/etc/networks
.SH "SEE ALSO"
getnetent(3N)
.SH BUGS
E 6
I 6
.Sh FILES
.Bl -tag -width /etc/networks -compact
.It Pa /etc/networks
The
.Nm networks
file resides in
.Pa /etc .
.El
.Sh SEE ALSO
.Xr getnetent 3
.Sh BUGS
E 6
A name server should be used instead of a static file.
I 6
.Sh HISTORY
The
.Nm
file format appeared in
.Bx 4.2 .
E 6
D 3
A binary indexed file format should be available for fast access.
E 3
E 1
