share/man/man5/SCCS/s.printcap.5
h34347
s 00002/00002/00303
d D 8.5 95/05/10 18:12:54 tef 12 11
c port@host is the preferred syntax
e
s 00045/00002/00260
d D 8.4 95/04/28 18:52:31 tef 11 10
c Document tef's enhancements to lpd.
e
s 00001/00001/00261
d D 8.3 94/10/09 21:13:04 mckusick 10 9
c extra period
e
s 00001/00001/00261
d D 8.2 93/12/11 23:16:35 mckusick 9 8
c copyediting for Usenix manuals
e
s 00002/00002/00260
d D 8.1 93/06/05 13:53:24 bostic 8 7
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00178/00148/00084
d D 6.6 91/05/10 14:05:20 cael 7 6
c mdoc version three
e
s 00003/00002/00229
d D 6.5 91/05/02 07:03:09 cael 6 5
c bsd copyright
e
s 00002/00002/00229
d D 6.4 86/05/14 18:57:19 bloom 5 4
c change doc reference
e
s 00130/00004/00101
d D 6.3 85/11/17 15:54:10 eric 4 3
c try to explain logging and filters
e
s 00001/00000/00104
d D 6.2 85/10/30 12:15:07 bloom 3 2
c add pc for printing cost for accounting
e
s 00003/00001/00101
d D 6.1 85/05/15 18:55:38 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00102/00000/00000
d D 5.1 85/05/15 18:55:23 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
D 7
.\" Copyright (c) 1983 Regents of the University of California.
E 7
I 7
D 8
.\" Copyright (c) 1983, 1991 Regents of the University of California.
E 7
D 6
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 6
I 6
.\" All rights reserved.
E 8
I 8
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 8
.\"
D 7
.\"	%sccs.include.redist.roff%
E 7
I 7
.\" %sccs.include.redist.roff%
E 7
E 6
.\"
D 7
.\"	%W% (Berkeley) %G%
E 7
I 7
.\"     %W% (Berkeley) %G%
E 7
.\"
D 2
.TH PRINTCAP 5 "18 July 1983"
E 2
I 2
D 7
.TH PRINTCAP 5 "%Q%"
E 2
.UC 5
.ad
.SH NAME
printcap \- printer capability data base
.SH SYNOPSIS
/etc/printcap
.SH DESCRIPTION
.I Printcap
E 7
I 7
.Dd %Q%
.Dt PRINTCAP 5
.Os BSD 4.2
.Sh NAME
.Nm printcap
.Nd printer capability data base
.Sh SYNOPSIS
.Nm printcap
.Sh DESCRIPTION
The
D 11
.Nm Printcap
E 11
I 11
.Nm printcap
E 11
function
E 7
is a simplified version of the
D 7
.IR termcap (5)
E 7
I 7
.Xr termcap 5
E 7
data base
used to describe line printers.  The spooling system accesses the
D 7
.I printcap
E 7
I 7
.Nm printcap
E 7
file every time it is used, allowing dynamic
addition and deletion of printers.  Each entry in the data base
is used to describe one printer.  This data base may not be
substituted for, as is possible for 
D 7
.IR termcap ,
E 7
I 7
.Xr termcap ,
E 7
because it may allow accounting to be bypassed.
D 7
.PP
E 7
I 7
.Pp
E 7
The default printer is normally 
D 7
.IR lp ,
though the environment variable PRINTER
E 7
I 7
.Em lp ,
though the environment variable
.Ev PRINTER
E 7
may be used to override this.  Each spooling utility supports an option,
D 7
.BI \-P printer,
E 7
I 7
.Fl P Ar printer ,
E 7
to allow explicit naming of a destination printer.
D 7
.PP
E 7
I 7
.Pp
E 7
Refer to the
D 7
.ul
D 5
4.2BSD Line Printer Spooler Manual
E 5
I 5
4.3BSD Line Printer Spooler Manual
E 7
I 7
.%T "4.3 BSD Line Printer Spooler Manual"
E 7
E 5
D 9
for a complete discussion on how setup the database for a given printer.
E 9
I 9
for a complete discussion on how to setup the database for a given printer.
E 9
D 7
.SH CAPABILITIES
E 7
I 7
.Sh CAPABILITIES
E 7
Refer to
D 4
.I termcap
E 4
I 4
D 7
.IR termcap (5)
E 7
I 7
.Xr termcap 5
E 7
E 4
for a description of the file layout.
D 7
.nf

.ta \w'k0-k9  'u +\w'Type  'u +\w'``/usr/spool/lpd\'\'  'u
\fBName	Type	Default	Description\fR
af	str	NULL	name of accounting file
br	num	none	if lp is a tty, set the baud rate (ioctl call)
cf	str	NULL	cifplot data filter
df	str	NULL	tex data filter (DVI format)
fc	num	0	if lp is a tty, clear flag bits (sgtty.h)
ff	str	``\ef''	string to send for a form feed
fo	bool	false	print a form feed when device is opened
fs	num	0	like `fc' but set bits
gf	str	NULL	graph data filter (plot (3X) format)
I 2
hl	bool	false	print the burst header page last
E 2
ic	bool	false	driver supports (non standard) ioctl to indent printout
if	str	NULL	name of text filter which does accounting
lf	str	``/dev/console''	error logging file name
lo	str	``lock''	name of lock file
lp	str	``/dev/lp''	device name to open for output
mx	num	1000	maximum file size (in BUFSIZ blocks), zero = unlimited
nd	str	NULL	next directory for list of queues (unimplemented)
nf	str	NULL	ditroff data filter (device independent troff)
of	str	NULL	name of output filtering program
I 3
pc	num	200	price per foot or page in hundredths of cents
E 3
pl	num	66	page length (in lines)
pw	num	132	page width (in characters)
px	num	0	page width in pixels (horizontal)
py	num	0	page length in pixels (vertical)
rf	str	NULL	filter for printing FORTRAN style text files
I 2
rg	str	NULL	restricted group. Only members of group allowed access
E 2
rm	str	NULL	machine name for remote printer
rp	str	``lp''	remote printer name argument
rs	bool	false	restrict remote users to those with local accounts
rw	bool	false	open the printer device for reading and writing
sb	bool	false	short banner (one line only)
sc	bool	false	suppress multiple copies
sd	str	``/usr/spool/lpd''	spool directory
sf	bool	false	suppress form feeds
sh	bool	false	suppress printing of burst page header
st	str	``status''	status file name
tf	str	NULL	troff data filter (cat phototypesetter)
tr	str	NULL	trailer string to print when queue empties
vf	str	NULL	raster image filter
xc	num	0	if lp is a tty, clear local mode bits (tty (4))
xs	num	0	like `xc' but set bits
.fi
.PP
E 7
I 7
.Bl -column Namexxx Typexx "/var/spool/lpdxxxxx"
.Sy Name	Type	Description
.It "af	str" Ta Dv NULL Ta No "name of accounting file"
.It "br	num	none	if lp is a tty, set the baud rate"
.Pf ( Xr ioctl 2
call)
.It "cf	str" Ta Dv NULL Ta No "cifplot data filter"
.It "df	str" Ta Dv NULL Ta No "tex data filter"
.Pf ( Tn DVI
format)
.It "fc	num	0	if lp is a tty, clear flag bits"
.Pq Pa sgtty.h
.It "ff	str" Ta So Li \ef Sc Ta No "string to send for a form feed"
.It "fo	bool	false	print a form feed when device is opened"
.It "fs	num	0	like `fc' but set bits"
.It "gf	str" Ta Dv NULL Ta No "graph data filter"
.Pf ( Xr plot 3
format
.It "hl	bool	false	print the burst header page last"
.It "ic	bool	false	driver supports (non standard) ioctl to indent printout"
.It "if	str" Ta Dv NULL Ta No "name of text filter which does accounting"
.It "lf	str" Ta Pa /dev/console Ta No "error logging file name"
.It "lo	str" Ta Pa lock Ta No "name of lock file"
.It "lp	str" Ta Pa /dev/lp Ta No "device name to open for output"
.It "mx	num	1000	maximum file size (in"
.Dv BUFSIZ
blocks), zero = unlimited
.It "nd	str" Ta Dv NULL Ta No "next directory for list of queues (unimplemented)"
.It "nf	str" Ta Dv NULL Ta No "ditroff data filter (device independent troff)"
.It "of	str" Ta Dv NULL Ta No "name of output filtering program"
.It "pc	num	200	price per foot or page in hundredths of cents"
.It "pl	num	66	page length (in lines)"
.It "pw	num	132	page width (in characters)"
.It "px	num	0	page width in pixels (horizontal)"
.It "py	num	0	page length in pixels (vertical)"
.It "rf	str" Ta Dv NULL Ta No "filter for printing"
.Tn FORTRAN
style text files
.It "rg	str" Ta Dv NULL Ta No "restricted group. Only members of group allowed access"
.It "rm	str" Ta Dv NULL Ta No "machine name for remote printer"
.It "rp	str	``lp''	remote printer name argument"
.It "rs	bool	false	restrict remote users to those with local accounts"
.It "rw	bool	false	open the printer device for reading and writing"
.It "sb	bool	false	short banner (one line only)"
.It "sc	bool	false	suppress multiple copies"
.It "sd	str" Ta Pa /var/spool/lpd Ta No "spool directory"
.It "sf	bool	false	suppress form feeds"
.It "sh	bool	false	suppress printing of burst page header"
.It "st	str" Ta Pa status Ta No "status file name"
.It "tf	str" Ta Dv NULL Ta No "troff data filter (cat phototypesetter)"
.It "tr	str" Ta Dv NULL Ta No "trailer string to print when queue empties"
.It "vf	str" Ta Dv NULL Ta No "raster image filter"
.It "xc	num	0	if lp is a tty, clear local mode bits"
.Pq Xr tty 4
.It "xs	num	0	like `xc' but set bits"
.El
.Pp
E 7
D 4
Error messages sent to the console have a carriage return and a line
feed appended to them, rather than just a line feed.
.PP
E 4
If the local line printer driver supports indentation, the daemon
must understand how to invoke it.
I 11
.Pp
The
.Em lp
entry can specify either a device in the ``/dev'' directory
or a printer accessible via the network using the syntax:
.Bd -filled -offset indent
D 12
.Nm :lp= Ns Ar host
.Nm @ Ns Ar port
E 12
I 12
.Nm :lp= Ns Ar port
.Nm @ Ns Ar host
E 12
.Nm :
.Ed
.Pp
where
.Ar host
is the network name of the printer and
.Ar port
is the TCP port number to use for the network connection.
This works both for printers directly connected
to the network (and which understand TCP/IP)
as well as for many terminal servers
that support printers via their serial and/or parallel ports.
E 11
I 4
D 7
.SH FILTERS
E 7
I 7
.Sh FILTERS
E 7
The
D 7
.IR lpd (8)
E 7
I 7
.Xr lpd 8
E 7
daemon creates a pipeline of
D 7
.I filters
E 7
I 7
.Em filters
E 7
to process files for various printer types.
The filters selected depend on the flags passed to
D 7
.IR lpr (1).
E 7
I 7
.Xr lpr 1 .
E 7
The pipeline set up is:
D 7
.RS
.PP
.nf
.ta 0.5i +1i
\-p	pr | if	regular text + \fIpr\fP(1)
E 7
I 7
.Bd -literal -offset indent
p	pr | if	regular text + pr(1)
E 7
none	if	regular text
D 7
\-c	cf	cifplot
\-d	df	DVI (tex)
\-g	gf	\fIplot\fP(3)
\-n	nf	ditroff
\-f	rf	Fortran
\-t	tf	troff
\-v	vf	raster image
.fi
.RE
.PP
E 7
I 7
c	cf	cifplot
d	df	DVI (tex)
g	gf	plot(3)
n	nf	ditroff
f	rf	Fortran
t	tf	troff
v	vf	raster image
.Ed
.Pp
E 7
The
D 7
.B if
E 7
I 7
.Sy if
E 7
filter is invoked with arguments:
D 7
.PP
	\fIif\fP [ \fB\-c\fP ] \fB\-w\fPwidth \fB\-l\fPlength \fB\-i\fPindent \fB\-n\fP login \fB\-h\fP host acct-file
.PP
E 7
I 7
.Bd -filled -offset indent
.Cm if
.Op Fl c
.Fl w Ns Ar width
.Fl l Ns Ar length
.Fl i Ns Ar indent
.Fl n Ar login
.Fl h Ar host acct-file
.Ed
.Pp
E 7
The
D 7
.B \-c
E 7
I 7
.Fl c
E 7
flag is passed only if the
D 7
.B \-l
E 7
I 7
.Fl l
E 7
flag (pass control characters literally)
is specified to
D 7
.IR lpr .
.I Width
E 7
I 7
.Xr lpr .
The
D 11
.Ar Width
E 11
I 11
.Ar width
E 11
function
E 7
and
D 7
.I length
E 7
I 7
.Ar length
E 7
specify the page width and length
(from
D 7
.B pw
E 7
I 7
.Cm pw
E 7
and
D 7
.B pl
E 7
I 7
.Cm pl
E 7
respectively) in characters.
The
D 7
.B \-n
E 7
I 7
.Fl n
E 7
and
D 7
.B \-h
E 7
I 7
.Fl h
E 7
parameters specify the login name and host name of the owner
of the job respectively.
D 7
.I Acct-file
E 7
I 7
The
.Ar Acct-file
function
E 7
is passed from the
D 7
.B af
.I printcap
E 7
I 7
.Cm af
.Nm printcap
E 7
entry.
D 7
.PP
E 7
I 7
.Pp
E 7
If no
D 7
.B if
E 7
I 7
.Cm if
E 7
is specified,
D 7
.B of
E 7
I 7
.Cm of
E 7
is used instead,
with the distinction that
D 7
.B of
E 7
I 7
.Cm of
E 7
is opened only once,
while
D 7
.B if
E 7
I 7
.Cm if
E 7
is opened for every individual job.
Thus,
D 7
.B if
E 7
I 7
.Cm if
E 7
is better suited to performing accounting.
The
D 7
.B of
E 7
I 7
.Cm of
E 7
is only given the
D 7
.I width
E 7
I 7
.Ar width
E 7
and
D 7
.I length
E 7
I 7
.Ar length
E 7
flags.
D 7
.PP
E 7
I 7
.Pp
E 7
All other filters are called as:
D 7
.PP
	\fIfilter\fP \fB\-x\fPwidth \fB\-y\fPlength \fB\-n\fP login \fB\-h\fP host acct-file
.PP
E 7
I 7
.Bd -filled -offset indent
.Nm filter
.Fl x Ns Ar width
.Fl y Ns Ar length
.Fl n Ar login
.Fl h Ar host acct-file
.Ed
.Pp
E 7
where
D 7
.I width
E 7
I 7
.Ar width
E 7
and
D 7
.I length
E 7
I 7
.Ar length
E 7
are represented in pixels,
specified by the
D 7
.B px
E 7
I 7
.Cm px
E 7
and
D 7
.B py
E 7
I 7
.Cm py
E 7
entries respectively.
D 7
.PP
E 7
I 7
.Pp
E 7
All filters take
D 7
.I stdin
E 7
I 7
.Em stdin
E 7
as the file,
D 7
.I stdout
E 7
I 7
.Em stdout
E 7
as the printer,
may log either to
D 7
.I stderr
E 7
I 7
.Em stderr
E 7
or using
D 7
.IR syslog (3),
E 7
I 7
.Xr syslog 3 ,
E 7
and must not ignore
D 7
.SM SIGINT.
.SH LOGGING
E 7
I 7
.Dv SIGINT . 
.Sh LOGGING
E 7
Error messages generated by the line printer programs themselves
(that is, the
D 7
.IR lp *
E 7
I 7
.Xr lp Ns *
E 7
programs)
are logged by
D 7
.IR syslog (3)
E 7
I 7
.Xr syslog 3
E 7
using the
D 7
.I LPR
E 7
I 7
.Dv LPR
E 7
facility.
Messages printed on
D 7
.I stderr
E 7
I 7
.Em stderr
E 7
of one of the filters
are sent to the corresponding
D 7
.B lf
E 7
I 7
.Cm lf
E 7
file.
The filters may, of course, use
D 7
.I syslog
E 7
I 7
.Xr syslog
E 7
themselves.
D 7
.PP
E 7
I 7
.Pp
E 7
Error messages sent to the console have a carriage return and a line
feed appended to them, rather than just a line feed.
I 11
.Sh ADMINISTRATION
In a networked environment with many hosts,
it is convenient to use the same
.Nm printcap
file on all machines.
This is accomplished by specifying the complete set of entries
for every printer on all machines, including entries for both the
.Cm rm
and
.Cm lp
capabilities.
This is possible because the
.Xr lpd
daemon matches the
.Cm rm
printcap entry with the local host name and
only opens the line printer specified by
.Cm lp
if the names match.
Otherwise the
.Cm lp
entry is ignored and the spooled file is sent on
to the remote machine for printing.
E 11
E 4
D 7
.SH "SEE ALSO"
termcap(5),
lpc(8),
lpd(8),
pac(8),
lpr(1),
lpq(1),
lprm(1)
.br
.ul
D 5
4.2BSD Line Printer Spooler Manual
E 5
I 5
4.3BSD Line Printer Spooler Manual
E 7
I 7
.Sh SEE ALSO
.Xr termcap 5 ,
.Xr lpc 8 ,
.Xr lpd 8 ,
.Xr pac 8 ,
.Xr lpr 1 ,
.Xr lpq 1 ,
.Xr lprm 1
.Rs
.%T "4.3 BSD Line Printer Spooler Manual"
.Re
.Sh HISTORY
The
.Nm
file format appeared in
D 10
.Bx 4.2 ..
E 10
I 10
.Bx 4.2 .
E 10
E 7
E 5
E 1
