share/man/man5/SCCS/s.remote.5
h18625
s 00001/00000/00174
d D 8.2 94/06/01 21:03:58 ah 6 5
c page breaks for 4.4BSD manuals
e
s 00002/00002/00172
d D 8.1 93/06/05 13:53:35 bostic 5 4
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00087/00079/00087
d D 6.3 91/05/10 14:05:23 cael 4 3
c mdoc version three
e
s 00003/00002/00163
d D 6.2 91/05/02 07:03:10 cael 3 2
c bsd copyright
e
s 00001/00001/00164
d D 6.1 85/05/15 18:59:26 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00165/00000/00000
d D 5.1 85/05/15 18:59:18 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
D 4
.\" Copyright (c) 1983 Regents of the University of California.
D 3
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 3
I 3
.\" All rights reserved. 
E 4
I 4
D 5
.\" Copyright (c) 1983, 1991 Regents of the University of California.
.\" All rights reserved.
E 5
I 5
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 5
E 4
.\"
D 4
.\"     %sccs.include.redist.roff%
E 4
I 4
.\" %sccs.include.redist.roff%
E 4
E 3
.\"
D 4
.\"	%W% (Berkeley) %G%
E 4
I 4
.\"     %W% (Berkeley) %G%
E 4
.\"
D 2
.TH REMOTE 5 "1 March 1983"
E 2
I 2
D 4
.TH REMOTE 5 "%Q%"
E 2
.UC 5
.SH NAME
remote \- remote host description file
.SH DESCRIPTION
E 4
I 4
.Dd %Q%
.Dt REMOTE 5
.Os BSD 4.2
.Sh NAME
.Nm remote
.Nd remote host description file
.Sh DESCRIPTION
E 4
The systems known by
D 4
.IR tip (1C)
and their attributes are stored in an ASCII file which
E 4
I 4
.Xr tip 1
and their attributes are stored in an
.Tn ASCII
file which
E 4
is structured somewhat like the
D 4
.IR termcap (5)
E 4
I 4
.Xr termcap 5
E 4
file.  Each line in the file provides a description for a single
D 4
.IR system .
E 4
I 4
.Xr system .
E 4
Fields are separated by a colon (``:'').
Lines ending in a \e character with an immediately following newline are
continued on the next line.
D 4
.PP
E 4
I 4
.Pp
E 4
The first entry is the name(s) of the host system.  If there is more
than one name for a system, the names are separated by vertical bars.
After the name of the system comes the fields of the description.  A
field name followed by an `=' sign indicates a string value follows.  A field
name followed by a `#' sign indicates a following numeric value.
D 4
.PP
E 4
I 4
.Pp
E 4
Entries named ``tip*'' and ``cu*''
are used as default entries by 
D 4
.IR tip ,
E 4
I 4
.Xr tip ,
E 4
and the
D 4
.I cu
E 4
I 4
.Xr cu
E 4
interface to 
D 4
.IR tip ,
E 4
I 4
.Xr tip ,
E 4
as follows.  When
D 4
.I tip
E 4
I 4
.Xr tip
E 4
is invoked with only a phone number, it looks for an entry
of the form ``tip300'', where 300 is the baud rate with
which the connection is to be made.  When the
D 4
.I cu
E 4
I 4
.Xr cu
E 4
interface is used, entries of the form ``cu300'' are used.
D 4
.SH CAPABILITIES
E 4
I 4
.Sh CAPABILITIES
E 4
Capabilities are either strings (str), numbers (num), or boolean
flags (bool).  A string capability is specified by 
D 4
.IR capability = value ;
e.g. ``dv=/dev/harris''.  A numeric capability is specified by
.IR capability # value ;
e.g. ``xa#99''.  A boolean capability is specified by simply listing
E 4
I 4
.Em capability Ns Ar = Ns Em value ;
for example, ``dv=/dev/harris''.  A numeric capability is specified by
.Em capability Ns Ar # Ns Em value ;
for example, ``xa#99''.  A boolean capability is specified by simply listing
E 4
the capability.
D 4
.TP 0.5i
.B at
E 4
I 4
.Bl -tag -width indent
.It Cm \&at
E 4
(str)
Auto call unit type.
D 4
.TP 0.5i
.B br
E 4
I 4
.It Cm \&br
E 4
(num)
The baud rate used in establishing
a connection to the remote host.
This is a decimal number. 
The default baud rate is 300 baud.
D 4
.TP 0.5i
.B cm
E 4
I 4
.It Cm \&cm
E 4
(str)
An initial connection message to be sent
to the remote host.  For example, if a
host is reached through port selector, this
might be set to the appropriate sequence
required to switch to the host.
D 4
.TP 0.5i
.B cu
E 4
I 4
.It Cm \&cu
E 4
(str)
Call unit if making a phone call.
Default is the same as the `dv' field.
D 4
.TP 0.5i
.B di
E 4
I 4
.It Cm \&di
E 4
(str)
Disconnect message sent to the host when a
disconnect is requested by the user.
D 4
.TP 0.5i
.B du
E 4
I 4
.It Cm \&du
E 4
(bool)
This host is on a dial-up line. 
D 4
.TP 0.5i
.B dv
E 4
I 4
.It Cm \&dv
E 4
(str)
D 4
UNIX device(s) to open to establish a connection. 
E 4
I 4
.Tn UNIX
device(s) to open to establish a connection. 
E 4
If this file refers to a terminal line,
D 4
.IR tip (1C)
E 4
I 4
.Xr tip 1
E 4
attempts to perform an exclusive open on the device to insure only
one user at a time has access to the port.
D 4
.TP 0.5i
.B el
E 4
I 4
.It Cm \&el
E 4
(str)
Characters marking an end-of-line. 
D 4
The default is NULL.  `~' escapes are only
E 4
I 4
The default is
.Dv NULL . 
`~' escapes are only
E 4
recognized by
D 4
.I tip
E 4
I 4
.Xr tip
E 4
after one of the characters in `el',
or after a carriage-return.
D 4
.TP 0.5i
.B fs
E 4
I 4
.It Cm \&fs
E 4
(str)
Frame size for transfers. 
D 4
The default frame size is equal to BUFSIZ.
.TP 0.5i
.B hd
E 4
I 4
The default frame size is equal to
.Dv BUFSIZ .
.It Cm \&hd
E 4
(bool)
The host uses half-duplex communication, local
echo should be performed.
D 4
.TP 0.5i
.B ie
E 4
I 4
.It Cm \&ie
E 4
(str)
Input end-of-file marks.
D 4
The default is NULL.
.TP 0.5i
.B oe
E 4
I 4
The default is
.Dv NULL . 
.It Cm \&oe
E 4
(str)
Output end-of-file string.
D 4
The default is NULL.  When 
.I tip
E 4
I 4
The default is
.Dv NULL . 
When 
.Xr tip
E 4
is transferring a file, this
string is sent at end-of-file.
I 6
.ne 1i
E 6
D 4
.TP 0.5i
.B pa
E 4
I 4
.It Cm \&pa
E 4
(str)
The type of parity to use when sending data
to the host.  This may be one of ``even'',
``odd'', ``none'', ``zero'' (always set bit 8 to zero),
``one'' (always set bit 8 to 1).  The default
is even parity.
D 4
.TP 0.5i
.B pn
E 4
I 4
.It Cm \&pn
E 4
(str)
Telephone number(s) for this host.
If the telephone number field contains
an @ sign, 
D 4
.I tip
E 4
I 4
.Xr tip
E 4
searches the file
D 4
.I /etc/phones
E 4
I 4
.Pa /etc/phones
E 4
file for a list of telephone numbers;
D 4
c.f.
.IR phones (5).
.TP 0.5i
.B tc
E 4
I 4
(See
.Xr phones 5 . )
.It Cm \&tc
E 4
(str)
Indicates that the list of capabilities is continued
in the named description.  This is used
primarily to share common capability information.
D 4
.PP
E 4
I 4
.El
.Pp
E 4
Here is a short example showing the use of the capability continuation
feature:
D 4
.PP
.nf
.ta 0.5i
E 4
I 4
.Bd -literal
E 4
UNIX-1200:\e
D 4
	:dv=/dev/cau0:el=^D^U^C^S^Q^O@:du:at=ventel:ie=#$%:oe=^D:br#1200:
E 4
I 4
:dv=/dev/cau0:el=^D^U^C^S^Q^O@:du:at=ventel:ie=#$%:oe=^D:br#1200:
E 4
arpavax|ax:\e
D 4
	:pn=7654321%:tc=UNIX-1200
.fi
.SH FILES
/etc/remote
.SH "SEE ALSO"
tip(1C),
phones(5)
E 4
I 4
:pn=7654321%:tc=UNIX-1200
.Ed
.Sh FILES
.Bl -tag -width /etc/remote -compact
.It Pa /etc/remote
The
.Nm remote
host description file
resides in
.Pa /etc .
.El
.Sh SEE ALSO
.Xr tip 1 ,
.Xr phones 5
.Sh HISTORY
The
.Nm
file format appeared in
.Bx 4.2 .
E 4
E 1
