share/man/man5/SCCS/s.resolver.5
h45917
s 00002/00002/00114
d D 8.1 93/06/05 13:53:47 bostic 13 12
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00067/00039/00049
d D 5.12 91/05/10 14:05:24 cael 12 11
c mdoc version three
e
s 00001/00001/00087
d D 5.11 90/06/27 08:26:15 bloom 11 10
c correct reference to resol(3)
e
s 00001/00011/00087
d D 5.10 90/06/23 18:02:19 trent 10 9
c new copyright notice
e
s 00003/00000/00095
d D 5.9 89/12/14 11:26:46 karels 9 8
c document limit to search list
e
s 00043/00013/00052
d D 5.8 89/12/14 08:54:12 karels 8 7
c add search keyword
e
s 00014/00003/00051
d D 5.7 89/02/14 15:50:12 bostic 7 6
c add Berkeley specific copyright
e
s 00001/00001/00053
d D 5.6 87/09/14 15:54:44 bostic 6 5
c fix NAME entry
e
s 00023/00005/00031
d D 5.5 86/05/15 11:25:37 bloom 5 4
c fix defaults and mention that this is not needed
e
s 00001/00001/00035
d D 5.4 86/04/10 14:38:12 kjd 4 3
c Change paper title
e
s 00011/00011/00025
d D 5.3 86/03/21 22:20:24 kjd 3 2
c clean up
e
s 00000/00006/00036
d D 5.2 86/01/07 13:35:31 kjd 2 1
c Remove bugs section
e
s 00042/00000/00000
d D 5.1 86/01/07 13:30:55 kjd 1 0
c date and time created 86/01/07 13:30:55 by kjd
e
u
U
t
T
I 5
D 7
.\" Copyright (c) 1986 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 7
I 7
D 12
.\" Copyright (c) 1986 The Regents of the University of California.
E 12
I 12
D 13
.\" Copyright (c) 1986, 1991 The Regents of the University of California.
E 12
.\" All rights reserved.
E 13
I 13
.\" Copyright (c) 1986, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 13
.\"
D 10
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 10
I 10
D 12
.\" %sccs.include.redist.man%
E 12
I 12
.\" %sccs.include.redist.roff%
E 12
E 10
E 7
.\"
E 5
I 1
D 12
.\"	%W% (Berkeley) %G%
E 12
I 12
.\"     %W% (Berkeley) %G%
E 12
.\"
D 5
.TH RESOLVER 5 "1 January 1986"
E 5
I 5
D 12
.TH RESOLVER 5 "%Q%"
E 5
.UC 4
.SH NAME
D 6
resolver configuration file
E 6
I 6
resolver \- resolver configuration file
E 6
I 5
.SH SYNOPSIS
/etc/resolv.conf
E 5
.SH DESCRIPTION
.LP
E 12
I 12
.Dd %Q%
.Dt RESOLVER 5
.Os BSD 4
.Sh NAME
.Nm resolver
.Nd resolver configuration file
.Sh SYNOPSIS
.Nm resolv.conf
.Sh DESCRIPTION
E 12
I 8
The
D 12
.I resolver
is a set of routines in the C library (\c
D 11
.IR resolv (3))
E 11
I 11
.IR resolver (3))
E 11
that provide access to the Internet Domain Name System.
E 12
I 12
.Xr resolver 3
is a set of routines in the C library
which provide access to the Internet Domain Name System.
E 12
E 8
The resolver configuration file contains information that is read
D 5
by the resolver routines the first time they are invoked in a process.
E 5
I 5
by the resolver routines the first time they are invoked by a process.
E 5
The file is designed to be human readable and contains a list of
D 3
name-value pairs which provide various types of resolver information.
E 3
I 3
D 8
name-value pairs that provide various types of resolver information.
E 8
I 8
keywords with values that provide various types of resolver information.
E 8
E 3
D 12
.LP
E 12
I 12
.Pp
E 12
I 5
On a normally configured system this file should not be necessary.
D 8
The only name server to be queried will be on the local machine and 
the domain name is retrieved from the system.
E 8
I 8
The only name server to be queried will be on the local machine,
the domain name is determined from the host name,
and the domain search path is constructed from the domain name.
E 8
D 12
.LP
E 12
I 12
.Pp
E 12
E 5
The different configuration options are:
D 12
.TP
\fBnameserver\fP
E 12
I 12
.Bl -tag -width nameserver
.It Sy nameserver
E 12
D 3
followed by the Internet address (in dot notation) of a nameserver
that the resolver should query.  At least one nameserver should be
listed.  Up to MAXNS (currently 3) nameservers may be listed, in which
E 3
I 3
D 8
followed by the Internet address (in dot notation) of a name server
that the resolver should query.  At least one name server should be
listed.  Up to MAXNS (currently 3) name servers may be listed, in that
E 3
case the resolver library queries tries them in the order listed.
E 8
I 8
Internet address (in dot notation) of a name server
that the resolver should query.
D 12
Up to MAXNS (currently 3) name servers may be listed,
E 12
I 12
Up to
.Dv MAXNS
(currently 3) name servers may be listed,
E 12
one per keyword.
If there are multiple servers,
the resolver library queries them in the order listed.
E 8
I 5
D 12
If no \fBnameserver\fP entries are present,
E 12
I 12
If no
.Sy nameserver
entries are present,
E 12
the default is to use the name server on the local machine.
E 5
D 3
(The algorithm used is to try a nameserver, and if the query times out,
try the next, until out of nameservers, then repeat trying all the nameservers
until a maximum number of retries has been made).
E 3
I 3
(The algorithm used is to try a name server, and if the query times out,
D 5
try the next, until out of name servers, then repeat trying all the name servers
E 5
I 5
try the next, until out of name servers,
then repeat trying all the name servers
E 5
until a maximum number of retries are made).
E 3
D 12
.TP
\fBdomain\fP
E 12
I 12
.It Sy domain
E 12
D 3
followed by a domain name, which is
the default domain to append to names which do not have a dot in them.
E 3
I 3
D 8
followed by a domain name, that is
the default domain to append to names that do not have a dot in them.
E 3
D 5
This defaults to empty (the root domain).
E 5
I 5
If no \fBdomain\fP entries are present, the domain returned by
\fIgethostname\fP\|(2) is used (everything after the first `.').
E 8
I 8
Local domain name.
Most queries for names within this domain can use short names
relative to the local domain.
D 12
If no \fBdomain\fP entry is present, the domain is determined
E 12
I 12
If no
.Sy domain
entry is present, the domain is determined
E 12
from the local host name returned by
D 12
\fIgethostname\fP\|(2);
E 12
I 12
.Xr gethostname 2 ;
E 12
the domain part is taken to be everything after the first `.'.
E 8
Finally, if the host name does not contain a domain part, the root
domain is assumed.
I 8
D 12
.TP
\fBsearch\fP
E 12
I 12
.It Sy search
E 12
Search list for host-name lookup.
The search list is normally determined from the local domain name;
by default, it begins with the local domain name, then successive
parent domains that have at least two components in their names.
This may be changed by listing the desired domain search path
D 12
following the \fIsearch\fP keyword with spaces or tabs separating
E 12
I 12
following the
.Sy search
keyword with spaces or tabs separating
E 12
the names.
Most resolver queries will be attempted using each component
of the search path in turn until a match is found.
Note that this process may be slow and will generate a lot of network
traffic if the servers for the listed domains are not local,
and that queries will time out if no server is available
for one of the domains.
I 9
D 12
.IP
E 12
I 12
.Pp
E 12
The search list is currently limited to six domains
with a total of 256 characters.
E 9
E 8
E 5
D 12
.LP
D 8
The name value pair must appear on a single line, and the keyword
E 8
I 8
The \fIdomain\fP and \fIsearch\fP keywords are mutually exclusive.
E 12
I 12
.El
.Pp
The
.Sy domain
and
.Sy search
keywords are mutually exclusive.
E 12
If more than one instance of these keywords is present,
the last instance will override.
D 12
.LP
E 12
I 12
.Pp
E 12
The keyword and value must appear on a single line, and the keyword
E 8
D 12
(e.g. \fBnameserver\fP) must start the line.  The value follows
E 12
I 12
(e.g.
.Sy nameserver )
must start the line.  The value follows
E 12
D 3
the keyword, separated by whitespace.
E 3
I 3
the keyword, separated by white space.
E 3
D 12
.SH FILES
.I /etc/resolv.conf
.SH SEE ALSO
D 3
gethostent(3n), resolver(3), named(8)
E 3
I 3
D 4
gethostent(3n), resolver(3), named(8), BIND - Operations Guide
E 4
I 4
D 5
gethostent(3n), resolver(3), named(8), Name Server Operations Guide for BIND
E 5
I 5
D 8
gethostbyname(3N), resolver(3), named(8)
E 8
I 8
gethostbyname(3N), resolver(3), hostname(7), named(8)
E 8
.br
Name Server Operations Guide for BIND
E 12
I 12
.Sh FILES
.Bl -tag -width /etc/resolv.conf -compact
.It Pa /etc/resolv.conf
The file
.Nm resolv.conf
resides in
.Pa /etc .
.El
.Sh SEE ALSO
.Xr gethostbyname 3 ,
.Xr resolver 3 ,
.Xr hostname 7 ,
.Xr named 8
.Rs
.%T "Name Server Operations Guide for BIND"
.Re
.Sh HISTORY
The
.Nm resolv.conf
file format appeared in
.Bx 4.3 .
E 12
E 5
E 4
E 3
D 2
.SH BUGS
.LP
There is currently no way to indicate that one address for a host
is preferred over another.  (Solutions are being considered).


E 2
E 1
