share/man/man5/SCCS/s.services.5
h52839
s 00002/00002/00057
d D 8.1 93/06/05 13:53:55 bostic 9 8
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00035/00028/00024
d D 6.6 91/05/10 14:05:25 cael 8 7
c mdoc version three
e
s 00001/00011/00051
d D 6.5 90/06/23 18:01:58 trent 7 6
c new copyright notice
e
s 00001/00001/00061
d D 6.4 89/02/16 13:29:04 bostic 6 5
c forgot an N)
e
s 00014/00003/00048
d D 6.3 89/02/14 17:38:09 bostic 5 4
c add Berkeley specific copyright notice
e
s 00002/00003/00049
d D 6.2 86/11/25 21:29:08 bostic 4 2
c fixed BUGS section -- kjd
e
s 00000/00001/00051
d R 6.2 86/05/06 16:13:34 kjd 3 2
c Fix bugs section
e
s 00001/00001/00051
d D 6.1 85/05/15 18:59:47 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00052/00000/00000
d D 5.1 85/05/15 18:59:39 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
D 5
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 5
I 5
D 8
.\" Copyright (c) 1983 The Regents of the University of California.
E 8
I 8
D 9
.\" Copyright (c) 1983, 1991 The Regents of the University of California.
E 8
.\" All rights reserved.
E 9
I 9
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 9
.\"
D 7
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 7
I 7
D 8
.\" %sccs.include.redist.man%
E 8
I 8
.\" %sccs.include.redist.roff%
E 8
E 7
E 5
.\"
D 8
.\"	%W% (Berkeley) %G%
E 8
I 8
.\"     %W% (Berkeley) %G%
E 8
.\"
D 2
.TH SERVICES 5  "15 January 1983"
E 2
I 2
D 8
.TH SERVICES 5  "%Q%"
E 2
.UC 5
.SH NAME
services \- service name data base
.SH DESCRIPTION
E 8
I 8
.Dd %Q%
.Dt SERVICES 5
.Os BSD 4.2
.Sh NAME
.Nm services
.Nd service name data base
.Sh DESCRIPTION
E 8
The
D 8
.I services
E 8
I 8
.Nm services
E 8
file contains information regarding
D 8
the known services available in the DARPA Internet.
E 8
I 8
the known services available in the
.Tn DARPA
Internet.
E 8
For each service a single line should be present
with the following information:
D 8
.HP 10
E 8
I 8
.Bd -unfilled -offset indent
E 8
official service name
D 8
.br
.ns
.HP 10
E 8
port number
D 8
.br
.ns
.HP 10
E 8
protocol name
D 8
.br
.ns
.HP 10
E 8
aliases
D 8
.PP
E 8
I 8
.Ed
.Pp
E 8
Items are separated by any number of blanks and/or
tab characters.  The port number and protocol name
are considered a single 
D 8
.IR item ;
E 8
I 8
.Em item ;
E 8
a ``/'' is used to
separate the port and protocol (e.g. ``512/tcp'').
A ``#'' indicates the beginning of
D 4
a comment; characters up to the end of the line are
not interpreted by routines which search the file.
E 4
I 4
a comment; subsequent characters up to the end of the line are
not interpreted by the routines which search the file.
E 4
D 8
.PP
E 8
I 8
.Pp
E 8
Service names may contain any printable
character other than a field delimiter, newline,
or comment character.
D 8
.SH FILES
/etc/services
.SH "SEE ALSO"
D 6
getservent(3N)
E 6
I 6
getservent(3)
E 6
.SH BUGS
E 8
I 8
.Sh FILES
.Bl -tag -width /etc/services -compact
.It Pa /etc/services
The
.Nm services
file resides in
.Pa /etc .
.El
.Sh SEE ALSO
.Xr getservent 3
.Sh BUGS
E 8
A name server should be used instead of a static file.
I 8
.Sh HISTORY
The
.Nm
file format appeared in
.Bx 4.2 .
E 8
D 4
A binary indexed file format should be available for fast access.
E 4
E 1
