share/man/man5/SCCS/s.shells.5
h58373
s 00002/00002/00037
d D 8.1 93/06/05 13:54:02 bostic 5 4
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00027/00014/00012
d D 5.4 91/05/10 14:05:26 cael 4 3
c mdoc version three
e
s 00001/00011/00025
d D 5.3 90/06/23 18:01:54 trent 3 2
c new copyright notice
e
s 00025/00012/00011
d D 5.2 89/02/23 12:22:08 bostic 2 1
c add Berkeley specific copyright, cleanups
e
s 00023/00000/00000
d D 5.1 86/11/25 21:32:19 bostic 1 0
c date and time created 86/11/25 21:32:19 by bostic
e
u
U
t
T
I 1
D 2
.\" Copyright (c) 1986 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 2
I 2
D 4
.\" Copyright (c) 1986 The Regents of the University of California.
E 4
I 4
D 5
.\" Copyright (c) 1986, 1991 The Regents of the University of California.
E 4
.\" All rights reserved.
E 5
I 5
.\" Copyright (c) 1986, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 5
E 2
.\"
I 2
D 3
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 3
I 3
D 4
.\" %sccs.include.redist.man%
E 4
I 4
.\" %sccs.include.redist.roff%
E 4
E 3
.\"
E 2
D 4
.\"	%W% (Berkeley) %G%
E 4
I 4
.\"     %W% (Berkeley) %G%
E 4
.\"
D 2
.TH SHELLS 5  "November 25, 1986"
E 2
I 2
D 4
.TH SHELLS 5 "%Q%"
E 2
.UC 5
.SH NAME
shells \- shell database
.SH DESCRIPTION
E 4
I 4
.Dd %Q%
.Dt SHELLS 5
.Os BSD 4.2
.Sh NAME
.Nm shells
.Nd shell database
.Sh DESCRIPTION
E 4
D 2
The \fIshells\fP file contains a list of the shells
on the system.  For each shell a single line should be
present consisting of the shell's path, relative to root.
E 2
I 2
The
D 4
.I shells
E 4
I 4
.Nm shells
E 4
file contains a list of the shells on the system.
For each shell a single line should be present, consisting of the
shell's path, relative to root.
E 2
D 4
.PP
E 4
I 4
.Pp
E 4
D 2
A ``#'' indicates the beginning of a comment; subsequent
characters up to the end of the line are not interpreted
by the routines which search the file.  Blank lines are also
ignored.
E 2
I 2
A hash mark (``#'') indicates the beginning of a comment; subsequent
characters up to the end of the line are not interpreted by the
routines which search the file.
Blank lines are also ignored.
E 2
D 4
.SH FILES
/etc/shells
.SH "SEE ALSO"
D 2
passwd(1), getusershell(3)
E 2
I 2
getusershell(3)
E 4
I 4
.Sh FILES
.Bl -tag -width /etc/shells -compact
.It Pa /etc/shells
The
.Nm shells
file resides in
.Pa /etc .
.El
.Sh SEE ALSO
.Xr getusershell 3
.Sh HISTORY
The
.Nm
file format appeared in
.Bx 4.3 tahoe .
E 4
E 2
E 1
