share/man/man5/SCCS/s.utmp.5
h11239
s 00001/00000/00192
d D 8.3 94/06/01 21:04:27 ah 14 13
c page breaks for 4.4BSD manuals
e
s 00002/00002/00190
d D 8.2 94/03/17 07:02:15 bostic 13 12
c date change characters were reversed
c From: "Chris G. Demetriou" <cgd@vangogh.CS.Berkeley.EDU>
e
s 00002/00002/00190
d D 8.1 93/06/05 13:54:28 bostic 12 11
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00183/00061/00009
d D 6.8 91/05/05 23:50:50 cael 11 9
c mdoc version three/bsd copyright
e
s 00165/00061/00009
d R 6.8 91/05/05 23:40:59 cael 10 9
c mdoc version three/bsd copyright
e
s 00003/00002/00067
d D 6.7 91/04/29 04:35:07 cael 9 8
c proprietary copyright
e
s 00002/00002/00067
d D 6.6 90/06/23 16:33:34 trent 8 7
c changed /etc/utmp to /var/run/utmp and /usr/adm/tmp to /var/log/wtmp
e
s 00006/00003/00063
d D 6.5 88/09/22 10:42:46 bostic 7 6
c add specific size defines
e
s 00022/00011/00044
d D 6.4 88/09/20 13:48:33 bostic 6 5
c mention name field for reboots and date changes
e
s 00001/00001/00054
d D 6.3 86/12/09 18:52:37 bostic 5 4
c added last to "see also" list
e
s 00001/00001/00054
d D 6.2 85/06/23 17:08:30 bloom 4 3
c make agree with date(1) and ac(8)
e
s 00001/00001/00054
d D 6.1 85/05/15 18:13:33 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00006/00013/00049
d D 5.1 85/05/15 18:13:23 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00062/00000/00000
d D 4.1 85/05/15 18:13:15 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
D 11
.\" Copyright (c) 1980 Regents of the University of California.
E 11
I 11
D 12
.\" Copyright (c) 1980, 1991 Regents of the University of California.
E 11
D 9
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 9
I 9
.\" All rights reserved.
E 12
I 12
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 12
.\"
D 11
.\"	%sccs.include.proprietary.roff%
E 11
I 11
.\" %sccs.include.redist.roff%
E 11
E 9
.\"
D 11
.\"	%W% (Berkeley) %G%
E 11
I 11
.\"     %W% (Berkeley) %G%
E 11
.\"
D 2
.TH UTMP 5 
E 2
I 2
D 3
.TH UTMP 5  "26 July 1983"
E 3
I 3
D 11
.TH UTMP 5  "%Q%"
E 3
E 2
.UC 4
.SH NAME
utmp, wtmp \- login records
.SH SYNOPSIS
.B #include <utmp.h>
.SH DESCRIPTION
The
.I utmp
D 2
file allows one to discover information about who is currently
using UNIX.
E 2
I 2
file records information about who is currently using the system.
E 2
D 6
The file is a sequence of entries with the following
structure declared in the include file:
E 6
I 6
The file is a sequence of entries with the following structure, as
defined in the include file.
E 6
.RS
.PP
.nf
I 7
#define UT_NAMESIZE	8
#define UT_LINESIZE	8
#define UT_HOSTSIZE	16
E 11
I 11
.Dd %Q%
.Dt UTMP 5
.Os BSD 4
.Sh NAME
.Nm utmp ,
.Nm wtmp ,
.Nm lastlog
.Nd login records
.Sh SYNOPSIS
.Fd #include <utmp.h>
.Sh DESCRIPTION
The file
.Aq Pa utmp.h
declares the structures used to record information about current
users in the file
.Nm utmp ,
logins and logouts in the file
.Nm wtmp ,
and last logins in the file
.Nm lastlog .
The time stamps of date changes, shutdowns and reboots are also logged in
the
.Nm wtmp
file.
.Pp
These files can grow rapidly on busy systems, daily or weekly rotation
is recommended. 
If any of these files do not exist, it is not created.
These
files must be created manually and are normally maintained in either the script
.Pa /etc/daily
or the script
.Pa /etc/weekly .
(See
.Xr cron 8 . )
.Bd -literal -offset indent
#define _PATH_UTMP      "/var/run/utmp"
#define _PATH_WTMP      "/var/log/wtmp"
#define _PATH_LASTLOG   "/var/log/lastlog"

#define UT_NAMESIZE     8
#define UT_LINESIZE     8
#define UT_HOSTSIZE     16

struct lastlog {
        time_t  ll_time;
        char    ll_line[UT_LINESIZE];
        char    ll_host[UT_HOSTSIZE];
};

E 11
E 7
D 6
.so /usr/include/utmp.h
E 6
I 6
struct utmp {
D 7
	char	ut_line[8];
	char	ut_name[8];
	char	ut_host[16];
E 7
I 7
D 11
	char	ut_line[UT_NAMESIZE];
	char	ut_name[UT_LINESIZE];
	char	ut_host[UT_HOSTSIZE];
E 7
	time_t	ut_time;
E 11
I 11
        char    ut_line[UT_LINESIZE];
        char    ut_name[UT_NAMESIZE];
        char    ut_host[UT_HOSTSIZE];
        long    ut_time;
E 11
};
D 11
.ft R
.ad
E 6
.fi
.RE
.PP
This structure gives the name of the special file
associated with the user's terminal, the user's login name,
and the time of the login in the form of
D 2
.IR time (2).
E 2
I 2
D 6
.IR time (3C).
E 6
I 6
.IR time (3).
E 6
E 2
.PP
E 11
I 11
.Ed
.Pp
Each time a user logs in, the
.Xr login
program looks up the user's
.Tn UID
in the file
.Nm lastlog.
If it is found, the timestamp of the last time the user logged
in, the terminal line and the hostname
are written to the standard output. (Providing the login is not
.Em quiet ,
see
.Xr login 1 . )
E 11
The
D 11
.I wtmp
file records all logins and logouts.
D 2
Its format is exactly like
.I utmp
except that
a null user name indicates a logout on the associated
terminal.
E 2
I 2
A null user name indicates a logout on the associated terminal.
E 2
D 6
Furthermore, the terminal name `~' indicates that the
system was rebooted at the indicated time;
the adjacent pair of entries with terminal names
D 2
`\^|\^' and `}' indicate the system-maintained time
just before and just after a
E 2
I 2
D 4
`\^|\^' and `}' indicate the system-maintained time just before and just after a
E 4
I 4
`\^|\^' and `{' indicate the system-maintained time just before and just after a
E 6
I 6
Furthermore, the terminal name `~' indicates that the system was
rebooted at the indicated time; in such cases the name will be
``shutdown''.  An adjacent pair of entries with terminal names
`\^|\^' and `{' indicate the system-maintained time just before
and just after a
E 6
E 4
E 2
.I date
D 6
command has changed the system's idea of the time.
E 6
I 6
command has changed the system's idea of the time.  The name for
both entries will be ``date''.
E 6
.PP
.I Wtmp
is maintained by
.IR login (1)
E 11
I 11
.Xr login
program then records the new login time in the file
.Nm lastlog .
.Pp
After the new
.Fa lastlog
record is written ,
.\" the
.\" .Xr libutil 3
.\" routine
the file
.Nm utmp
is opened and the
.Fa utmp
record for the user inserted.
This record remains there until
the user logs out at which time it is deleted.
The
.Nm utmp
file is used by the programs
.Xr rwho 1 ,
.Xr users 1 ,
.Xr w 1 ,
E 11
and
D 11
.IR init (8).
D 6
Neither of these programs creates the file,
D 2
so if it is removed record-keeping is turned off.
It is summarized by
E 2
I 2
so if it is removed record-keeping is turned off.  It is summarized by
E 6
I 6
Neither of these programs creates the file, so if it is removed
record-keeping is turned off.  It is summarized by
.IR last (1)
E 11
I 11
.Xr who 1 .
.Pp
Next, the
.Xr login
program opens the file
.Nm wtmp ,
and appends the user's
.Fa utmp
record.
The same
.Fa utmp
record, with an updated time stamp is later appended
to the file when the user logs out. (See
.Xr init 8 . )
The
.Nm wtmp
file is used by the programs
.Xr last 1
E 11
and
E 6
E 2
D 11
.IR ac (8).
.SH FILES
D 8
/etc/utmp
E 8
I 8
/var/run/utmp
E 8
.br
D 8
/usr/adm/wtmp
E 8
I 8
/var/log/wtmp
E 8
.SH "SEE ALSO"
D 5
login(1), init(8), who(1), ac(8)
E 5
I 5
last(1), login(1), who(1), ac(8), init(8)
E 11
I 11
.Xr ac 8 .
.Pp
In the event of a date change, a shutdown or reboot, the
following items are logged in the
.Nm wtmp
file.
I 14
.ne 1i
E 14
.Pp
.Bl -tag -width shutdownxx -compact
.It Li reboot
.It Li shutdown
A system reboot or shutdown has been initiated.
The character
.Ql \&~
is placed in the field
.Fa ut_line ,
and
.Li reboot
or
.Li shutdown
in the field
.Fa ut_name .
(See
.Xr shutdown 8
and
.Xr reboot 8 . )
.Pp
.It Li date
The system time has been manually or automatically updated.
(See
.Xr date 1 . )
The command name
.Xr date
is recorded in the field
.Fa ut_name .
In the field
.Fa ut_line ,
the character
D 13
.Ql \&{
indicates the time prior to the change, and the character
E 13
.Ql \\*(Ba
I 13
indicates the time prior to the change, and the character
.Ql \&{
E 13
indicates the new time.
.El
.Sh FILES
.Bl -tag -width /var/log/lastlog -compact
.It Pa /var/run/utmp
The
.Nm utmp file.
.It Pa /var/log/wtmp
The
.Nm wtmp file.
.It Pa /var/log/lastlog
The
.Nm lastlog file.
.El
.Sh SEE ALSO
.Xr last 1 ,
.Xr login 1 ,
.Xr who 1 ,
.Xr ac 8 ,
.Xr init 8
.Sh HISTORY
A
.Nm utmp
and
.Nm wtmp
file format appeared in
.At v6 .
The
.Nm lastlog
file format appeared in
.Bx 3.0 .
E 11
E 5
E 1
