sbin/dmesg/SCCS/s.dmesg.8
h51267
s 00002/00002/00035
d D 8.1 93/06/05 10:51:28 bostic 8 7
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00011/00024/00026
d D 6.5 91/05/02 19:29:31 bostic 7 6
c Rewrite from scratch, add Berkeley specific copyright.
c Delete the "-" option, don't display a timestamp.  Do avoid nonprintable
c characters, work on dead kernels
c 
e
s 00040/00026/00010
d D 6.4 91/03/16 17:05:53 cael 6 5
c macro and text revision (-mdoc version 3)
e
s 00002/00002/00034
d D 6.3 90/06/24 21:28:12 trent 5 4
c new pathnames (dmesg & msgbuf)
e
s 00010/00022/00026
d D 6.2 86/05/19 19:00:28 karels 4 3
c obsolete
e
s 00001/00001/00047
d D 6.1 85/04/27 13:20:13 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00001/00001/00047
d D 5.1 85/04/27 13:19:41 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00048/00000/00000
d D 4.1 85/04/27 13:19:20 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
D 6
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 6
I 6
D 8
.\" Copyright (c) 1980, 1991 Regents of the University of California.
.\" All rights reserved.
E 8
I 8
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 8
E 6
.\"
D 6
.\"	%W% (Berkeley) %G%
E 6
I 6
.\" %sccs.include.redist.man%
E 6
.\"
D 2
.TH DMESG 8 "4/1/81"
E 2
I 2
D 3
.TH DMESG 8 "4 February 1983"
E 3
I 3
D 6
.TH DMESG 8 "%Q%"
E 3
E 2
.UC 4
.SH NAME
dmesg \- collect system diagnostic messages to form error log
.SH SYNOPSIS
D 5
.B /etc/dmesg
E 5
I 5
.B dmesg
E 5
[ \- ]
.SH DESCRIPTION
I 4
.B N.B.:
E 4
.I Dmesg
E 6
I 6
.\"     %W% (Berkeley) %G%
.\"
.Dd %Q%
.Dt DMESG 8
.Os BSD 4
.Sh NAME
.Nm dmesg
D 7
.Nd "collect system diagnostic messages to form error log"
E 7
I 7
.Nd "display the system message buffer"
E 7
.Sh SYNOPSIS
.Nm dmesg
D 7
.Op Fl 
E 7
I 7
.Op Fl M Ar core
.Op Fl N Ar system
E 7
.Sh DESCRIPTION
D 7
.Sy N.B.:
E 7
.Nm Dmesg
E 6
I 4
D 7
is obsoleted by
D 6
.IR syslogd (8)
E 6
I 6
.Xr syslogd 8
E 6
for maintenance of the system error log.
E 7
I 7
displays the contents of the system message buffer.
E 7
D 6
.PP
.I Dmesg
E 6
I 6
.Pp
D 7
.Nm Dmesg
E 6
E 4
looks in a system buffer for recently printed diagnostic messages
and prints them on the standard output.
D 4
The messages are those printed by the system when device (hardware) errors
occur and (occasionally) when system tables overflow non-fatally.
E 4
I 4
The messages are those printed or logged
by the system when errors occur.
E 4
D 6
If the
.B \-
flag is given, then
.I dmesg
E 6
I 6
.Pp
Available option:
E 7
I 7
The options are as follows:
E 7
.Bl -tag -width Ds
D 7
.It Fl
.Nm Dmesg
E 6
computes (incrementally) the new messages since the last time it
was run and places these on the standard output.
D 4
This is typically used with
.IR cron (8)
to produce the error log
.I /usr/adm/messages
by running the command
.IP
/etc/dmesg \- >> /usr/adm/messages
.LP
every 10 minutes.
E 4
D 6
.SH FILES
.ta 2i
D 4
/usr/adm/messages	error log (conventional location)
.br
E 4
D 5
/usr/adm/msgbuf	scratch file for memory of \- option
E 5
I 5
/var/log/msgbuf	scratch file for memory of \- option
E 5
D 4
.SH BUGS
The system error message buffer is of small finite size.  As
.I dmesg
is run only every few minutes, not all error messages
are guaranteed to be logged.  This can be construed as a blessing rather
than a curse.
.PP
Error diagnostics generated immediately before a system crash will
never get logged.
E 4
I 4
.SH SEE ALSO
syslogd(8)
E 6
I 6
.El
.Sh FILES
.Bl -tag -width /var/log/msgbuf -compact
.It Pa /var/log/msgbuf
scratch file for memory of
.Ql Fl
option
E 7
I 7
.It Fl M
Extract values associated with the name list from the specified core
instead of the default ``/dev/kmem''.
.It Fl N
Extract the name list from the specified system instead of the default
``/vmunix''.
E 7
.El
.Sh SEE ALSO
.Xr syslogd 8
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.0 .
E 6
E 4
E 1
