sbin/dump/SCCS/s.dump.8
h46688
s 00069/00051/00259
d D 8.3 95/05/01 23:40:02 mckusick 19 18
c use getopt option syntax
e
s 00001/00000/00309
d D 8.2 94/06/01 20:35:12 ah 18 17
c page breaks for 4.4BSD manuals
e
s 00002/00001/00310
d D 8.1 93/06/16 10:02:55 bostic 17 16
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00007/00001/00304
d D 6.13 93/06/16 09:58:19 mckusick 16 14
c (re)document B and b flags
e
s 00016/00003/00289
d D 6.12 93/05/11 14:03:31 torek 14 13
c document new h flag (control for honoring UF_NODUMP);
c f flag's file argument is not optional
e
s 00002/00000/00290
d D 6.11 93/01/25 15:43:29 mckusick 13 12
c also allow user@host:file
e
s 00015/00002/00275
d D 6.10 92/06/20 16:00:56 mckusick 12 11
c add -T option
e
s 00027/00017/00250
d D 6.9 91/07/23 21:50:33 mckusick 11 10
c add description of end-of-media handling
e
s 00003/00009/00264
d D 6.8 91/06/17 14:55:37 bostic 10 9
c minor cleanup, remove vestiges of AT&T wording
e
s 00014/00000/00259
d D 6.7 91/04/24 15:18:29 karels 9 8
c add B option
e
s 00182/00168/00077
d D 6.6 91/03/16 17:05:56 cael 8 7
c macro and text revision (-mdoc version 3)
e
s 00008/00000/00237
d D 6.5 91/02/24 14:32:06 mckusick 7 6
c document the 'b' and 'B' options
e
s 00001/00001/00236
d D 6.4 90/06/24 21:30:00 trent 6 5
c new pathname (dump)
e
s 00004/00001/00233
d D 6.3 86/05/23 11:22:31 mckusick 5 4
c list exit codes
e
s 00008/00002/00226
d D 6.2 86/05/19 19:12:55 karels 4 3
c bug
e
s 00001/00001/00227
d D 6.1 85/04/27 13:21:24 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00011/00029/00217
d D 5.1 85/04/27 13:20:54 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00246/00000/00000
d D 4.1 85/04/27 13:20:36 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
D 8
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 8
I 8
D 17
.\" Copyright (c) 1980, 1991 Regents of the University of California.
E 17
I 17
.\" Copyright (c) 1980, 1991, 1993
.\"	 Regents of the University of California.
E 17
.\" All rights reserved.
E 8
.\"
D 8
.\"	%W% (Berkeley) %G%
E 8
I 8
.\" %sccs.include.redist.man%
E 8
.\"
D 2
.TH DUMP 8 "4/1/81"
E 2
I 2
D 3
.TH DUMP 8 "4 February 1983"
E 3
I 3
D 8
.TH DUMP 8 "%Q%"
E 3
E 2
.UC 4
.SH NAME
dump \- incremental file system dump
.SH SYNOPSIS
D 6
.B /etc/dump
E 6
I 6
.B dump
E 6
[ key [
.I argument
\&... ] filesystem ]
.SH DESCRIPTION
.I Dump
copies to magnetic tape all files
changed after a certain date
in the
.I filesystem.
The
.I key
specifies the date and other options about the dump.
.I Key
consists of characters from
the set
D 2
.B 0123456789fuJsdWn.
E 2
I 2
.B 0123456789fusdWn.
E 2
.TP 5
.B  0\-9
This number is the `dump level'.
All files modified since the last date stored
in the file
.I /etc/dumpdates
for the same filesystem at lesser levels
will be dumped.
If no date is determined by the level,
the beginning of time is assumed;
thus the option
.B 0
causes the entire filesystem to be dumped.
.TP 5
.B f
Place the dump on the next 
.I argument 
file
instead of the tape.
I 2
If the name of the file is ``\-'',
.I dump 
writes to standard output.
E 2
.TP 5
.B u
If the dump completes successfully,
write the date of the beginning of the dump on
file
.I /etc/dumpdates.
This file records a separate date for
each filesystem and each dump level.
E 8
I 8
.\"     %W% (Berkeley) %G%
.\"
.Dd %Q%
.Dt DUMP 8
.Os BSD 4
.Sh NAME
.Nm dump
.Nd filesystem backup
.Sh SYNOPSIS
.Nm dump
D 12
.Op Cm 0123456789fusdWn Op Ar argument ...
E 12
I 12
D 14
.Op Cm 0123456789fusTdWn Op Ar argument ...
E 14
I 14
D 16
.Op Cm 0123456789hfusTdWn Op Ar argument ...
E 16
I 16
D 19
.Op Cm 0123456789BbhfusTdWn Op Ar argument ...
E 16
E 14
E 12
.Op Ar filesystem
E 19
I 19
.Op Fl 0123456789cnu
.Op Fl B Ar records
.Op Fl b Ar blocksize
.Op Fl d Ar density
.Op Fl f Ar file
.Op Fl h Ar level
.Op Fl s Ar feet
.Op Fl T Ar date
.Ar filesystem
.Nm dump
.Op Fl W Li \&| Fl w
.Pp
.in -\\n(iSu
(The
.Bx 4.3
option syntax is implemented for backward compatibility, but
is not documented here.)
E 19
.Sh DESCRIPTION
.Nm Dump
examines files
on a filesystem
and determines which files
need to be backed up. These files
are copied to the given disk, tape or other
D 11
storage medium for safe keeping (see
.Xr rdump 8
for
remote backups) .
E 11
I 11
storage medium for safe keeping (see the
D 19
.Cm f
E 19
I 19
.Fl f
E 19
option below for doing remote backups).
E 11
I 9
A dump that is larger than the output medium is broken into
D 11
multiple volumes of a fixed size;
E 11
I 11
multiple volumes.
On most media the size is determined by writing until an
end-of-media indication is returned.
On media that cannot reliably return an end-of-media indication
(such as some cartridge tape drives)
each volume is of a fixed size;
E 11
the actual size is determined by the tape size and density and/or
block count options below.
By default, the same output file name is used for each volume
after prompting the operator to change media.
E 9
.Pp
The following options are supported by
D 19
.Nm dump:
.Bl -tag -width 4n
.It Cm 0\-9
E 19
I 19
.Nm dump :
.Bl -tag -width Ds
.It Fl 0\-9
E 19
Dump levels.
A level 0, full backup,
D 14
guarantees the entire file system is copied.
E 14
I 14
guarantees the entire file system is copied
(but see also the
D 19
.Cm h
E 19
I 19
.Fl h
E 19
option below).
E 14
A level number above 0,
incremental backup,
tells dump to
copy all files new or modified since the
D 19
last dump of the same or lower level. The default
level is 9.
I 16
.It Cm B Ar records
E 19
I 19
last dump of the same or lower level.
The default level is 9.
.It Fl B Ar records
E 19
The number of dump records per volume.
This option overrides the calculation of tape size
based on length and density.
D 19
.It Cm b Ar blocksize
E 19
I 19
.It Fl b Ar blocksize
E 19
The number of kilobytes per dump record.
E 16
D 14
.It Cm f Op Ar file
E 14
I 14
D 19
.It Cm h Ar level
Honor the user
.Dq nodump
flag
.Dp Dv UF_NODUMP
only for dumps at or above the given
.Ar level .
The default honor level is 1,
so that incremental backups omit such files
but full backups retain them.
.It Cm f Ar file
E 19
I 19
.It Fl c
Modify the calculation of the default density and tape size to be more
appropriate for cartridge tapes.
.It Fl d Ar density
Set tape density to
.Ar density .
The default is 1600BPI.
.It Fl f Ar file
E 19
E 14
Write the backup to
.Ar file ;
.Ar file
may be a special device file
like
.Pa /dev/rmt12
(a tape drive),
.Pa /dev/rsd1c
D 11
(an optical drive),
E 11
I 11
(a disk drive),
E 11
an ordinary file,
or
.Ql Fl
(the standard output).
I 9
Multiple file names may be given as a single argument separated by commas.
Each file will be used for one dump volume in the order listed;
if the dump requires more volumes than the number of names given,
the last file name will used for all remaining volumes after prompting
for media changes.
I 11
If the name of the file is of the form
.Dq host:file ,
I 13
or
.Dq user@host:file ,
E 13
.Nm dump
writes to the named file on the remote host using
.Xr rmt 8 .
E 11
E 9
D 19
.It Cm d Ar density
Set tape density to
.Ar density .
The default is 1600BPI.
.It Cm n
E 19
I 19
.It Fl h Ar level
Honor the user
.Dq nodump
flag
.Dp Dv UF_NODUMP
only for dumps at or above the given
.Ar level .
The default honor level is 1,
so that incremental backups omit such files
but full backups retain them.
.It Fl n
E 19
Whenever
.Nm dump
requires operator attention,
notify all operators in the group
.Dq operator
by means similar to a
.Xr wall 1 .
D 19
.It Cm s Ar feet
E 19
I 19
.It Fl s Ar feet
E 19
D 12
Attempt to caluculate the amount of tape needed
E 12
I 12
Attempt to calculate the amount of tape needed
E 12
at a particular density.
If this amount is exceeded,
.Nm dump
D 10
prompts for a new tape. It is recommended to be a bit conservative
on this option.
The default size is 2300 feet.
E 10
I 10
prompts for a new tape.
It is recommended to be a bit conservative on this option.
The default tape length is 2300 feet.
I 18
.ne 1i
E 18
E 10
D 19
.It Cm u
E 19
I 19
.It Fl T Ar date
Use the specified date as the starting time for the dump
instead of the time determined from looking in
.Pa /etc/dumpdates .
The format of date is the same as that of
.Xr ctime 3 .
This option is useful for automated dump scripts that wish to
dump over a specific period of time.
The
.Fl T
option is mutually exclusive from the
.Fl u
option.
.It Fl u
E 19
Update the file
.Pa /etc/dumpdates
after a successful dump.
E 8
The format of
D 8
.I /etc/dumpdates
E 8
I 8
.Pa /etc/dumpdates
E 8
is readable by people, consisting of one
free format record per line:
D 8
filesystem name, increment level
E 8
I 8
filesystem name,
increment level
E 8
and
D 8
.I ctime(3)
E 8
I 8
.Xr ctime 3
E 8
D 11
format dump date.  
E 11
I 11
format dump date. 
E 11
D 8
.I /etc/dumpdates
E 8
I 8
There may be only one entry per filesystem at each level.
The file
.Pa /etc/dumpdates
E 8
may be edited to change any of the fields,
if necessary.
I 12
D 19
.It Cm T Ar date
Use the specified date as the starting time for the dump
instead of the time determined from looking in
.Pa /etc/dumpdates .
The format of date is the same as that of
.Xr ctime 3 .
This option is useful for automated dump scripts that wish to
dump over a specific period of time.
The
.Cm T
option is mutually exclusive from the
.Cm u
option.
E 12
D 2
Note that
.I /etc/dumpdates
is in a format different from that which previous versions of
.I dump
maintained in
.I /etc/ddate,
although the information content is identical.
E 2
D 8
.TP 5
D 2
.B  J
This option is intended to be invoked only when
the old format 
.I /etc/ddate
files are
updated to the new format
.I /etc/dumpdates
format.
The effect of this option is to convert between
the old, obsolete format and to the new format.
If the
.B J
option is invoked, all other options are ignored, and 
.I dump
terminates immediately.
.TP 5
E 2
.B s
The size of the dump tape is specified in feet.
The number of feet is taken from the next
.I argument.
When the specified size is reached,
.I dump
will wait for reels to be changed.
The default tape size is 2300 feet.
.TP 5
.B d
The density of the tape, expressed in BPI,
is taken from the next
.I argument.
This is used in calculating the amount of tape
used per reel. The default is 1600.
.TP 5
I 7
.B b
The number of kilobytes per dump record.
.TP 5
.B B
The number of dump records per volume.
This option overrides the calculation of tape size
based on length and density.
.TP 5
E 7
.B W
.I Dump
E 8
I 8
.It Cm W
E 19
I 19
.It Fl W
E 19
.Nm Dump
E 8
tells the operator what file systems need to be dumped.
This information is gleaned from the files
D 8
.I /etc/dumpdates
E 8
I 8
.Pa /etc/dumpdates
E 8
and
D 8
.I /etc/fstab.
E 8
I 8
.Pa /etc/fstab .
E 8
The
D 8
.B W
E 8
I 8
D 19
.Cm W
E 19
I 19
.Fl W
E 19
E 8
option causes
D 8
.I dump
E 8
I 8
.Nm dump
E 8
to print out, for each file system in
D 8
.I /etc/dumpdates
E 8
I 8
.Pa /etc/dumpdates
E 8
the most recent dump date and level,
and highlights those file systems that should be dumped.
D 11
If the 
E 11
I 11
If the
E 11
D 8
.B W
E 8
I 8
D 19
.Cm W
E 19
I 19
.Fl W
E 19
E 8
option is set, all other options are ignored, and
D 8
.I dump
E 8
I 8
.Nm dump
E 8
exits immediately.
D 8
.TP 5
.B w
E 8
I 8
D 19
.It Cm w
E 19
I 19
.It Fl w
E 19
E 8
Is like W, but prints only those filesystems which need to be dumped.
D 8
.TP 5
.B n
Whenever
.I dump
requires operator attention,
notify by means similar to a
D 2
.I wall(1)
E 2
I 2
.IR wall (1)
E 2
all of the operators in the group \*(lqoperator\*(rq.
.PP
If no arguments are given,
the
.I key
is assumed to be
.B 9u
and a default file system is dumped
to the default tape.
.PP
.I Dump
E 8
I 8
.El
D 10
.Pp
If no options are specified,
.Nm dump
does a level
.Cm 9u
to the system's default tape device.
E 10
.Pp
.Nm Dump
E 8
requires operator intervention on these conditions:
end of tape,
end of dump,
tape write error,
tape open error or
disk read error (if there are more than a threshold of 32).
In addition to alerting all operators implied by the
D 8
.B n
E 8
I 8
D 19
.Cm n
E 19
I 19
.Fl n
E 19
E 8
key,
D 8
.I dump
E 8
I 8
.Nm dump
E 8
D 11
interacts with the operator on 
E 11
I 11
interacts with the operator on
E 11
D 8
.I dump's
E 8
I 8
.Em dump's
E 8
control terminal at times when
D 8
.I dump
E 8
I 8
.Nm dump
E 8
can no longer proceed,
or if something is grossly wrong.
All questions
D 8
.I dump
E 8
I 8
.Nm dump
E 8
poses
D 8
.B must
E 8
I 8
.Em must
E 8
D 11
be answered by typing \*(lqyes\*(rq or \*(lqno\*(rq,
E 11
I 11
be answered by typing
.Dq yes
or
.Dq no ,
E 11
appropriately.
D 8
.PP
E 8
I 8
.Pp
E 8
Since making a dump involves a lot of time and effort for full dumps,
D 8
.I dump
E 8
I 8
.Nm dump
E 8
checkpoints itself at the start of each tape volume.
If writing that volume fails for some reason,
D 8
.I dump
E 8
I 8
.Nm dump
E 8
will,
with operator permission,
restart itself from the checkpoint
after the old tape has been rewound and removed,
and a new tape has been mounted.
D 8
.PP
.I Dump
E 8
I 8
.Pp
.Nm Dump
E 8
tells the operator what is going on at periodic intervals,
including usually low estimates of the number of blocks to write,
the number of tapes it will take, the time to completion, and
the time to the tape change.
The output is verbose,
so that others know that the terminal
controlling
D 8
.I dump
E 8
I 8
.Nm dump
E 8
is busy,
and will be for some time.
D 8
.PP
Now a short suggestion on how to
perform dumps.
Start with a full level 0 dump
.PP
	dump 0un
.PP
Next, dumps of active file 
E 8
I 8
.Pp
In the event of a catastrophic disk event, the time required
to restore all the necessary backup tapes or files to disk
can be kept to a minimum by staggering the incremental dumps.
An efficient method of staggering incremental dumps
to minimize the number of tapes follows:
.Bl -bullet -offset indent
.It
Always start with a level 0 backup, for example:
.Bd -literal -offset indent
D 11
/etc/dump 0ufds /dev/nrst1 54000 6000 /usr/src
E 11
I 11
D 19
/etc/dump 0uf /dev/nrst1 /usr/src
E 19
I 19
/sbin/dump -0u -f /dev/nrst1 /usr/src
E 19
E 11
.Ed
.Pp
This should be done at set intervals, say once a month or once every two months,
and on a set of fresh tapes that is saved forever.
.It
D 11
After a level 0, dumps of active file 
E 11
I 11
After a level 0, dumps of active file
E 11
E 8
systems are taken on a daily basis,
using a modified Tower of Hanoi algorithm,
with this sequence of dump levels:
D 8
.ce 1
E 8
I 8
.Bd -literal -offset indent
E 8
3 2 5 4 7 6 9 8 9 9 ...
D 8
For the daily dumps, a set of 10 tapes per dumped file system
is used on a cyclical basis.
E 8
I 8
.Ed
.Pp
For the daily dumps, it should be possible to use a fixed number of tapes
for each day, used on a weekly basis.
E 8
Each week, a level 1 dump is taken, and
D 8
the daily Hanoi sequence repeats with 3.
For weekly dumps, a set of 5 tapes per dumped file system is
E 8
I 8
the daily Hanoi sequence repeats beginning with 3.
For weekly dumps, another fixed set of tapes per dumped file system is
E 8
used, also on a cyclical basis.
D 8
Each month, a level 0 dump is taken
on a set of fresh tapes that is saved forever.
.SH FILES
.nf
.ta \w'/etc/dumpdates\ \ 'u
/dev/rrp1g	default filesystem to dump from
/dev/rmt8	default tape unit to dump to
D 5
/etc/ddate	old format dump date record (obsolete after \fB\-J\fR option)
E 5
/etc/dumpdates	new format dump date record 
D 2
/etc/fstab	Dump table: file systems and frequency
E 2
I 2
/etc/fstab	dump table: file systems and frequency
E 2
/etc/group	to find group \fIoperator\fP
.fi
.DT
.br
.SH "SEE ALSO"
D 2
restor(1), dump(5), dumpdir(1), fstab(5)
E 2
I 2
restore(8),
dump(5),
fstab(5)
E 2
.SH DIAGNOSTICS
E 8
I 8
.El
.Pp
After several months or so, the daily and weekly tapes should get
rotated out of the dump cycle and fresh tapes brought in.
.Sh FILES
.Bl -tag -width /etc/dumpdates -compact
D 11
.It Pa /dev/rrp1g
default filesystem to dump from (system dependent).
E 11
.It Pa /dev/rmt8
default tape unit to dump to
.It Pa /etc/dumpdates
D 11
new format dump date record 
E 11
I 11
dump date records
E 11
.It Pa /etc/fstab
dump table: file systems and frequency
.It Pa /etc/group
to find group
.Em operator
.El
.Sh SEE ALSO
D 11
.Xr rdump 8 ,
E 11
.Xr restore 8 ,
I 11
.Xr rmt 8 ,
E 11
.Xr dump 5 ,
.Xr fstab 5
.Sh DIAGNOSTICS
E 8
Many, and verbose.
I 5
D 8
.PP
E 8
I 8
.Pp
E 8
Dump exits with zero status on success.
Startup errors are indicated with an exit code of 1;
abnormal termination is indicated with an exit code of 3.
E 5
D 8
.SH BUGS
.PP
E 8
I 8
.Sh BUGS
D 19
.Pp
E 19
E 8
D 4
Sizes are based on 1600 BPI blocked tape;
the raw magtape device has to be used to approach these densities.
E 4
Fewer than 32 read errors on the filesystem are ignored.
I 19
.Pp
E 19
Each reel requires a new process, so parent processes for
reels already written just hang around until the entire tape
is written.
I 4
D 8
.PP
.I Dump
E 8
I 8
.Pp
.Nm Dump
E 8
with the
D 8
.B W
E 8
I 8
D 19
.Cm W
E 19
I 19
.Fl W
E 19
E 8
or
D 8
.B w
E 8
I 8
D 19
.Cm w
E 19
I 19
.Fl w
E 19
E 8
options does not report filesystems that have never been recorded
D 8
in /etc/dumpdates, even if listed in /etc/fstab.
E 4
.PP
E 8
I 8
in
.Pa /etc/dumpdates ,
even if listed in
.Pa /etc/fstab .
.Pp
E 8
It would be nice if
D 8
.I dump
E 8
I 8
.Nm dump
E 8
knew about the dump sequence,
kept track of the tapes scribbled on,
told the operator which tape to mount when,
and provided more assistance
for the operator running
D 2
.I restor.
E 2
I 2
D 8
.IR restore .
E 8
I 8
.Xr restore .
.Sh HISTORY
A
D 11
.Nm
E 11
I 11
.Nm dump
E 11
command appeared in Version 6 AT&T UNIX.
E 8
E 2
E 1
