usr.bin/w/SCCS/s.uptime.1
h50582
s 00003/00003/00031
d D 8.2 94/04/18 07:42:16 bostic 8 7
c typo
e
s 00002/00002/00032
d D 8.1 93/06/06 22:23:12 bostic 7 6
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00007/00007/00027
d D 6.3 93/04/27 15:20:23 bostic 6 5
c fix header description
e
s 00027/00016/00007
d D 6.2 91/04/23 16:16:29 cael 5 3
c mdoc version 3
e
s 00006/00005/00018
d R 6.2 90/06/24 19:21:56 cael 4 3
c converted man page
e
s 00001/00001/00022
d D 6.1 85/04/29 15:06:31 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00002/00003/00021
d D 5.1 85/04/29 15:06:24 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00024/00000/00000
d D 4.1 85/04/29 15:06:15 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
D 5
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 5
I 5
D 7
.\" Copyright (c) 1980, 1990 The Regents of the University of California.
.\" All rights reserved.
E 7
I 7
D 8
.\" Copyright (c) 1980, 1990, 1993
E 8
I 8
.\" Copyright (c) 1980, 1990, 1993, 1994
E 8
.\"	The Regents of the University of California.  All rights reserved.
E 7
E 5
.\"
D 5
.\"	%W% (Berkeley) %G%
E 5
I 5
.\" %sccs.include.redist.roff%
E 5
.\"
D 2
.TH UPTIME 1 11/13/79
E 2
I 2
D 3
.TH UPTIME 1 "13 November 1979"
E 3
I 3
D 5
.TH UPTIME 1 "%Q%"
E 3
E 2
.UC
.SH NAME
uptime \- show how long system has been up
.SH SYNOPSIS
.B uptime
.SH DESCRIPTION
E 5
I 5
.\"     %W% (Berkeley) %G%
.\"
.Dd %Q%
.Dt UPTIME 1
.Os BSD 3
.Sh NAME
.Nm uptime
D 6
.Nd show how long system has been up
E 6
I 6
.Nd show how long system has been running
E 6
.Sh SYNOPSIS
.Nm uptime
.Sh DESCRIPTION
E 5
D 6
Uptime prints the current time, the length of time the system has been up,
and the average number of jobs in the run queue over the last 1, 5 and
15 minutes.
It is, essentially, the first line of a
D 2
.I w
(1)
E 2
I 2
D 5
.IR w (1)
E 5
I 5
.Xr w 1
E 5
E 2
command.
E 6
I 6
The 
.Nm uptime
D 8
utiliity
displays the current time, the length of time the system has been up,
E 8
I 8
utility displays the current time,
the length of time the system has been up,
E 8
the number of users, and the load average of the system over the last
1, 5, and 15 minutes.
E 6
D 5
.SH FILES
/vmunix	system name list
.SH SEE ALSO
w(1)
E 5
I 5
.Sh FILES
.Bl -tag -width /vmunix
.It Pa /vmunix
system name list
.El
.Sh SEE ALSO
.Xr w 1
.Sh HISTORY
The
.Nm
command appeared in
.Bx 3.0 .
E 5
E 1
