usr.bin/w/SCCS/s.w.1
h60207
s 00002/00002/00113
d D 8.1 93/06/06 22:23:14 bostic 13 12
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00041/00030/00074
d D 6.9 93/04/27 15:20:49 bostic 12 11
c add -M, -N, -n, fix header description
e
s 00024/00025/00080
d D 6.8 91/04/23 19:50:06 bostic 11 10
c minor cleanup -- written by Bill Joy, and no longer contains any
c tainted code.  Add Berkeley specific copyright notice
e
s 00083/00041/00022
d D 6.7 91/04/23 16:16:30 cael 10 9
c mdoc version 3
e
s 00002/00002/00061
d D 6.6 90/07/27 16:40:07 marc 9 8
c shit - everyone wants it back as -i
e
s 00005/00034/00058
d D 6.5 90/07/27 14:41:28 marc 8 7
c update for new flag and removal of old ones
e
s 00008/00007/00084
d D 6.4 90/06/24 19:23:20 cael 7 6
c converted man page
e
s 00001/00003/00090
d D 6.3 87/04/28 12:05:19 bostic 6 5
c added -l flag to synopsis
e
s 00006/00002/00087
d D 6.2 86/12/21 16:32:31 karels 5 3
c -f
e
s 00006/00002/00087
d R 6.2 86/12/21 16:31:27 karels 4 3
c -f
e
s 00001/00001/00088
d D 6.1 85/04/29 15:09:44 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00001/00001/00088
d D 5.1 85/04/29 15:09:36 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00089/00000/00000
d D 4.1 85/04/29 15:09:27 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
D 7
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 7
I 7
D 10
.\" Copyright (c) 1980, 1990 Regents of the University of California.
E 10
I 10
D 13
.\" Copyright (c) 1980, 1990, 1991 Regents of the University of California.
E 10
.\" All rights reserved.
E 13
I 13
.\" Copyright (c) 1980, 1990, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 13
E 7
.\"
D 7
.\"	%W% (Berkeley) %G%
E 7
I 7
.\" %sccs.include.redist.man%
E 7
.\"
D 2
.TH W 1 8/15/80
E 2
I 2
D 3
.TH W 1 "15 August 1980"
E 3
I 3
D 7
.TH W 1 "%Q%"
E 7
I 7
.\"     %W% (Berkeley) %G%
.\"
D 10
.TH W 1 "%Q"
E 7
E 3
E 2
.UC 4
.SH NAME
D 7
w \- who is on and what they are doing
E 7
I 7
w \- who is logged in and what they are doing
E 7
.SH SYNOPSIS
.B w
[
D 6
.B \-h
] [
.B \-s
E 6
I 6
D 8
.B \-hls
E 8
I 8
D 9
.B \-ht
E 9
I 9
.B \-hi
E 9
E 8
E 6
] [ user ]
.SH DESCRIPTION
.I W
E 10
I 10
.Dd %Q%
.Dt W 1
.Os BSD 4
.Sh NAME
.Nm w
.Nd "who present users are and what they are doing"
.Sh SYNOPSIS
.Nm w
D 11
.Op Fl fhls
E 11
I 11
D 12
.Op Fl hi
E 12
I 12
.Op Fl hin
.Op Fl M Ar core
.Op Fl N Ar system
E 12
E 11
.Op Ar user
.Sh DESCRIPTION
D 12
.Nm W
E 10
prints a summary of the current activity on the system,
E 12
I 12
The
.Nm w
utility prints a summary of the current activity on the system,
E 12
including what each user is doing.
D 10
The heading line shows the current time of day,
E 10
I 10
D 11
The heading shows the current time of day,
E 10
how long the system has been up,
the number of users logged into the system,
and the load averages.
E 11
I 11
D 12
The heading shows the current time of day, how long the system has been up,
the number of users logged into the system, and the load averages.
E 11
The load average numbers give the number of jobs in the run queue
averaged over 1, 5 and 15 minutes.
E 12
I 12
The first line displays the current time of day, how long the system has
been running, the number of users logged into the system, and the load
averages.
The load average numbers give the number of jobs in the run queue averaged
over 1, 5 and 15 minutes.
E 12
D 10
.PP
E 10
I 10
.Pp
E 10
D 12
The fields output are:
D 10
the users login name,
the name of the tty the user is on,
E 10
I 10
D 11
the user's login name,
the name of the tty(terminal) the user is on,
E 10
D 5
the time of day the user logged on,
the number of minutes since the user last typed anything,
E 5
I 5
the host from which the user is logged in,
the time the user logged on,
E 11
I 11
the user's login name, the name of the terminal (tty) the user is on,
the host from which the user is logged in, the time the user logged on,
E 11
the time since the user last typed anything,
I 10
the
.Tn CPU
time used by all processes and their children on that tty,
the
.Tn CPU
D 11
time used by the currently active processes, and
E 10
E 5
D 8
the CPU time used by all processes and their children on that terminal,
the CPU time used by the currently active processes,
E 8
the name and arguments of the current process.
E 11
I 11
time used by the currently active processes, and the name and arguments
of the current process.
E 12
I 12
The fields output are the user's login name, the name of the terminal the
user is on, the host from which the user is logged in, the time the user
logged on, the time since the user last typed anything,
and the name and arguments of the current process.
E 12
E 11
D 10
.PP
The
.B \-h
flag suppresses the heading.
The
D 8
.B \-s
flag asks for a short form of output.
In the short form, the tty is abbreviated, the login time and cpu times
are left off, as are the arguments to commands.
.B \-l
gives the long output, which is the default.
E 8
I 8
D 9
.B \-t
E 9
I 9
.B \-i
E 9
flag causes output to sorted by idle time.
E 8
I 5
The
D 8
.B \-f
option suppresses the ``from'' field.
E 8
I 8
.B \-flsuw
flags are no longer supported.
E 8
E 5
.PP
E 10
I 10
.Pp
D 12
Available options are:
E 12
I 12
The options are as follows:
E 12
.Bl -tag -width Ds
.It Fl h
Suppress the heading.
.It Fl i
Output is sorted by idle time.
I 12
.It Fl M
Extract values associated with the name list from the specified
core instead of the default
.Dq /dev/kmem .
.It Fl N
Extract the name list from the specified system instead of the
default
.Dq /vmunix .
.It Fl n
Show network addresses as numbers (normally
.Nm w
interprets addresses and attempts to display them symbolically).
E 12
D 11
.It Fl flsuw
These flags are no longer supported.
E 11
.El
I 11
.Pp
E 11
E 10
If a
D 10
.I user
name is included,
the output will be restricted to that user.
.SH FILES
.ta 1i
D 7
/etc/utmp
E 7
I 7
/var/run/utmp
E 7
.br
/dev/kmem
.br
/dev/drum
.SH "SEE ALSO"
who(1), finger(1), ps(1)
D 8
.SH AUTHOR
Mark Horton
E 8
.SH BUGS
D 8
The notion of the ``current process'' is muddy.
The current algorithm is ``the highest numbered process on
the terminal that is not ignoring interrupts,
or, if there is none, the highest numbered process on the terminal''.
This fails, for example, in critical sections of programs
like the shell and editor,
or when faulty programs running in the background
fork and fail to ignore interrupts.
(In cases where no process can be found,
.I w
prints ``\-''.)
E 8
.PP
E 10
I 10
.Ar user
D 12
name is given, the output is restricted to that user.
E 12
I 12
name is specified, the output is restricted to that user.
E 12
D 11
.El
E 11
.Sh FILES
.Bl -tag -width /var/run/utmp -compact
.It Pa /var/run/utmp
D 11
.It Pa /dev/kmem
.It Pa /dev/drum
E 11
I 11
list of users on the system
E 11
.El
.Sh SEE ALSO
.Xr who 1 ,
.Xr finger 1 ,
D 12
.Xr ps 1
E 12
I 12
.Xr ps 1 ,
.Xr uptime 1 ,
E 12
.Sh BUGS
The notion of the
.Dq current process
is muddy.
D 11
The current algorithm is
``the highest numbered process on
the terminal that is not ignoring interrupts,
or, if there is none, the highest numbered process on the terminal''.
This fails, for example, in critical sections of programs
like the shell and editor,
or when faulty programs running in the background
fork and fail to ignore interrupts.
E 11
I 11
D 12
The current algorithm is ``the highest numbered process on the terminal that
is not ignoring interrupts, or, if there is none, the highest numbered
E 12
I 12
The current algorithm is ``the highest numbered process on the terminal
that is not ignoring interrupts, or, if there is none, the highest numbered
E 12
process on the terminal''.
This fails, for example, in critical sections of programs like the shell
and editor, or when faulty programs running in the background fork and fail
to ignore interrupts.
E 11
(In cases where no process can be found,
.Nm w
prints
.Dq \- . )
.Pp
The
.Tn CPU
D 12
time is only an estimate, in particular, if someone leaves a
background process running after logging out, the person currently
on that terminal is
E 12
I 12
time is only an estimate, in particular, if someone leaves a background
process running after logging out, the person currently on that terminal is
E 12
.Dq charged
with the time.
.Pp
Background processes are not shown, even though they account for
much of the load on the system.
.Pp
E 10
D 8
The CPU time is only an estimate, in particular, if someone leaves a
background process running after logging out, the person currently
on that terminal is ``charged'' with the time.
.PP
Background processes are not shown, even though they account for
much of the load on the system.
.PP
E 8
D 12
Sometimes processes, typically those in the background, are
printed with null or garbaged arguments.
E 12
I 12
Sometimes processes, typically those in the background, are printed with
null or garbaged arguments.
E 12
In these cases, the name of the command is printed in parentheses.
I 10
.Pp
D 12
.Nm W
does not know about the new conventions for detection of background jobs.
E 12
I 12
The 
.Nm w
utility does not know about the new conventions for detection of background
jobs.
E 12
It will sometimes find a background job instead of the right one.
I 11
.Sh COMPATIBILITY
The
.Fl f ,
.Fl l ,
.Fl s ,
and
.Fl w
flags are no longer supported.
E 11
.Sh HISTORY
The
.Nm
command appeared in
D 11
.Bx 3.0 .
E 11
I 11
.Ux 3.0 .
E 11
E 10
D 8
.PP
W does not know about the new conventions for detection of background jobs.
It will sometimes find a background job instead of the right one.
E 8
E 1
