usr.bin/vacation/SCCS/s.vacation.1
h26411
s 00002/00002/00143
d D 8.2 95/04/28 14:12:36 bostic 16 15
c vacation trivia
c From: Chris Torek <torek@BSDI.COM>
e
s 00002/00002/00143
d D 8.1 93/06/16 15:37:06 bostic 15 14
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00005/00010/00140
d D 6.10 93/06/16 15:32:53 mckusick 14 12
c minor updates
e
s 00002/00002/00148
d R 8.1 93/06/06 22:18:20 bostic 13 12
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00006/00006/00144
d D 6.9 91/07/30 18:39:55 cael 12 11
c clean up FILES list
e
s 00120/00095/00030
d D 6.8 91/04/23 21:38:24 cael 11 9
c mdoc version three
e
s 00005/00015/00110
d R 6.8 90/06/24 19:22:55 cael 10 9
c converted man page
e
s 00062/00024/00063
d D 6.7 89/02/07 20:45:03 bostic 9 8
c add -r flag for user settable reply intervals; replace dbm with ndbm;
c remove DATUM, DBREC -- should simply be able to bcopy buffer onto the time_t,
c shouldn't need all that struct stuff
e
s 00010/00005/00077
d D 6.6 88/07/09 11:45:08 bostic 8 7
c install approved copyright notice
e
s 00035/00027/00047
d D 6.5 87/12/26 15:26:26 bostic 7 6
c vacation now checks the To: and Cc: lines; rearrange a bit, 
c remove mention of vacation.ignore files
e
s 00001/00001/00073
d D 6.4 87/09/17 15:28:36 bostic 6 5
c stupid typo
e
s 00043/00060/00031
d D 6.3 87/07/03 15:28:54 bostic 5 2
c add FILES, logging, list of ignored addresses, other stuff
e
s 00043/00060/00031
d R 6.3 87/07/03 15:13:04 bostic 4 2
c added logging, FILES
e
s 00043/00060/00031
d R 6.3 87/07/03 15:10:24 bostic 3 2
c added logging, FILES
e
s 00015/00011/00076
d D 6.2 85/06/16 17:14:52 eric 2 1
c drop -t flag; clarify that .vacation.msg must include header; mention
c that Precedence: bulk/junk or From *-REQUEST@* will suppress message
e
s 00087/00000/00000
d D 6.1 85/05/20 20:56:18 mckusick 1 0
c manual page first distributed with 4.3BSD
e
u
U
t
T
I 1
D 5
.\" Copyright (c) 1985 Regents of the University of California.
E 5
I 5
D 11
.\" Copyright (c) 1985, 1987 Regents of the University of California.
E 11
I 11
D 15
.\" Copyright (c) 1985, 1987, 1990, 1991 Regents of the University of California.
E 11
E 5
D 7
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 7
I 7
.\" All rights reserved.
E 15
I 15
.\" Copyright (c) 1985, 1987, 1990, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 15
I 12
.\"
.\" %sccs.include.redist.roff%
E 12
E 7
.\"
I 7
D 11
.\" Redistribution and use in source and binary forms are permitted
D 8
.\" provided that this notice is preserved and that due credit is given
.\" to the University of California at Berkeley. The name of the University
.\" may not be used to endorse or promote products derived from this
.\" software without specific prior written permission. This software
.\" is provided ``as is'' without express or implied warranty.
E 8
I 8
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 11
I 11
D 12
.\" %sccs.include.redist.man%
E 12
I 12
.\"	%W% (Berkeley) %G%
E 12
E 11
E 8
.\"
E 7
D 11
.\"	%W% (Berkeley) %G%
E 11
I 11
D 12
.\"     %W% (Berkeley) %G%
E 11
.\"
E 12
D 5
.TH VACATION 1 "%Q%"
E 5
I 5
D 7
.TH VACATION 1 "June 16, 1985"
E 7
I 7
D 11
.TH VACATION 1 "%Q%"
E 7
E 5
.UC 6
.SH NAME
D 7
vacation \- return ``I am on vacation'' indication
E 7
I 7
vacation \- return ``I am not here'' indication
E 7
.SH SYNOPSIS
.B vacation
D 5
.B \-I
E 5
I 5
.B -i
I 9
[
.B -r
interval ]
E 9
E 5
.br
D 5
.B vacation
D 2
[
.BI \-t N
]
E 2
user
E 5
I 5
D 7
.B vacation login
E 7
I 7
.B vacation
[
.B -a
alias ] login
E 7
E 5
.SH DESCRIPTION
D 5
.I Vacation
returns a message to the sender of a message
telling that you are on vacation.
The intended use is in a
.I \&.forward
file.
For example,
your
.I \&.forward
file might have:
E 5
I 5
D 9
\fIVacation\fP returns a message to the sender of a message telling
D 7
them that you are not currently reading your mail.  The intended use
is in a \fI.forward\fP file.  For example, your \fI.forward\fP file might
have:
E 7
I 7
them that you are currently not reading your mail.  The intended use
is in a \fI.forward\fP file.  For example, your \fI.forward\fP file
might have:
E 9
I 9
.I Vacation
E 11
I 11
.Dd %Q%
.Dt VACATION 1
.Os BSD 4.3
.Sh NAME
.Nm vacation
.Nd return ``I am not here'' indication
.Sh SYNOPSIS
.Nm vacation
.Fl i
.Op Fl r Ar interval
.Nm vacation
.Op Fl a Ar alias
.Ar login
.Sh DESCRIPTION
.Nm Vacation
E 11
returns a message to the sender of a message telling them that you
are currently not reading your mail.  The intended use is in a
D 11
.I .forward
E 11
I 11
.Pa .forward
E 11
file.  For example, your
D 11
.I .forward
E 11
I 11
.Pa .forward
E 11
file might have:
E 9
E 7
E 5
D 11
.PP
.ti +5
D 5
\eeric, "|vacation eric"
E 5
I 5
D 7
\eeric, "|/usr/ucb/vacation eric"
E 7
I 7
\eeric, "|/usr/ucb/vacation -a allman eric"
E 7
E 5
.PP
E 11
I 11
.Bd -literal -offset indent
\eeric, "|/usr/bin/vacation -a allman eric"
.Ed
E 11
D 5
which would send messages to you
(assuming your login name was eric)
and send a message back to the sender.
E 5
I 5
which would send messages to you (assuming your login name was eric) and
D 7
send a message back to the sender.
E 7
I 7
D 11
reply to any messages for ``eric'' or ``allman''.
E 7
E 5
.PP
E 11
I 11
reply to any messages for
.Dq eric
or
.Dq allman .
.Pp
Available options:
.Bl -tag -width Ds
.It Fl a Ar alias
Handle messages for
.Ar alias
in the same manner as those received for the user's
login name.
.It Fl i
Initialize the vacation database files.  It should be used
before you modify your
.Pa .forward
file.
.It Fl r
Set the reply interval to
.Ar interval
days.  The default is one week.  An interval of
.Dq 0
means that
a reply is sent to each message, and an interval of
.Dq Li infinite
(actually, any non-numeric character) will never send more than
one reply.  It should be noted that intervals of
.Dq Li \&0
are quite
dangerous, as it allows mailers to get into
.Dq I am on vacation
loops.
.El
.Pp
E 11
I 7
D 9
No message will be sent unless \fIlogin\fP or an \fIalias\fP supplied
using the \fB-a\fP option is a substring of either the ``To:'' or ``Cc:''
headers of the mail.  No messages from ``???-REQUEST'', ``Postmaster'',
``UUCP'', ``MAILER'', or ``MAILER-DAEMON'' will be replied to, nor is a
notification sent if a ``Precedence: bulk'' or ``Precedence: junk'' line
is included in the mail headers.  Only one message per week will be sent
to each unique sender.  The people who have sent you messages are
maintained as an \fIndbm\fP(3) database in the files \fI.vacation.pag\fP
and \fI.vacation.dir\fP in your home directory.
E 9
I 9
No message will be sent unless
D 11
.I login
E 11
I 11
.Ar login
E 11
(or an
D 11
.I alias
E 11
I 11
.Ar alias
E 11
supplied using the
D 11
.B -a
option) is part of either the ``To:'' or ``Cc:'' headers of the mail.
No messages from ``???-REQUEST'', ``Postmaster'', ``UUCP'', ``MAILER'',
or ``MAILER-DAEMON'' will be replied to (where these strings are
case insensitive) nor is a notification sent if a ``Precedence: bulk''
or ``Precedence: junk'' line is included in the mail headers.
E 11
I 11
.Fl a
option) is part of either the
.Dq To:
or
.Dq Cc:
headers of the mail.
No messages from
.Dq ???-REQUEST ,
.Dq Postmaster ,
.Dq Tn UUCP ,
.Dq MAILER ,
or
.Dq MAILER-DAEMON
will be replied to (where these strings are
case insensitive) nor is a notification sent if a
.Dq Precedence: bulk
or
.Dq Precedence: junk
line is included in the mail headers.
E 11
D 16
The people who have sent you messages are maintained as an
D 11
.IR ndbm (3)
E 11
I 11
.Xr ndbm 3
E 16
I 16
The people who have sent you messages are maintained as a
.Xr db 3
E 16
E 11
D 14
database in the files
D 11
.I .vacation.pag
E 11
I 11
.Pa .vacation.pag
E 11
and
D 11
.I .vacation.dir
E 11
I 11
.Pa .vacation.dir
E 14
I 14
database in the file
.Pa .vacation.db
E 14
E 11
in your home directory.
E 9
D 11
.PP
D 9
The \fB-i\fP flag initializes the vacation database files.  It should be
used before you modify your \fI.forward\fP file.
E 9
I 9
The
.B -i
flag initializes the vacation database files.  It should be used
before you modify your
.I .forward
file.
E 9
.PP
E 7
D 5
.I Vacation
expects a file
.I \&.vacation.msg
in your home directory containing a message to be sent back
to each sender.
I 2
It should be an entire message
(including headers).
E 2
For example, it might say:
E 5
I 5
D 9
\fIVacation\fP expects a file \fI.vacation.msg\fP, in your home directory,
containing a message to be sent back to each sender.  It should be an entire
message (including headers).  For example, it might say:
E 9
I 9
The
.B -r
flag sets the reply interval to
.I interval
days.  The default is one week.  An interval of ``0'' means that
a reply is sent to each message, and an interval of ``infinite''
(actually, any non-numeric character) will never send more than
one reply.  It should be noted that intervals of ``0'' are quite
dangerous, as it allows mailers to get into ``I am on vacation''
loops.
E 9
E 5
.PP
I 9
.I Vacation
E 11
I 11
.Pp
D 14
.Pp
E 14
.Nm Vacation
E 11
expects a file
D 11
.IR .vacation.msg ,
E 11
I 11
.Pa .vacation.msg ,
E 11
in your home directory, containing a message to be sent back to each
sender.  It should be an entire message (including headers).  For
example, it might contain:
D 11
.PP
E 9
.in +5
.nf
E 11
I 11
.Pp
.Bd -unfilled -offset indent -compact
E 11
I 2
D 14
From: eric@ucbmonet.Berkeley.EDU (Eric Allman)
E 14
I 14
From: eric@CS.Berkeley.EDU (Eric Allman)
E 14
Subject: I am on vacation
D 7
Delivered-By-The-Graces-Of: the Vacation program
E 7
I 7
Delivered-By-The-Graces-Of: The Vacation program
Precedence: bulk
E 7

E 2
I am on vacation until July 22.  If you have something urgent,
D 2
please contact Joe Kalash (IngVAX:kalash).
E 2
I 2
D 14
please contact Joe Kalash <kalash@ucbingres.Berkeley.EDU>.
E 14
I 14
please contact Keith Bostic <bostic@CS.Berkeley.EDU>.
E 14
E 2
D 11
	--eric
.fi
.in -5
.PP
D 5
This message will only be sent once a week to each unique
sender.
D 2
This timeout can be reset using the
.B \-t
flag;
a trailing `s', `m', `h', `d', or `w'
scales the number to seconds, minutes, hours, days, or weeks
respectively.
E 2
The people who have sent you messages are kept in the files
.I \&.vacation.pag
and
.I \&.vacation.dir
in your home directory.
The
.B \-I
option initializes these files,
and should be executed before you modify your
.I \&.forward
file.
E 5
I 5
D 9
\fIVacation\fP reads the first line from the standard input for
a \s-1UNIX\s0-style ``From'' line to determine the sender.
\fISendmail\fP(8) includes this ``From'' line automatically.
E 9
I 9
.I Vacation
reads the first line from the standard input for a \s-1UNIX\s0-style
``From'' line to determine the sender.
.IR Sendmail (8)
includes this ``From'' line automatically.
E 9
E 5
.PP
E 11
I 11
--eric
.Ed
.Pp
.Nm Vacation
reads the first line from the standard input for a
D 12
.Tn UNIX
E 12
I 12
.Ux
E 12
.Dq From
line to determine the sender.
.Xr Sendmail 8
includes this
.Dq From
line automatically.
.Pp
E 11
D 5
If the
.B \-I
flag is not specified,
.I vacation
reads the first line from the standard input
for a \s-1UNIX\s0-style
``From'' line
to determine the sender.
If this is not present,
a nasty diagnostic is produced.
.IR Sendmail (8)
D 2
includes this automatically.
E 2
I 2
includes the ``From'' line automatically.
E 5
I 5
D 7
This message will only be sent once a week to each unique sender.  The
people who have sent you messages are maintained as an \fIndbm\fP(3)
database in the files \fI.vacation.pag\fP and \fI.vacation.dir\fP in
your home directory.  To avoid notifying various mailing lists of your
absence, any addresses listed in \fI.vacation.ignore\fP will never be
replied to.  Also, no messages from ``-REQUEST'', ``Postmaster'',
``UUCP'', ``MAILER'', or ``MAILER-DAEMON'' will be replied to.  Nor is
a notification sent if a ``Precedence: bulk'' or ``Precedence: junk'' line
is included in the mail header.
E 5
.PP
D 5
No message is sent
if the initial
``From'' line includes the string
``-REQUEST@''
or if a ``Precedence: bulk'' or ``Precedence: junk'' line
is included in the header.
E 2
.SH SEE\ ALSO
sendmail(8)
E 5
I 5
D 6
The \fB-i\fP flag initializes the vacation database files.  It should
E 6
I 6
The \fB-i\fP flag initializes the vacation database files.  It should be
E 6
used before you modify your \fI.forward\fP file as well as when you
update your \fI.vacation.ignore\fP file.
.PP
E 7
D 9
Fatal errors, such as calling \fIvacation\fP with incorrect arguments,
or with non-existent \fIlogin\fPs, are logged in the system log file,
using \fIsyslog\fP(8).
E 9
I 9
Fatal errors, such as calling
D 11
.I vacation
E 11
I 11
.Nm vacation
E 11
with incorrect arguments, or with non-existent
D 11
.IR login s,
E 11
I 11
.Ar login Ns Ar s ,
E 11
are logged in the system log file, using
D 11
.IR syslog (8).
E 9
.SH FILES
.nf
D 7
.ta \w'~/.vacation.ignore    'u
E 7
I 7
.ta \w'~/.vacation.msg    'u
E 7
~/.vacation.dir	database file
D 7
~/.vacation.ignore	list of addresses to ignore
E 7
~/.vacation.msg	message to send
~/.vacation.pag	database file
.fi
.SH "SEE ALSO"
sendmail(8), syslog(8)
E 11
I 11
.Xr syslog 8 .
.Sh FILES
D 12
.Bl -tag -width vacation.dirx -compact
E 12
I 12
.Bl -tag -width "vacation.dirxxx" -compact
E 12
D 14
.It Pa ~/.vacation.dir
E 14
I 14
.It Pa ~/.vacation.db
E 14
database file
.It Pa ~/.vacation.msg
message to send
D 14
.It Pa ~/.vacation.pag
database file
E 14
.El
.Sh SEE ALSO
.Xr sendmail 8 ,
.Xr syslog 8
.Sh HISTORY
The
D 12
.Nm
E 12
I 12
.Nm vacation
E 12
command appeared in
.Bx 4.3 .
E 11
E 5
E 1
