usr.bin/showmount/SCCS/s.showmount.8
h62639
s 00007/00002/00060
d D 8.3 95/03/29 22:57:51 mckusick 8 7
c update for version 3 from Rick Macklem
e
s 00001/00001/00061
d D 8.2 93/12/11 23:44:33 mckusick 7 6
c copyediting for Usenix manuals
e
s 00002/00002/00060
d D 8.1 93/06/09 19:20:54 bostic 6 5
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00002/00003/00060
d D 6.4 93/06/09 19:20:49 bostic 5 3
c fixed the under development line
e
s 00002/00002/00061
d R 8.1 93/06/06 16:19:37 bostic 4 3
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00049/00037/00014
d D 6.3 91/03/16 18:10:56 cael 3 2
c macro and text revision (-mdoc version 3)
e
s 00001/00011/00050
d D 6.2 90/06/24 22:05:40 trent 2 1
c new copyright notice
e
s 00061/00000/00000
d D 6.1 89/11/30 23:56:00 mckusick 1 0
c contributed by Rick Macklem
e
u
U
t
T
I 1
D 3
.\" Copyright (c) 1989 The Regents of the University of California.
E 3
I 3
D 6
.\" Copyright (c) 1989, 1991 The Regents of the University of California.
E 3
.\" All rights reserved.
E 6
I 6
.\" Copyright (c) 1989, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 6
.\"
.\" This code is derived from software contributed to Berkeley by
.\" Rick Macklem at The University of Guelph.
.\"
D 2
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 2
I 2
.\" %sccs.include.redist.man%
E 2
.\"
D 3
.\"	%W% (Berkeley) %G%
E 3
I 3
.\"     %W% (Berkeley) %G%
E 3
.\"
D 3
.TH SHOWMOUNT 8 "%Q%"
.UC 4
.SH NAME
showmount \- show remote nfs mounts on host
.SH SYNOPSIS
.B showmount
[
.B \-ade
]
[
.B host
]
.SH DESCRIPTION
.I Showmount
shows status information about the NFS server on
.I host.
By default it prints the names of all hosts that have NFS file systems mounted
on the host. See "NFS: Network File System Protocol Specification, RFC1094,
Appendix A" for a detailed desciption of the protocol.
.TP
.B \-a
E 3
I 3
.Dd %Q%
.Dt SHOWMOUNT 8
.Os BSD 4
.Sh NAME
.Nm showmount
.Nd show remote nfs mounts on host
.Sh SYNOPSIS
.Nm showmount
D 8
.Op Fl ade
E 8
I 8
.Op Fl ade3
E 8
.Op Ar host
.Sh DESCRIPTION
.Nm Showmount
shows status information about the
.Tn NFS
server on
.Ar host .
By default it prints the names of all hosts that have
.Tn NFS
file systems mounted
on the host. See
.%T "NFS: Network File System Protocol Specification" ,
RFC 1094,
D 8
Appendix A ,
E 8
I 8
Appendix A,
and
.%T "NFS: Network File System Version 3 Protocol Specification" ,
Appendix I,
E 8
D 7
for a detailed desciption of the protocol.
E 7
I 7
for a detailed description of the protocol.
E 7
.Bl -tag -width Ds
.It Fl a
E 3
List all mount points in the form:
D 3
.RS
.RS
.I host:dirpath
.RE
.RE
.TP
.B \-d
E 3
I 3
.Bd -ragged -offset indent -compact
.Ar host : Ns Ar dirpath
.Ed
.It Fl d
E 3
List directory paths of mount points instead of hosts
D 3
.TP
.B \-e
E 3
I 3
.It Fl e
E 3
Show the
D 3
.I host's
E 3
I 3
.Ar host Ns 's
E 3
exports list
I 8
.It Fl 3
Use mount protocol Version 3, compatible with NFS Version 3.
E 8
D 3
.SH "SEE ALSO"
mount(1), mountd(8)
.SH BUGS
E 3
I 3
.El
.Sh SEE ALSO
.Xr mount 1 ,
.Xr mountd 8
.Sh BUGS
E 3
The mount daemon running on the server only has an idea of the actual mounts,
D 3
since the NFS server is stateless. Showmount will only display the information
E 3
I 3
since the
.Tn NFS
server is stateless.
.Nm Showmount
will only display the information
E 3
as accurately as the mount daemon reports it.
I 3
.Sh HISTORY
The
D 5
.Nm
command
.Ud
E 5
I 5
.Nm showmount
utility first appeared in 4.4BSD.
E 5
E 3
E 1
