libexec/bugfiler/SCCS/s.bugfiler.8
h44845
s 00002/00006/00262
d D 8.2 93/12/11 23:42:55 mckusick 17 16
c copyediting for Usenix manuals
e
s 00002/00002/00266
d D 8.1 93/06/04 18:46:02 bostic 16 15
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00238/00126/00030
d D 6.11 91/03/16 17:05:06 cael 15 14
c macro and text revision (-mdoc version 3)
e
s 00004/00014/00152
d D 6.10 90/06/24 21:16:45 trent 14 13
c new copyright & new pathnames (sendmail, aliases, and bugformat)
e
s 00014/00003/00147
d D 6.9 88/10/25 18:51:57 bostic 13 12
c Berkeley copyright notice
e
s 00007/00002/00143
d D 6.8 87/11/23 11:00:12 bostic 12 11
c add special redist label ``all:''
e
s 00008/00009/00137
d D 6.7 87/11/18 11:39:24 bostic 11 10
c move bug:ack file into version directory
e
s 00005/00004/00141
d D 6.6 87/07/20 13:03:46 bostic 10 8
c document need for bug:lock file on setup
e
s 00002/00002/00143
d R 6.6 87/04/23 14:20:34 bostic 9 8
c Status field is now Comment field
e
s 00070/00065/00075
d D 6.5 87/04/11 15:59:30 bostic 8 7
c version #2, -v flag, remove home_dir, redist per folder
e
s 00003/00002/00137
d D 6.4 87/01/28 21:39:11 bostic 7 5
c added date field to summary format
e
s 00002/00002/00137
d R 6.4 87/01/28 12:03:28 bostic 6 5
c Status field now Comment field
e
s 00100/00065/00039
d D 6.3 86/12/02 12:15:57 bostic 5 3
c rewrite
e
s 00102/00067/00037
d R 6.3 86/12/02 12:14:44 bostic 4 3
c rewrite
e
s 00019/00005/00085
d D 6.2 86/05/20 19:00:40 karels 3 2
c redist
e
s 00001/00001/00089
d D 6.1 85/04/27 14:52:29 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00090/00000/00000
d D 5.1 85/04/27 14:52:11 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
D 13
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 13
I 13
D 15
.\" Copyright (c) 1983 The Regents of the University of California.
E 15
I 15
D 16
.\" Copyright (c) 1983, 1991 The Regents of the University of California.
E 15
.\" All rights reserved.
E 16
I 16
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 16
.\"
D 14
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 14
I 14
.\" %sccs.include.redist.man%
E 14
E 13
.\"
D 15
.\"	%W% (Berkeley) %G%
E 15
I 15
.\"     %W% (Berkeley) %G%
E 15
.\"
D 2
.TH BUGFILER 8 "18 July 1983"
E 2
I 2
D 15
.TH BUGFILER 8 "%Q%"
E 2
.UC 5
.SH NAME
bugfiler \- file bug reports in folders automatically
.SH SYNOPSIS
.B bugfiler
D 5
[ mail directory ]
E 5
I 5
D 8
[ -ar ] [ home_dir ]
E 8
I 8
[ -ar ] [-v version]
E 8
E 5
.SH DESCRIPTION
D 5
.I Bugfiler
is a program to automatically intercept bug reports, summarize them and
store them in the appropriate sub directories of the mail directory
specified on the command line or the (system dependent) default.
It is designed to be compatible with the Rand MH mail system.
.I Bugfiler
is normally invoked by the mail delivery program through
.IR aliases (5)
with a line such as the following in /usr/lib/aliases.
E 5
I 5
\fIBugfiler\fP is a program to automatically intercept, acknowledge,
redistribute and store bug reports.  \fIBugfiler\fP is normally invoked
E 15
I 15
.Dd %Q%
.Dt BUGFILER 8
.Os BSD 4.2
.Sh NAME
.Nm bugfiler
.Nd file bug reports in folders automatically
.Sh SYNOPSIS
.Nm bugfiler
.Op Fl ar
.Op Fl v Ar version
.Sh DESCRIPTION
.Nm Bugfiler
is a program to automatically intercept, acknowledge,
redistribute and store bug reports.
.Nm Bugfiler
is normally invoked
E 15
by the mail delivery program with a line similar to the following in
D 14
/usr/lib/aliases.
E 14
I 14
D 15
/etc/aliases.
E 14
E 5
.PP
.DT
D 5
	bugs:"|bugfiler /usr/bugs/mail"
E 5
I 5
D 8
	bugs:	"|bugfiler /usr/bugs/mail"
E 8
I 8
	bugs:	"|bugfiler"
E 8
.br
E 5
.PP
D 5
It reads the message from the standard input or the named file, checks
the format and returns mail acknowledging receipt or a message 
indicating the proper format.  Valid reports are then summarized and
D 3
filed in the appropriate folder.  Users can then log onto the system and
E 3
I 3
filed in the appropriate folder; improperly formatted messages
are filed in a folder named ``errors.''
Program maintainers can then log onto the system and
E 3
check the summary file for bugs that pertain to them.
D 3
Bug reports are submitted in RFC822 format and
must contain the following header lines:
E 3
I 3
Bug reports should be submitted in RFC822 format and
aremust contain the following header lines to be properly indexed:
E 5
I 5
D 8
All file paths in this man page that use \fIhome_dir\fP reference
the optional \fIhome_dir\fP argument, or, if that is not supplied, the
home directory of the login "bugs".  In either case, the login "bugs"
must exist, as \fIbugfiler\fP expects its files and directories to
be owned by "bugs".
E 8
I 8
It should be noted that the login ``bugs'' must exist for the bugfiler
to run.  Unless otherwise noted all paths used by \fIbugfiler\fP are
relative to the home directory of this login.  \fIBugfiler\fP also
expects all of its files and directories to be owned by ``bugs''.
E 8
E 5
E 3
.PP
E 15
I 15
.Pa /etc/aliases .
.Bd -literal -offset indent
bugs:	"|bugfiler"
.Ed
.Pp
It should be noted that the login
.Dq bugs
must exist for the bugfiler
to run.  Unless otherwise noted all paths used by
.Nm bugfiler
are
relative to the home directory of this login.
.Nm Bugfiler
also
expects all of its files and directories to be owned by
.Dq bugs .
.Pp
Available options.
.Bl -tag -width Ds
.It Fl a
Do not send automatic mail acknowledgement to the bug report filer.
(The default is to send the acknowledgement with the file
.Pa ~bugs/version/bug:ack
appended).
.It Fl r
Do not redistribute.
.It Fl v Ar version
Override the
.Ar version
provided within the bug report itself.
.El
.Pp
E 15
I 5
D 11
A mail acknowledgement is automatically sent to the bug report filer
D 8
unless the \fB-a\fP flag is supplied.  If the file \fIhome_dir\fP/.ack
exists, it is appended to this acknowledgement.
E 8
I 8
unless the \fB-a\fP flag is supplied.  The file ~bugs/bug:ack is appended
to this acknowledgement.
E 8
.PP
E 11
For the bug report to be correctly filed, it must contain a line
in the following format:
D 15
.PP
E 5
.DT
D 5
	Date: <date the report is received>
E 5
I 5
D 8
	Index:	\fIfolder\fP	\fIsystem\fP
E 8
I 8
	Index:	\fIfolder\fP	\fIversion\fP
E 8
E 5
.br
D 5
	From: <valid return address>
E 5
I 5
.PP
D 8
The directories \fIhome_dir\fP/system and \fIhome_dir\fP/system/folder
E 8
I 8
The directories ~bugs/\fIversion\fP and ~bugs/\fIversion\fP/\fIfolder\fP
E 8
must exist before \fIbugfiler\fP attempts to store the bug report.  Bug
D 8
reports will be stored in files named by the concatenation of
\fIsystem, folder,\fP and sequential numbers, e.g., if \fIsystem\fP
is "4.3BSD" and \fIfolder\fP is "ucb" the first bug report will
be placed in \fIhome_dir\fP/4.3BSD/ucb/1.  To maintain backward
compatibility, if \fIfolder\fP contains more than one component only
the first one will be used, e.g. if \fIfolder\fP is "bin/from.c" or
"bin/adb/con.c" it will be treated as if it were just "bin".
E 8
I 8
reports will be stored in files named by the concatenation of \fIversion,
folder,\fP and sequential numbers, i.e. if \fIversion\fP is ``4.3BSD'' and
\fIfolder\fP is ``ucb'' the first bug report will be placed in
~bugs/4.3BSD/ucb/1.  If \fIfolder\fP contains more than one component only
the first one will be used, e.g. if \fIfolder\fP is ``bin/from.c'' or
``bin/adb/con.c'' it will be treated as if it were simply ``bin''.  The
\fI-v\fP flag is provided as a means to override the \fIversion\fP
provided within the bug report itself.
E 8
.PP
I 11
A mail acknowledgement is automatically sent to the bug report filer unless
the \fB-a\fP flag is supplied.  The file ~bugs/\fIversion\fP/bug:ack is
appended to this acknowledgement.
.PP
E 11
If the \fB-r\fP flag is not supplied, redistribution of the bug reports
D 8
is done as specified in the file \fIhome_dir\fP/.redist.  This file is
in the format of the
E 8
I 8
is done as specified in the file ~bugs/\fIversion\fP/bug:redist.  This file
D 11
is in the format of the
E 8
.IR aliases (5)
file, including comments and entries requiring multiple lines, with
D 8
the single exception that the \fIfolder\fP component of the "Index:"
line replaces the name to alias.  For example, the \fI.redist\fP file
E 8
I 8
the single exception that the \fIfolder\fP component of the ``Index:''
line replaces the name to alias.  For example, the \fIbug:redist\fP file
E 11
I 11
is in the format of the \fIaliases\fP(5) file, including comments and
E 15
I 15
.Pp
.Bd -filled -offset indent -compact
.Bl -column Index folder
.It Index: Ta Em folder Ta Ar version
.El
.Ed
.Pp
The directories
.Pa ~bugs/ Ns Ar version
and
.Pa ~bugs/ Ns Ar version/ Ns Em folder
must exist before
.Nm bugfiler
attempts to store the bug report.  Bug
reports will be stored in files named by the concatenation of
.Ar version ,
.Em folder ,
and sequential numbers, i.e. if
.Ar version
is
.Dq 4.3 Tn BSD
and
.Em folder
is
.Dq ucb
the first bug report will be placed in
.Pa ~bugs/4.3BSD/ucb/1 .
If
.Em folder
contains more than one component only
the first one will be used, e.g. if
.Em folder
is
.Dq bin/from.c
or
.Dq bin/adb/con.c
it will be treated as if it were simply
.Dq bin .
.Pp
.Pp
If the
.Fl r
flag is not supplied, redistribution of the bug reports
is done as specified in the file
.Pa ~bugs/version/bug:redist .
This file
is in the format of the
.Xr aliases 5
file, including comments and
E 15
entries requiring multiple lines, with the single exception that the
D 15
\fIfolder\fP component of the ``Index:'' line replaces the name to alias.
D 12
For example, the \fIbug:redist\fP file
E 12
I 12
The special folder ``all:'' receives a redistribution of all bug reports
sent to this \fIversion\fP.  For example, the \fIbug:redist\fP file
E 12
E 11
E 8
.PP
.DT
I 12
	#	bigbug gets a copy of everything
.br
	all:	bigbug
.br
E 12
	#	ucb folder redistribution list
E 5
.br
D 5
	Subject: <short summary of the problem>
E 5
I 5
	ucb:	karels, kjd@coke.berkeley.edu
E 5
.br
D 5
	Index: <source directory>/<source file> <version> [Fix]
E 5
I 5
		ra@beno.css.gov
.br
E 5
.PP
D 5
In addition, the body of the message must contain a line which
begins with ``Description:'' followed by zero or more lines describing the
problem in detail and a line beginning with ``Repeat-By:'' followed by zero or
more lines describing how to repeat the problem.
If the keyword `Fix' is specified in the `Index' line, then there must
also be a line beginning with ``Fix:'' followed by a diff of the old and new
source files or a description of what was done to fix the problem.
E 5
I 5
D 8
will send copies of all bug reports with "ucb" as the \fIfolder\fP
to the logins karels, kjd, and ra.
E 8
I 8
will send copies of all bug reports with ``ucb'' as the \fIfolder\fP
E 15
I 15
.Em folder
component of the
.Dq Index:
line replaces the name to alias.
The special folder
.Dq all:
receives a redistribution of all bug reports
sent to this
.Ar version .
For example, the
.Pa bug:redist
file
.Pp
.Bd -literal -offset indent -compact
#	bigbug gets a copy of everything
all:	bigbug
#	ucb folder redistribution list
ucb:	karels, kjd@coke.berkeley.edu
	ra@beno.css.gov
.Ed
.Pp
will send copies of all bug reports with
.Dq ucb
as the
.Em folder
E 15
D 12
to karels, kjd, and ra.
E 12
I 12
to bigbug, karels, kjd, and ra.
E 12
E 8
E 5
D 15
.PP
D 5
The `Index' line is the key to the filing mechanism. The source directory
name must match one of the folder names in the mail directory.
The message is then filed in this folder
and a line appended to the summary file in the following format:
E 5
I 5
D 8
Reports that cannot be filed due to an invalid "Index:" line are placed
in the directory \fIhome_dir\fP/errors.  The \fIbugfiler\fP maintainer
should correct these bug reports and then run \fIbugfiler\fP, with the
corrected report as its standard input, as bug reports with errors are
neither acknowledged or redistributed.  All reports that \fIbugfiler\fP
handles are logged in \fIhome_dir\fP/log.
E 8
I 8
Reports that cannot be filed, due to an invalid ``Index:'' line or
some other error, are placed in the directory ~bugs/errors.  The
\fIbugfiler\fP maintainer should correct these bug reports and then
run \fIbugfiler\fP, with the corrected report as its standard input,
E 15
I 15
.Pp
Reports that cannot be filed, due to an invalid
.Dq Index:
line or
some other error, are placed in the directory
.Pa ~bugs/errors .
The
.Nm bugfiler
maintainer should correct these bug reports and then
run
.Nm bugfiler ,
with the corrected report as its standard input,
E 15
as bug reports with errors are neither acknowledged or redistributed.
D 15
All reports that \fIbugfiler\fP handles are logged in ~bugs/log.
E 8
E 5
.PP
I 5
D 8
Valid reports are also entered in the file
\fIhome_dir/folder\fP/summary.  This file has an entry for each bug
report in the \fIfolder\fP in the format:
E 8
I 8
Valid bugs are also logged in the file ~bugs/\fIversion\fP/summary.
This file has an entry for each bug report for \fIversion\fP in the
E 15
I 15
All reports that
.Nm bugfiler
handles are logged in
.Pa ~bugs/log.
.Pp
Valid bugs are also logged in the file
.Pa ~bugs/version/summary.
This file has an entry for each bug report for
.Ar version
in the
E 15
format:
E 8
D 15
.PP
E 5
.DT
D 5
	<folder name>/<message number>	<Index info>
E 5
I 5
D 7
	Filename
E 7
I 7
	Filename		Date
E 7
E 5
.br
D 5
						<Subject info>
E 5
I 5
		Subject:
.br
		Index:
.br
		Owner:	Bugs Bunny
.br
		Status:	Received
.br
E 5
I 3
.PP
D 5
The bug report may also be redistributed according to the index.
If the file
.IR maildir /.redist
exists, it is examined for a line beginning with the index name
followed with a tab.
The remainder of this line contains a comma-separated list of mail addresses
which should receive copies of bugs with this index.
The list may be continued onto multiple lines by ending each but the last
with a backslash (`\e').
E 5
I 5
D 8
"Filename" is the concatenation of \fIsystem, folder,\fP and a number as
D 7
described above.  The "Subject:" and "Index:" lines are copies of the
E 7
I 7
described above.  "Date" is the date as reported by the system clock, using
ctime(3).  The "Subject:" and "Index:" lines are copies of the
E 7
"Subject:" and "Index:" lines contained in the bug report.  The "Owner"
and "Status" fields are intended to provide a rudimentary method of
tracking the status of bug reports.
E 8
I 8
\fIFilename\fP is the concatenation of \fIversion, folder,\fP and a number
as described above.  \fIDate\fP is the date as reported by the system
clock, using ctime(3).  The \fISubject:\fP and \fIIndex:\fP lines are
copies of the ``Subject:'' and ``Index:'' lines contained in the bug
report.  The \fIOwner\fP and \fIStatus\fP fields are intended to provide a
E 15
I 15
.Pp
.Bd -literal -offset indent -compact
Filename	Date
     Subject:
     Index:
     Owner:	Bugs Bunny
     Status:	Received
.Ed
.Pp
.Li Filename
is the concatenation of
.Ar version ,
.Em folder ,
and a number
as described above.
.Xr Date
is the date as reported by the system
clock, using
.Xr ctime 3 .
D 17
.Li The Subject:
and
.Li Index:
lines are
E 17
The
D 17
.Dq Subject:
E 17
I 17
.Li Subject:
E 17
and
D 17
.Dq Index:
E 17
I 17
.Li Index:
E 17
lines are
copies of the
.Dq Subject:
and
.Dq index:
lines contained in the bug
report.  The
.Li Owner
and
.Li Status
fields are intended to provide a
E 15
rudimentary method of tracking the status of bug reports.
E 8
D 15
.PP
D 8
The file \fIhome_dir\fP/bug:lock is the focus of all locking for
\fIbugfiler.\fP  If you wish to manipulate any of the log or error
files, remove it and \fIbugfiler\fP will treat all bug reports that
it receives as if they were incorrectly formatted and place them
in the directory \fIhome_dir\fP/errors, where they can be recovered by
the \fIbugfiler\fP maintainer.
E 8
I 8
The file ~bugs/bug:lock is the focus of all locking for \fIbugfiler.\fP
E 15
I 15
.Pp
The file
.Pa ~bugs/bug:lock
is the focus of all locking for
.Nm bugfiler .
E 15
D 10
If you wish to manipulate any of the log or error files, remove it and
\fIbugfiler\fP will treat all bug reports that it receives as if they were
incorrectly formatted, i.e. it will place them in the directory ~bugs/errors,
where they should recovered by the \fIbugfiler\fP maintainer.
E 10
I 10
If you wish to manipulate any of the log or error files, rename or remove
D 15
it and \fIbugfiler\fP will treat all bug reports that it receives as if
E 15
I 15
it and
.Nm bugfiler
will treat all bug reports that it receives as if
E 15
they were incorrectly formatted, i.e. it will place them in the directory
D 15
~bugs/errors, for later recovery by the \fIbugfiler\fP maintainer.
Obviously, this file must be created when you first install \fIbugfiler\fP.
E 10
E 8
.PP
D 8
All errors that occur before \fIhome_dir\fP/log is found are logged
into the system log file, using
E 8
I 8
All errors that occur before ~bugs/log is found are logged into the system
E 15
I 15
.Pa ~bugs/errors ,
for later recovery by the
.Nm bugfiler
maintainer.
Obviously, this file must be created when you first install
.Nm bugfiler .
.Pp
All errors that occur before
.Pa ~bugs/log
is found are logged into the system
E 15
log file, using
E 8
D 15
.IR syslog (8).
E 5
E 3
.SH FILES
D 5
.ta 2.5i
D 3
/usr/new/lib/mh/deliver	mail delivery program
E 3
I 3
/usr/lib/sendmail	mail delivery program
E 5
I 5
D 8
.ta 3.0i
home_dir/.ack			the message sent in acknowledgement
E 8
E 5
E 3
.br
D 3
/usr/new/lib/mh/unixtomh	converts unix mail format to mh format
E 3
I 3
D 5
/usr/lib/unixtomh	converts unix mail format to mh format
E 5
I 5
D 8
home_dir/.redist		the redistribution list
E 5
E 3
.br
D 5
maildir/.ack	the message sent in acknowledgement
E 5
I 5
home_dir/bug:lock		the locking file
E 5
.br
D 5
maildir/.format	the message sent when format errors are detected
E 5
I 5
home_dir/errors/BUG_??????	bug reports with format errors
E 5
I 3
.br
D 5
maildir/.redist	the redistribution list
E 5
I 5
home_dir/log			the log file
E 5
E 3
.br
D 5
maildir/summary	the summary file
E 5
I 5
home_dir/folder/summary		the summary files
E 5
.br
D 5
maildir/Bf??????	temporary copy of the input message
E 5
I 5
/usr/lib/sendmail		the mail delivery program
E 5
.br
D 5
maildir/Rp??????	temporary file for the reply message.
E 5
I 5
/usr/lib/bugformat		a sample bug report format
E 8
I 8
.TP 25
~bugs/bug:ack
E 15
I 15
.Xr syslog 8 .
.Sh FILES
.Bl -tag -width /usr/share/misc/bugformatxx -compact
.It Pa ~bugs/bug:ack
E 15
the acknowledgement message
D 15
.TP 25
~bugs/bug:redist
E 15
I 15
.It Pa ~bugs/bug:redist
E 15
the redistribution list
D 15
.TP 25
~bugs/bug:lock
E 15
I 15
.It Pa ~bugs/bug:lock
E 15
the locking file
D 15
.TP 25
~bugs/errors/BUG_??????
E 15
I 15
.It Pa ~bugs/errors/BUG_??????
E 15
bug reports with format errors
D 15
.TP 25
~bugs/log
E 15
I 15
.It Pa ~bugs/log
E 15
the log file
D 15
.TP 25
~bugs/folder/summary
E 15
I 15
.It Pa ~bugs/folder/summary
E 15
the summary files
D 15
.TP 25
D 14
/usr/lib/sendmail
E 14
I 14
/usr/sbin/sendmail
E 15
I 15
.It Pa /usr/sbin/sendmail
E 15
E 14
the mail delivery program
D 15
.TP 25
D 14
/usr/lib/bugformat
E 14
I 14
/usr/share/misc/bugformat
E 15
I 15
.It Pa /usr/share/misc/bugformat
E 15
E 14
a sample bug report format
E 8
E 5
D 15
.SH "SEE ALSO"
D 5
mh(1),
newaliases(1),
aliases(5)
E 5
I 5
sendbug(1), aliases(5), syslog(8)
E 5
.SH BUGS
I 5
Since mail can be forwarded in a number of different ways, \fIbugfiler\fP
E 15
I 15
.El
.Sh SEE ALSO
.Xr sendbug 1 ,
.Xr aliases 5 ,
.Xr syslog 8
.Sh BUGS
Since mail can be forwarded in a number of different ways,
.Nm bugfiler
E 15
does not recognize forwarded mail and will acknowledge to the forwarder
D 15
instead of the original sender unless there is a `Reply-To' field in the
E 15
I 15
instead of the original sender unless there is a
.Dq Reply-To
field in the
E 15
header.
E 5
D 8
.PP
D 5
Since mail can be forwarded in a number of different ways,
.I bugfiler
does not recognize forwarded mail and will reply/complain to the
forwarder instead of the original sender unless there is a `Reply-To'
field in the header.
E 5
I 5
Duplicate messages should be recognized and handled in some
reasonable fashion.
E 8
E 5
D 15
.PP
D 5
Duplicate messages should be discarded or recognized and put somewhere
else.
E 5
I 5
This version of the bugfiler is not compatible with the version
released with 4.3BSD in that it doesn't complain to the sender about
E 15
I 15
.Pp
This version of
.Nm bugfiler
is not compatible with the version
released with
.Bx 4.3
in that it doesn't complain to the sender about
E 15
incorrectly formatted bug reports.
Frankly, we got tired of the profanity, not to mention the extended
conversations
D 15
.I bugfiler
E 15
I 15
.Nm bugfiler
E 15
was holding with
D 15
.IR vacation (1).
E 15
I 15
.Xr vacation 1 .
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.2 .
E 15
E 5
E 1
