usr.bin/at/atq/SCCS/s.atq.1
h29039
s 00002/00002/00054
d D 8.1 93/06/06 14:21:13 bostic 6 5
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00011/00011/00045
d D 6.5 91/03/14 01:38:56 cael 5 4
c updated to -mdoc version 3
e
s 00014/00007/00042
d D 6.4 90/07/24 22:41:12 cael 4 3
c .Xr botch fix
e
s 00041/00033/00008
d D 6.3 90/06/11 05:53:04 cael 3 2
c converted man page
e
s 00001/00001/00040
d D 6.2 86/05/10 19:52:36 mckusick 2 1
c syntax
e
s 00041/00000/00000
d D 6.1 85/04/29 21:48:14 mckusick 1 0
c manual page first distributed with 4.3BSD
e
u
U
t
T
I 1
D 3
.\" Copyright (c) 1985 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 3
I 3
D 6
.\" Copyright (c) 1985, 1990 The Regents of the University of California.
.\" All rights reserved.
E 6
I 6
.\" Copyright (c) 1985, 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 6
E 3
.\"
D 3
.\"	%W% (Berkeley) %G%
E 3
I 3
.\" %sccs.include.redist.man%
E 3
.\"
D 3
.TH ATQ 1 "%Q%"
.UC 6
.SH NAME
D 2
atq - print the queue of jobs waiting to be run
E 2
I 2
atq \- print the queue of jobs waiting to be run
E 2
.SH SYNOPSIS
.B atq
[ -c ] [ -n ] [ name ... ]
.SH DESCRIPTION
.I Atq 
E 3
I 3
.\"     %W% (Berkeley) %G%
.\"
.Dd %Q%
.Dt ATQ 1
.Os BSD 4.3
.Sh NAME
.Nm atq
D 4
.Nd print the queue of jobs waiting to be run
E 4
I 4
.Nd display the
.Xr at 1
job queue
E 4
.Sh SYNOPSIS
.Nm atq
.Op Fl c
.Op Fl n
.Op Ar name ...
.Sh DESCRIPTION
.Nm Atq
E 3
D 4
prints the queue of jobs that are waiting to be run
at a later date. These jobs were created with the
E 4
I 4
displays the queue of jobs, created by the
E 4
D 3
.IR at (1)
E 3
I 3
.Xr at 1
E 3
D 4
command.
E 4
I 4
command,
which are currently awaiting execution.
E 4
With no flags, the queue is sorted in the order that
the jobs will be executed.
I 4
.Pp
Options available are:
D 5
.Pp
.Tw Ds
E 4
D 3
.PP
If the 
.B \-c 
flag is used, the queue is sorted by the time that the 
.I at 
command was given. 
.PP
The 
.B \-n 
flag prints only the total number of files that are currently
in the queue. 
.PP
If a name(s) is provided, only those files belonging to that user(s) are 
E 3
I 3
.Tp Fl c
E 5
I 5
.Bl -tag -width Ds
.It Fl c
E 5
the queue is sorted by the time that the
.Li at
command was given.
D 5
.Tp Fl n
E 5
I 5
.It Fl n
E 5
only the total number of files that are currently
in the queue are printed.
D 5
.Tp
E 5
I 5
.El
E 5
.Pp
If a name(s) is provided, only those files belonging to that user(s) are
E 3
displayed.
D 3
.SH FILES
/usr/spool/at		spool area
.SH "SEE ALSO"
at(1),
atrm(1),
cron(8)
E 3
I 3
.Sh FILES
D 4
.Tw /var/spool/at
.Tp /var/spool/at
E 4
I 4
D 5
.Dw /var/spool/at
.Di L
.Dp Pa /var/spool/at
E 5
I 5
.Bl -tag -width /var/spool/at -compact
.It Pa /var/spool/at
E 5
E 4
spool area
D 4
.Tp
E 4
I 4
D 5
.Dp
E 5
I 5
.El
E 5
E 4
.Sh SEE ALSO
.Xr at 1 ,
.Xr atrm 1 ,
.Xr cron 8
.Sh HISTORY
D 5
.Nm Atq
appeared in the 4.3 BSD release.
E 5
I 5
The
.Nm
command appeared in 
.Bx 4.3 .
E 5
E 3
E 1
