usr.bin/msgs/SCCS/s.msgs.1
h20286
s 00001/00001/00187
d D 8.2 95/04/28 12:48:26 bostic 14 13
c msgs.1 wrong path;From: Chris Torek <torek@BSDI.COM>
e
s 00002/00002/00186
d D 8.1 93/06/06 15:39:04 bostic 13 12
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00000/00002/00188
d D 6.9 91/07/30 18:17:11 cael 12 11
c remove extraneous .Pp's from SYNOPSIS
e
s 00049/00057/00141
d D 6.8 91/07/26 18:54:47 cael 11 10
c mdoc version three
e
s 00002/00000/00196
d D 6.7 91/03/14 00:23:03 cael 10 8
c add .Vx so tmac.andoc will call tmac.mdoc-old
e
s 00001/00000/00196
d R 6.7 91/03/13 20:35:43 cael 9 8
c add .Vx so tmac.andoc will call tmac.mdoc-old
e
s 00006/00003/00190
d D 6.6 90/07/24 22:48:59 cael 8 7
c .Xr botch fix
e
s 00111/00109/00082
d D 6.5 90/06/11 05:57:21 cael 7 6
c converted man page
e
s 00004/00003/00187
d D 6.4 90/05/06 17:07:13 bostic 6 5
c written by Bill Joy and David Wasley; add Berkeley copyright
e
s 00001/00001/00189
d D 6.3 86/05/09 08:37:58 anne 5 4
c grammar
e
s 00035/00003/00155
d D 6.2 85/08/27 16:32:25 bloom 4 3
c document -c and -s
e
s 00001/00001/00157
d D 6.1 85/04/29 14:37:54 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00001/00001/00157
d D 5.1 85/04/29 14:37:44 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00158/00000/00000
d D 4.1 85/04/29 14:37:35 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
D 6
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 6
I 6
D 7
.\" Copyright (c) 1980 The Regents of the University of California.
E 7
I 7
D 13
.\" Copyright (c) 1980, 1990 The Regents of the University of California.
E 7
.\" All rights reserved.
E 13
I 13
.\" Copyright (c) 1980, 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 13
.\"
D 11
.\" %sccs.include.redist.man%
E 11
I 11
.\" %sccs.include.redist.roff%
E 11
E 6
.\"
D 7
.\"	%W% (Berkeley) %G%
E 7
I 7
D 11
.\"     %W% (Berkeley) %G%
E 11
I 11
.\"	%W% (Berkeley) %G%
E 11
E 7
.\"
I 10
D 11
.Vx
.Vx
E 11
E 10
D 2
.TH MSGS 1
E 2
I 2
D 3
.TH MSGS 1 "18 January 1983"
E 3
I 3
D 7
.TH MSGS 1 "%Q%"
E 3
E 2
.UC 4
.SH NAME
msgs \- system messages and junk mail program
.SH SYNOPSIS
.B msgs
[
.B \-fhlpq
] [
number
] [
\-number
]
I 4
.LP
.B msgs
.B \-s
.LP
.B msgs
.B \-c
[
\-days
]
E 4
.SH DESCRIPTION
.I Msgs
E 7
I 7
.Dd %Q%
.Dt MSGS 1
.Os BSD 4
.Sh NAME
.Nm msgs
.Nd system messages and junk mail program
.Sh SYNOPSIS
.Nm msgs
.Op Fl fhlpq
.Op Ar number
.Op Ar \-number
D 12
.Pp
E 12
.Nm msgs
.Op Fl s
D 12
.Pp
E 12
.Nm msgs
.Op Fl c
.Op \-days
.Sh DESCRIPTION
.Nm Msgs
E 7
is used to read system messages.
These messages are
sent by mailing to the login `msgs' and should be short
pieces of information which are suitable to be read once by most users
of the system.
D 7
.PP
.I Msgs
E 7
I 7
.Pp
.Nm Msgs
E 7
is normally invoked each time you login, by placing it in the file
D 7
.I \&.login
.I (\&.profile
E 7
I 7
D 11
.Pa \& .login
E 11
I 11
.Pa .login
E 11
(or
D 11
.Pa \&.profile
E 11
I 11
.Pa .profile
E 11
E 7
if you use
D 7
.IR /bin/sh ).
E 7
I 7
.Xr sh 1 ) .
E 7
It will then prompt you with the source and subject of each new message.
If there is no subject line, the first few non-blank lines of the
message will be displayed.
If there is more to the message, you will be told how
long it is and asked whether you wish to see the rest of the message.
The possible responses are:
D 7
.TP 7
.B y
E 7
I 7
D 11
.Tw Fl
.Tp Fl y
E 7
D 5
type the rest of the message
E 5
I 5
type the rest of the message.
E 5
D 7
.TP 7
RETURN
E 7
I 7
.Tp Ic RETURN
E 7
synonym for y.
D 7
.TP 7
.B n
E 7
I 7
.Tp Fl n
E 7
skip this message
E 11
I 11
.Bl -tag -width Fl
.It Fl y
Type the rest of the message.
.It Ic RETURN
Synonym for y.
.It Fl n
Skip this message
E 11
and go on to the next message.
D 7
.TP 7
.B \-
E 7
I 7
D 11
.Tp Fl
E 7
redisplay the last message.
D 7
.TP 7
.B q
E 7
I 7
.Tp Fl q
E 7
drops you out of
E 11
I 11
.It Fl
Redisplay the last message.
.It Fl q
Drop out of
E 11
D 7
.I msgs;
E 7
I 7
.Nm msgs ;
E 7
D 11
the next time you run the program it will pick up where you left off.
D 7
.TP 7
.B s
E 7
I 7
.Tp Fl s
E 7
append the current message to the file ``Messages'' in the current directory;
E 11
I 11
the next time
.Nm msgs
will pick up where it last left off.
.It Fl s
Append the current message to the file ``Messages'' in the current directory;
E 11
`s\-' will save the previously displayed message. A `s' or `s\-' may
D 4
be followed by a space and a filename to receive the message replacing
E 4
I 4
be followed by a space and a file name to receive the message replacing
E 4
the default ``Messages''.
D 7
.TP 7
.B m
E 7
I 7
D 11
.Tp Fl m
E 7
or `m\-' causes a copy of the specified message to be placed in a temporary
E 11
I 11
.It Fl m
A copy of the specified message is placed in a temporary
E 11
D 7
mailbox and 
.IR mail (1)
E 7
I 7
mailbox and
.Xr mail  1
E 7
D 11
to be invoked on that mailbox.
E 11
I 11
is invoked on that mailbox.
E 11
Both `m' and `s' accept a numeric argument in place of the `\-'.
D 7
.PP
.I Msgs
E 7
I 7
D 11
.Tp
E 11
I 11
.El
E 11
.Pp
.Nm Msgs
E 7
keeps track of the next message you will see by a number in the file
D 7
.I \&.msgsrc
E 7
I 7
.Pa \&.msgsrc
E 7
in your home directory.
In the directory
D 7
.I /usr/msgs
E 7
I 7
.Pa /var/msgs
E 7
it keeps a set of files whose names are the (sequential) numbers
of the messages they represent.
The file
D 7
.I /usr/msgs/bounds
E 7
I 7
.Pa /var/msgs/bounds
E 7
shows the low and high number of the messages in the directory
so that
D 7
.I msgs
E 7
I 7
.Nm msgs
E 7
can quickly determine if there are no messages for you.
If the contents of
D 7
.I bounds
E 7
I 7
.Pa bounds
E 7
is incorrect it can be fixed by removing it;
D 7
.I msgs
E 7
I 7
.Nm msgs
E 7
will make a new
D 7
.I bounds
E 7
I 7
.Pa bounds
E 7
file the next time it is run.
D 7
.PP
E 7
I 7
.Pp
E 7
D 4
Options to msgs include:
E 4
I 4
The
D 7
.B \-s
E 7
I 7
.Fl s
E 7
option is used for setting up the posting of messages.  The line
D 7
.IP
.DT
msgs: "| /usr/ucb/msgs \-s"
.PP
should be include in
.I /usr/lib/aliases
E 7
I 7
.Pp
D 8
.Dl msgs: /usr/ucb/msgs \-s"
E 8
I 8
D 14
.Dl msgs: \&"\&| /usr/ucb/msgs \-s\&"
E 14
I 14
.Dl msgs: \&"\&| /usr/bin/msgs \-s\&"
E 14
E 8
.Pp
should be included in
.Pa /etc/aliases
(see
.Xr newaliases 1 )
E 7
to enable posting of messages.
D 7
.PP
E 7
I 7
.Pp
E 7
The
D 7
.B \-c
E 7
I 7
.Fl c
E 7
option is used for performing cleanup on
D 7
.I /usr/msgs.
E 7
I 7
.Pa /var/msgs.
E 7
An entry with the
D 7
.B \-c
E 7
I 7
.Fl c
E 7
option should be placed in
D 7
.I /usr/lib/crontab
E 7
I 7
.Pa /etc/crontab
E 7
to run every night.  This will remove all messages over 21 days old.
A different expiration may be specified on the command line to override
the default.
D 7
.PP
E 7
I 7
.Pp
E 7
Options when reading messages include:
E 4
D 7
.TP 7
.B \-f
E 7
I 7
D 11
.Tw Fl
.Tp Fl f
E 7
which causes it not to say ``No new messages.''.
This is useful in your
D 7
.I \&.login
E 7
I 7
.Pa \& .login
E 11
I 11
.Bl -tag -width Fl
.It Fl f
Do not to say ``No new messages.''.
This is useful in a
.Pa .login
E 11
E 7
file since this is often the case here.
D 7
.TP 7
.B \-q
E 7
I 7
D 11
.Tp Fl q
E 11
I 11
.It Fl q
E 11
E 7
Queries whether there are messages, printing
``There are new messages.'' if there are.
The command ``msgs \-q'' is often used in login scripts.
D 7
.TP 7
.B \-h
E 7
I 7
D 11
.Tp Fl h
E 7
causes
D 7
.I msgs
E 7
I 7
.Nm msgs
E 7
to print the first part of messages only.
D 7
.TP 7
.B \-l
E 7
I 7
.Tp Fl l
E 7
option causes only locally originated messages to be reported.
D 7
.TP 7
\fInum\fR
E 7
I 7
.Tp Ar num
E 11
I 11
.It Fl h
Print the first part of messages only.
.It Fl l
Option causes only locally originated messages to be reported.
.It Ar num
E 11
E 7
A message number can be given
on the command line, causing
D 7
.I msgs
E 7
I 7
.Nm msgs
E 7
to start at the specified message rather than at the next message
indicated by your
D 7
.I \&.msgsrc
E 7
I 7
.Pa \&.msgsrc
E 7
file.
Thus
D 7
.IP "" 7
    msgs \-h 1
.IP "" 7
E 7
I 7
.Pp
.Dl msgs \-h 1
.Pp
E 7
prints the first part of all messages.
D 7
.TP 7
.I "\-number"
E 7
I 7
D 11
.Tp Ar \-number
E 7
will cause
D 7
.I msgs
E 7
I 7
.Nm msgs
E 7
to start
E 11
I 11
.It Ar \-number
Start
E 11
D 7
.I number
messages back from the one indicated by your 
.I \&.msgsrc
E 7
I 7
.Ar number
D 11
messages back from the one indicated by your
E 11
I 11
messages back from the one indicated in the
E 11
.Pa \&.msgsrc
E 7
file, useful for reviews of recent messages.
D 7
.TP 7
.B \-p
E 7
I 7
D 11
.Tp Fl p
E 7
causes long messages to be piped through
E 11
I 11
.It Fl p
Pipe long messages through
E 11
D 7
.IR more (1).
.PP
E 7
I 7
.Xr more  1  .
I 8
D 11
.Tp
E 11
I 11
.El
E 11
E 8
.Pp
E 7
Within
D 7
.I msgs
E 7
I 7
.Nm msgs
E 7
you can also go to any specific message by typing its number when
D 7
.I msgs
E 7
I 7
.Nm msgs
E 7
requests input as to what to do.
D 7
.SH FILES
.ta 2i
/usr/msgs/*	database
.br
~/.msgsrc	number of next message to be presented
.SH AUTHORS
E 7
I 7
.Sh ENVIRONMENT
D 8
.Nm Msgs uses the
E 8
I 8
.Nm Msgs
uses the
E 8
.Ev HOME
and
.Ev TERM
D 8
environment variables.
E 8
I 8
environment variables for the default home directory and
terminal type.
E 8
.Sh FILES
D 11
.Dw /usr/msgs/*
.Di L
.Dp Pa /usr/msgs/*
E 11
I 11
.Bl -tag -width /usr/msgs/* -compact
.It Pa /usr/msgs/*
E 11
database
D 11
.Dp ~/.msgsrc
E 11
I 11
.It ~/.msgsrc
E 11
number of next message to be presented
D 11
.Dp
.Sh AUTHORS
E 7
William Joy
.br
David Wasley
E 11
I 11
.El
E 11
D 7
.SH SEE ALSO
D 4
mail(1), more(1)
E 4
I 4
aliases(5), crontab(5), mail(1), more(1)
E 4
.SH BUGS
E 7
I 7
.Sh SEE ALSO
.Xr aliases 5 ,
.\".Xr crontab 5 ,
.Xr mail 1 ,
.Xr more 1
.Sh HISTORY
D 11
.Nm Msgs
appeared in 3 BSD.
.Sh BUGS
E 11
I 11
The
.Nm msgs
command appeared in
.Bx 3.0 .
E 11
E 7
E 1
