sbin/routed/SCCS/s.routed.8
h23603
s 00001/00003/00331
d D 8.2 93/12/11 23:43:23 mckusick 9 8
c copyediting for Usenix manuals
e
s 00002/00002/00332
d D 8.1 93/06/05 11:14:12 bostic 8 7
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00158/00137/00176
d D 6.6 91/03/16 17:08:46 cael 7 6
c macro and text revision (-mdoc version 3)
e
s 00002/00012/00311
d D 6.5 90/06/24 21:54:27 trent 6 5
c new copyright & pathname (routed)
e
s 00019/00008/00304
d D 6.4 89/02/15 13:59:06 bostic 5 4
c add Berkeley specific copyright notice
e
s 00015/00010/00297
d D 6.3 87/02/10 15:19:48 karels 4 3
c corrections
e
s 00098/00027/00209
d D 6.2 86/05/24 21:09:21 karels 3 2
c updates
e
s 00001/00001/00235
d D 6.1 85/04/27 15:45:21 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00236/00000/00000
d D 5.1 85/04/27 15:43:44 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
D 5
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 5
I 5
D 7
.\" Copyright (c) 1983 The Regents of the University of California.
E 7
I 7
D 8
.\" Copyright (c) 1983, 1991 The Regents of the University of California.
E 7
.\" All rights reserved.
E 8
I 8
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 8
E 5
.\"
I 5
D 6
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 6
I 6
.\" %sccs.include.redist.man%
E 6
.\"
E 5
D 7
.\"	%W% (Berkeley) %G%
E 7
I 7
.\"     %W% (Berkeley) %G%
E 7
.\"
D 2
.TH ROUTED 8C "3 February 1983"
E 2
I 2
D 5
.TH ROUTED 8C "%Q%"
E 5
I 5
D 7
.TH ROUTED 8 "%Q%"
E 5
E 2
.UC 5
.SH NAME
routed \- network routing daemon
.SH SYNOPSIS
D 6
.B /etc/routed
E 6
I 6
.B routed
E 6
[
I 3
.B \-d
] [
.B \-g
] [
E 3
.B \-s
] [
.B \-q
] [
.B \-t
] [
.I logfile
]
.SH DESCRIPTION
.I Routed
E 7
I 7
.Dd %Q%
.Dt ROUTED 8
.Os BSD 4.2
.Sh NAME
.Nm routed
.Nd network routing daemon
.Sh SYNOPSIS
.Nm routed
.Op Fl d
.Op Fl g
.Op Fl q
.Op Fl s
.Op Fl t
.Op Ar logfile
.Sh DESCRIPTION
.Nm Routed
E 7
is invoked at boot time to manage the network routing tables.
The routing daemon uses a variant of the Xerox NS Routing
Information Protocol in maintaining up to date kernel routing
table entries.
I 3
It used a generalized protocol capable of use with multiple
address types, but is currently used only for Internet routing
within a cluster of networks.
E 3
D 7
.PP
E 7
I 7
.Pp
E 7
In normal operation
D 7
.I routed
E 7
I 7
.Nm routed
E 7
D 3
listens on
E 3
I 3
listens on the
E 3
D 5
.IR udp (4P)
E 5
I 5
D 7
.IR udp (4)
E 7
I 7
.Xr udp 4
E 7
E 5
D 3
socket 520 (decimal)
E 3
I 3
socket for the
D 7
.I route
E 7
I 7
.Xr route 8
E 7
service (see
D 7
.IR services (5))
E 7
I 7
.Xr services 5 )
E 7
E 3
for routing information packets.  If the host is an
internetwork router, it periodically supplies copies
of its routing tables to any directly connected hosts
and networks.
D 7
.PP
E 7
I 7
.Pp
E 7
When
D 7
.I routed
is started, it uses the SIOCGIFCONF
.I ioctl
E 7
I 7
.Nm routed
is started, it uses the
.Dv SIOCGIFCONF
.Xr ioctl 2
E 7
to find those
directly connected interfaces configured into the
system and marked ``up'' (the software loopback interface
is ignored).  If multiple interfaces
D 3
are present, it is assumed the host will forward packets
E 3
I 3
are present, it is assumed that the host will forward packets
E 3
between networks.
D 7
.I Routed
E 7
I 7
.Nm Routed
E 7
then transmits a 
D 7
.I request
E 7
I 7
.Em request
E 7
packet on each interface (using a broadcast packet if
the interface supports it) and enters a loop, listening
for
D 7
.I request
E 7
I 7
.Em request
E 7
and
D 7
.I response
E 7
I 7
.Em response
E 7
packets from other hosts.
D 7
.PP
E 7
I 7
.Pp
E 7
When a
D 7
.I request
E 7
I 7
.Em request
E 7
packet is received, 
D 7
.I routed
E 7
I 7
.Nm routed
E 7
formulates a reply based on the information maintained in its
internal tables.  The
D 7
.I response
E 7
I 7
.Em response
E 7
packet generated contains a list of known routes, each marked
with a ``hop count'' metric (a count of 16, or greater, is
considered ``infinite'').  The metric associated with each
route returned provides a metric
D 7
.IR "relative to the sender" .
.PP
.I Response
E 7
I 7
.Em relative to the sender .
.Pp
.Em Response
E 7
packets received by
D 7
.I routed
E 7
I 7
.Nm routed
E 7
are used to update the routing tables if one of the following
conditions is satisfied:
D 7
.TP
(1)
E 7
I 7
.Bl -enum
.It
E 7
No routing table entry exists for the destination network
or host, and the metric indicates the destination is ``reachable''
(i.e. the hop count is not infinite).
D 7
.TP
(2)
E 7
I 7
.It
E 7
The source host of the packet is the same as the router in the
existing routing table entry.  That is, updated information is
being received from the very internetwork router through which
packets for the destination are being routed.
D 7
.TP
(3)
E 7
I 7
.It
E 7
The existing entry in the routing table has not been updated for
some time (defined to be 90 seconds) and the route is at least
as cost effective as the current route.
D 7
.TP
(4)
E 7
I 7
.It
E 7
The new route describes a shorter route to the destination than
the one currently stored in the routing tables; the metric of
the new route is compared against the one stored in the table
to decide this.
D 7
.PP
E 7
I 7
.El
.Pp
E 7
When an update is applied,
D 7
.I routed
E 7
I 7
.Nm routed
E 7
D 3
records the change in its internal tables and generates a
E 3
I 3
records the change in its internal tables and updates the kernel
routing table.
The change is reflected in the next
E 3
D 7
.I response
E 7
I 7
.Em response
E 7
D 3
packet to all directly connected hosts and networks.
.I Routed
waits a short period
of time (no more than 30 seconds) before modifying the kernel's
routing tables to allow possible unstable situations to settle.
E 3
I 3
packet sent.
E 3
D 7
.PP
E 7
I 7
.Pp
E 7
In addition to processing incoming packets,
D 7
.I routed
E 7
I 7
.Nm routed
E 7
also periodically checks the routing table entries.
If an entry has not been updated for 3 minutes, the entry's metric
is set to infinity and marked for deletion.  Deletions are delayed
an additional 60 seconds to insure the invalidation is propagated
D 3
throughout the internet.
E 3
I 3
throughout the local internet.
E 3
D 7
.PP
E 7
I 7
.Pp
E 7
Hosts acting as internetwork routers gratuitously supply their
routing tables every 30 seconds to all directly connected hosts
and networks.
I 3
The response is sent to the broadcast address on nets capable of that function,
to the destination address on point-to-point links, and to the router's
own address on other networks.
The normal routing tables are bypassed when sending gratuitous responses.
The reception of responses on each network is used to determine that the
network and interface are functioning correctly.
If no response is received on an interface, another route may be chosen
to route around the interface, or the route may be dropped if no alternative
is available.
E 3
D 7
.PP
D 3
Supplying the
E 3
I 3
.I Routed supports several options:
.TP
.B \-d
E 7
I 7
.Pp
Options supported by
.Nm routed :
.Bl -tag -width Ds
.It Fl d
E 7
Enable additional debugging information to be logged,
such as bad packets received.
D 7
.TP
.B \-g
E 7
I 7
.It Fl g
E 7
This flag is used on internetwork routers to offer a route
to the ``default'' destination.
This is typically used on a gateway to the Internet,
or on a gateway that uses another routing protocol whose routes
are not reported to other local routers.
D 7
.TP
E 3
.B \-s
E 7
I 7
.It Fl s
E 7
I 3
Supplying this
E 3
option forces 
D 7
.I routed
E 7
I 7
.Nm routed
E 7
to supply routing information whether it is acting as an internetwork
router or not.
D 3
The
E 3
I 3
This is the default if multiple network interfaces are present,
or if a point-to-point link is in use.
D 7
.TP
E 3
.B \-q
E 7
I 7
.It Fl q
E 7
D 3
option is the opposite of the
E 3
I 3
This
is the opposite of the
E 3
D 7
.B \-s
E 7
I 7
.Fl s
E 7
D 3
option.  If the
E 3
I 3
option.
D 7
.TP
E 3
.B \-t
E 7
I 7
.It Fl t
E 7
I 3
If the
D 7
.B \-t
E 7
I 7
.Fl t
E 7
E 3
option is specified, all packets sent or received are
printed on the standard output.  In addition,
D 7
.I routed
E 7
I 7
.Nm routed
E 7
will not divorce itself from the controlling terminal
so that interrupts from the keyboard will kill the process.
I 3
D 7
.PP
E 7
I 7
.El
.Pp
E 7
E 3
Any other argument supplied is interpreted as the name
of file in which 
D 7
.IR routed 's
E 7
I 7
.Nm routed Ns \'s
E 7
actions should be logged.  This log contains information
D 3
about any changes to the routing tables and a history of
recent messages sent and received which are related to
E 3
I 3
about any changes to the routing tables and, if not tracing all packets,
a history of recent messages sent and received which are related to
E 3
the changed route.
D 7
.PP
E 7
I 7
.Pp
E 7
In addition to the facilities described above, 
D 7
.I routed
E 7
I 7
.Nm routed
E 7
supports the notion of ``distant''
D 7
.I passive
E 7
I 7
.Em passive
E 7
and 
D 7
.I active
E 7
I 7
.Em active
E 7
gateways.  When 
D 7
.I routed
E 7
I 7
.Nm routed
E 7
is started up, it reads the file
D 7
.I /etc/gateways
E 7
I 7
.Pa /etc/gateways
E 7
D 3
to find gateways which may not be identified using
the SIOGIFCONF
E 3
I 3
to find gateways which may not be located using
D 7
only information from the SIOGIFCONF
E 3
.IR ioctl .
E 7
I 7
only information from the
.Dv SIOGIFCONF
.Xr ioctl 2 .
E 7
Gateways specified in this manner should be marked passive
if they are not expected to exchange routing information,
while gateways marked active
should be willing to exchange routing information (i.e.
they should have a
D 7
.I routed
E 7
I 7
.Nm routed
E 7
process running on the machine).
D 4
Passive gateways are maintained in the
routing tables forever and information
regarding their existence is included in
E 4
I 4
Routes through passive gateways are installed in the
kernel's routing tables once upon startup.
Such routes are not included in
E 4
any routing information transmitted.
Active gateways are treated equally to network
interfaces.  Routing information is distributed
to the gateway and if no routing information is
D 9
received for a period of the time, the associated
E 9
I 9
received for a period of time, the associated
E 9
route is deleted.
I 3
D 4
External gateways are also passive, but are not placed in the kernel
E 4
I 4
Gateways marked
D 7
.I external
E 7
I 7
.Em external
E 7
are also passive, but are not placed in the kernel
E 4
routing table nor are they included in routing updates.
The function of external entries is to inform
D 7
.I routed
E 7
I 7
.Nm routed
E 7
that another routing process
will install such a route, and that alternate routes to that destination
should not be installed.
Such entries are only required when both routers may learn of routes
to the same destination.
E 3
D 7
.PP
E 7
I 7
.Pp
E 7
The 
D 7
.I /etc/gateways
E 7
I 7
.Pa /etc/gateways
E 7
is comprised of a series of lines, each in
the following format:
D 7
.PP
.nf
D 3
< \fBnet\fP | \fBhost\fP > \fIname1\fP \fBgateway\fP \fIname2\fP \fBmetric\fP \fIvalue\fP < \fBpassive\fP | \fBactive\fP >
E 3
I 3
< \fBnet\fP | \fBhost\fP > \fIname1\fP \fBgateway\fP \fIname2\fP \fBmetric\fP \fIvalue\fP < \fBpassive\fP | \fBactive\fP | \fBexternal\fP >
E 3
.fi
.PP
E 7
I 7
.Bd -ragged
.Pf < Cm net No \&|
.Cm host Ns >
.Ar name1
.Cm gateway
.Ar name2
.Cm metric
.Ar value
.Pf < Cm passive No \&|
.Cm active No \&|
.Cm external Ns >
.Ed
.Pp
E 7
The 
D 7
.B net
E 7
I 7
.Cm net
E 7
or
D 7
.B host
E 7
I 7
.Cm host
E 7
keyword indicates if the route is to a network or specific host.
D 7
.PP
.I Name1
E 7
I 7
.Pp
.Ar Name1
E 7
is the name of the destination network or host.  This may be a
symbolic name located in
D 7
.I /etc/networks
E 7
I 7
.Pa /etc/networks
E 7
or
D 3
.IR /etc/hosts ,
E 3
I 3
D 7
.I /etc/hosts
E 7
I 7
.Pa /etc/hosts
E 7
(or, if started after
D 7
.IR named (8),
E 7
I 7
.Xr named 8 ,
E 7
known to the name server), 
E 3
or an Internet address specified in ``dot'' notation; see
D 5
.IR inet (3N).
E 5
I 5
D 7
.IR inet (3).
E 5
.PP
.I Name2
E 7
I 7
.Xr inet 3 .
.Pp
.Ar Name2
E 7
is the name or address of the gateway to which messages should
be forwarded.
D 7
.PP
.I Value
E 7
I 7
.Pp
.Ar Value
E 7
is a metric indicating the hop count to the destination host
or network.
D 7
.PP
E 7
I 7
.Pp
E 7
D 3
The keyword
.B passive
or
E 3
I 3
One of the keywords
D 7
.BR passive ,
E 3
.B active
E 7
I 7
.Cm passive ,
.Cm active
E 7
I 3
or
D 7
.B external
E 7
I 7
.Cm external
E 7
E 3
indicates if the gateway should be treated as 
D 7
.I passive
E 7
I 7
.Em passive
E 7
or
D 7
.I active
E 7
I 7
.Em active
E 7
D 3
(as described above).
E 3
I 3
(as described above),
D 4
or whether the gateway is external to the scope of the
E 4
I 4
or whether the gateway is
D 7
.I external
E 7
I 7
.Em external
E 7
to the scope of the
E 4
D 7
.I routed
E 7
I 7
.Nm routed
E 7
protocol.
D 7
.PP
E 7
I 7
.Pp
E 7
Internetwork routers that are directly attached to the Arpanet or Milnet
D 7
should use the Exterior Gateway Protocol (EGP) to gather routing information
E 7
I 7
should use the Exterior Gateway Protocol
.Pq Tn EGP
to gather routing information
E 7
rather then using a static routing table of passive gateways.
D 7
EGP is required in order to provide routes for local networks to the rest
E 7
I 7
.Tn EGP
is required in order to provide routes for local networks to the rest
E 7
of the Internet system.
D 9
Sites needing assistance with such configurations
should contact the Computer Systems Research Group at Berkeley.
E 9
E 3
D 7
.SH FILES
.DT
/etc/gateways	for distant gateways
.SH "SEE ALSO"
``Internet Transport Protocols'', XSIS 028112, Xerox System Integration
Standard.
.br
D 3
udp(4P)
E 3
I 3
D 4
udp(4P), XNSrouted(8C), htable(8)
E 4
I 4
D 5
udp(4P), icmp(4P), XNSrouted(8C), htable(8)
E 5
I 5
udp(4), icmp(4), XNSrouted(8), htable(8)
E 5
E 4
E 3
.SH BUGS
E 7
I 7
.Sh FILES
.Bl -tag -width /etc/gateways -compact
.It Pa /etc/gateways
for distant gateways
.El
.Sh SEE ALSO
.Xr udp 4 ,
.Xr icmp 4 ,
.Xr XNSrouted 8 ,
.Xr htable 8
.Rs
.%T Internet Transport Protocols
.%R XSIS 028112
.%Q Xerox System Integration Standard
.Re
.Sh BUGS
E 7
The kernel's routing tables may not correspond to those of
D 7
.I routed
E 7
I 7
.Nm routed
E 7
D 3
for short periods of time while processes utilizing existing
routes exit; the only remedy for this is to place the routing
E 3
I 3
when redirects change or add routes.
D 4
The only remedy for this is to place the routing
E 3
process in the kernel.
E 4
I 4
D 7
.I Routed
E 7
I 7
.Nm Routed
E 7
should note any redirects received by reading
D 7
the ICMP packets received via a raw socket.
E 4
.PP
.I Routed
E 7
I 7
the
.Tn ICMP
packets received via a raw socket.
.Pp
.Nm Routed
E 7
I 3
should incorporate other routing protocols,
D 7
such as Xerox NS
D 5
.RI ( XNSrouted (8C))
E 5
I 5
.RI ( XNSrouted (8))
E 5
and EGP.
E 7
I 7
such as Xerox
.Tn \&NS
.Pq Xr XNSrouted 8
and
.Tn EGP .
E 7
Using separate processes for each requires configuration options
to avoid redundant or competing routes.
D 7
.PP
.I Routed
E 3
D 4
should listen to intelligent interfaces, such as an IMP, and
to error protocols, such as ICMP, to gather more information.
E 4
I 4
should listen to intelligent interfaces, such as an IMP,
E 7
I 7
.Pp
.Nm Routed
should listen to intelligent interfaces, such as an
.Tn IMP ,
E 7
to gather more information.
E 4
I 3
It does not always detect unidirectional failures in network interfaces
(e.g., when the output side fails).
I 7
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.2 .
E 7
E 3
E 1
