usr.bin/ruptime/SCCS/s.ruptime.1
h44160
s 00002/00002/00053
d D 8.2 94/04/05 13:51:44 bostic 14 13
c prettiness police
e
s 00002/00002/00053
d D 8.1 93/06/06 16:11:37 bostic 13 12
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00002/00002/00053
d D 6.10 91/09/05 17:30:35 sellgren 12 11
c data files are in /var/rwho, not /usr/var/rwho
e
s 00012/00014/00043
d D 6.9 91/04/23 15:40:20 cael 11 10
c converted to mdoc version 3
e
s 00002/00000/00055
d D 6.8 91/03/14 00:27:04 cael 10 8
c add .Vx so tmac.andoc will call tmac.mdoc-old
e
s 00001/00000/00055
d R 6.8 91/03/13 20:37:45 cael 9 8
c add .Vx so tmac.andoc will call tmac.mdoc-old
e
s 00047/00042/00008
d D 6.7 90/07/24 22:51:23 cael 8 7
c .Xr botch fix
e
s 00031/00027/00019
d D 6.6 90/07/21 09:23:58 bostic 7 6
c allocate space for hosts, rather than fixed table size
c lots of lint, general cleanliness, redo the man page
c bug report 4.3BSD-reno/usr.bin/2
e
s 00000/00000/00046
d D 6.5 90/06/24 19:22:04 cael 6 5
c converted man page
e
s 00004/00014/00042
d D 6.4 90/06/24 19:15:13 cael 5 4
c converted man page
e
s 00010/00021/00046
d D 6.3 89/04/09 17:11:55 bostic 4 3
c fix synopsis statement
e
s 00016/00005/00051
d D 6.2 88/09/20 17:28:00 bostic 3 2
c Berkeley copyright
e
s 00007/00002/00049
d D 6.1 85/04/29 21:16:11 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00051/00000/00000
d D 5.1 85/04/29 21:16:01 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
D 3
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 3
I 3
D 5
.\" Copyright (c) 1983 The Regents of the University of California.
E 5
I 5
D 13
.\" Copyright (c) 1983, 1990 The Regents of the University of California.
E 5
.\" All rights reserved.
E 13
I 13
D 14
.\" Copyright (c) 1983, 1990, 1993
E 14
I 14
.\" Copyright (c) 1983, 1990, 1993, 1994
E 14
.\"	The Regents of the University of California.  All rights reserved.
E 13
E 3
.\"
I 3
D 5
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 5
I 5
.\" %sccs.include.redist.man%
E 5
.\"
E 3
D 5
.\"	%W% (Berkeley) %G%
E 5
I 5
.\"     %W% (Berkeley) %G%
E 5
.\"
I 10
D 11
.Vx
.Vx
E 11
E 10
D 2
.TH RUPTIME 1C "8 March 1982"
E 2
I 2
D 3
.TH RUPTIME 1C "%Q%"
E 3
I 3
D 5
.TH RUPTIME 1 "%Q%"
E 5
I 5
D 8
.TH RUPTIME 1 "%Q"
E 5
E 3
E 2
.UC 5
.SH NAME
D 7
ruptime \- show host status of local machines
E 7
I 7
ruptime \- display status of local network machines
E 7
.SH SYNOPSIS
D 7
.B ruptime
[
D 4
.B \-a
] [
I 2
.B \-r
] [
E 2
.B \-l
] [
.B \-t
] [
.B \-u
E 4
I 4
.B -alrtu
E 4
]
E 7
I 7
.ft B
.nf
ruptime [ -alrtu ]
.fi
.ft R
E 7
.SH DESCRIPTION
.I Ruptime
D 7
gives a status line like
.I uptime
D 4
for each machine on the local network;
these are formed from packets broadcast by each host
on the network once a minute.
E 4
I 4
for each machine on the local network; these are formed from packets
broadcast by each host on the network once a minute.
E 7
I 7
displays a status line like
.IR uptime (1)
for each host on the local network, sorted by host name.
The information is obtained from packets broadcast once per minute
by the hosts.
E 7
E 4
.PP
D 4
Machines for which no
D 2
status report has been received for 5 minutes are shown as being down.
E 2
I 2
status report has been received for 11 minutes are shown as being down.
E 4
I 4
D 7
Machines for which no status report has been received for 11
E 7
I 7
Machines for which no status report has been received for the last 11
E 8
I 8
.Dd %Q%
.Dt RUPTIME 1
.Os BSD 4.2
.Sh NAME
.Nm ruptime
.Nd show host status of local machines
.Sh SYNOPSIS
.Nm ruptime
.Op Fl alrtu
.Sh DESCRIPTION
.Nm Ruptime
gives a status line like
.Ar uptime
for each machine on the local network; these are formed from packets
broadcast by each host on the network once a minute.
.Pp
Machines for which no status report has been received for 11
E 8
E 7
minutes are shown as being down.
E 4
E 2
D 8
.PP
D 7
Users idle an hour or more are not counted unless the
.B \-a
flag is given.
.PP
Normally, the listing is sorted by host name.
The
D 4
.B \-l ,
.B \-t ,
E 4
I 4
.BR \-l ,
.BR \-t ,
E 4
and
D 4
.B \-u
flags specify sorting by
load average,
uptime,
and number of users, respectively.
E 4
I 4
.BR \-u
flags specify sorting by load average, uptime, and number of users,
respectively.
E 4
I 2
The
.B \-r
flag reverses the sort order.
E 7
I 7
The options are as follows:
.TP
\-a
Users idle for more than an hour are not counted unless the \-a
option is specified.
.TP
\-l
Sort the output by load average, greatest to least, instead of host name.
.TP
\-r
Reverse the sort order.
.TP
\-t
Sort the output by uptime, longest to shortest, instead of host name.
.TP
\-u
Sort the output by number of users, most to least, instead of host name.
E 7
E 2
.SH FILES
.DT
D 7
/usr/spool/rwho/whod.*	data files
E 7
I 7
/var/rwho/whod.*	data files
E 7
.SH SEE ALSO
D 3
rwho(1C)
E 3
I 3
D 7
rwho(1)
E 7
I 7
rwho(1), uptime(1), w(1)
E 8
I 8
.Pp
D 14
Options:
E 14
I 14
The options are as follows:
E 14
D 11
.Tw Ds
.Tp Fl a
E 11
I 11
.Bl -tag -width Ds
.It Fl a
E 11
Users idle an hour or more are not counted unless the
.Fl a
flag is given.
D 11
.Tp Fl l
E 11
I 11
.It Fl l
E 11
Sort by load average.
D 11
.Tp Fl r
E 11
I 11
.It Fl r
E 11
Reverses the sort order.
D 11
.Tp Fl t
E 11
I 11
.It Fl t
E 11
Sort by uptime.
D 11
.Tp Fl u
E 11
I 11
.It Fl u
E 11
Sort by number of users.
D 11
.Tp
E 11
I 11
.El
E 11
.Pp
The default listing is sorted by host name.
.Sh FILES
D 11
.Dw /usr/var/rwho/whod.*
.Di L
.Dp Pa /usr/var/rwho/whod.*
E 11
I 11
D 12
.Bl -tag -width /usr/var/rwho/whod.* -compact
.It Pa /usr/var/rwho/whod.*
E 12
I 12
.Bl -tag -width /var/rwho/whod.* -compact
.It Pa /var/rwho/whod.*
E 12
E 11
data files
D 11
.Dp
E 11
I 11
.El
E 11
.Sh SEE ALSO
.Xr rwho 1
.Xr uptime 1
.Sh HISTORY
.Nm Ruptime
D 11
appeared in 4.2 BSD.
E 11
I 11
appeared in
.Bx 4.2 .
E 11
E 8
E 7
E 3
E 1
