sbin/mount_portal/SCCS/s.mount_portal.8
h52377
s 00017/00005/00093
d D 8.3 94/03/27 11:43:23 bostic 6 5
c Jan-Simon Pendry's and my new mount code
e
s 00002/00002/00096
d D 8.2 93/12/16 10:20:48 pendry 5 4
c fix typos
e
s 00002/00002/00096
d D 8.1 93/06/09 19:07:34 bostic 4 3
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00002/00004/00096
d D 1.2 93/06/09 19:07:31 bostic 3 1
c fixed the under development line
e
s 00002/00002/00098
d R 8.1 93/06/05 11:03:49 bostic 2 1
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00100/00000/00000
d D 1.1 93/05/28 03:37:16 pendry 1 0
c date and time created 93/05/28 03:37:16 by pendry
e
u
U
t
T
I 1
.\"
D 4
.\" Copyright (c) 1993 The Regents of the University of California
.\" Copyright (c) 1993 Jan-Simon Pendry
E 4
I 4
D 6
.\" Copyright (c) 1993
E 6
I 6
.\" Copyright (c) 1993, 1994
E 6
.\"	The Regents of the University of California.  All rights reserved.
E 4
.\" All rights reserved.
.\"
.\" This code is derived from software donated to Berkeley by
.\" Jan-Simon Pendry.
.\"
.\" %sccs.include.redist.roff%
.\"
.\"	%W% (Berkeley) %G%
.\"
.\"
.Dd %Q%
.Dt MOUNT_PORTAL 8
.Os BSD 4.4
.Sh NAME
.Nm mount_portal
.Nd mount the portal daemon
.Sh SYNOPSIS
.Nm mount_portal
D 6
.Op Fl F fsoptions
.Pa /etc/portal.conf
.Pa mount_point
E 6
I 6
.Op Fl o Ar options
.Ar /etc/portal.conf
.Ar mount_point
E 6
.Sh DESCRIPTION
The
.Nm mount_portal
command attaches an instance of the portal daemon
to the global filesystem namespace.
The conventional mount point is
.Pa /p .
.PA /dev .
This command is normally executed by
.Xr mount 8
at boot time.
.Pp
I 6
The options are as follows:
.Bl -tag -width indent
.It Fl o
Options are specified with a
.Fl o
flag followed by a comma separated string of options.
See the
.Xr mount 8
man page for possible options and their meanings.
.El
.Pp
E 6
The portal daemon provides an
D 5
.I open
E 5
I 5
.Em open
E 5
service.
Objects opened under the portal mount point are
dynamically created by the portal daemon according
to rules specified in the named configuration file.
Using this mechanism allows descriptors such as sockets
to be made available in the filesystem namespace.
.Pp
The portal daemon works by being passed the full pathname
of the object being opened.
The daemon creates an appropriate descriptor according
to the rules in the configuration file, and then passes the descriptor back
to the calling process as the result of the open system call.
.Sh NAMESPACE
By convention, the portal daemon divides the namespace into sub-namespaces,
each of which handles objects of a particular type.
.Pp
D 5
Current, two sub-namespaces are implemented:
E 5
I 5
Currently, two sub-namespaces are implemented:
E 5
.Pa tcp
and
.Pa fs .
The
.Pa tcp
namespace takes a hostname and a port (slash separated) and
creates an open TCP/IP connection.
The
.Pa fs
namespace opens the named file, starting back at the root directory.
This can be used to provide a controlled escape path from
a chrooted environment.
.Sh "CONFIGURATION FILE"
The configuration file contains a list of rules.
Each rule takes one line and consists of two or more
whitespace separated fields.
A hash (``#'') character causes the remainder of a line to
be ignored.  Blank lines are ignored.
.Pp
The first field is a pathname prefix to match
against the requested pathname.
If a match is found, the second field
tells the daemon what type of object to create.
Subsequent fields are passed to the creation function.
.Bd -literal
# @(#)portal.conf	5.1 (Berkeley) 7/13/92
tcp/		tcp tcp/
fs/		file fs/
.Ed
.Sh FILES
.Bl -tag -width /p/* -compact
.It Pa /p/*
.El
.Sh SEE ALSO
.Xr mount 2 ,
.Xr unmount 2 ,
D 6
.Xr fstab 5
E 6
I 6
.Xr fstab 5 ,
.Xr mount 8
E 6
.Sh CAVEATS
This filesystem may not be NFS-exported.
.Sh HISTORY
The
D 3
.Nm
portal filesystem
is
.Ud
E 3
I 3
.Nm mount_portal
utility first appeared in 4.4BSD.
E 3
E 1
