usr.bin/su/SCCS/s.su.1
h44335
s 00001/00005/00145
d D 8.2 94/04/18 07:17:43 bostic 17 16
c typo, but it was wrong -- su did not come from MIT
e
s 00002/00002/00148
d D 8.1 93/06/06 16:27:31 bostic 16 15
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00006/00004/00144
d D 6.12 91/07/29 16:42:32 cael 15 14
c .Os change
e
s 00109/00064/00039
d D 6.11 91/04/22 15:35:41 cael 14 12
c mdoc conversion
e
s 00003/00003/00100
d R 6.11 90/06/24 19:18:44 cael 13 12
c converted man page
e
s 00007/00002/00096
d D 6.10 90/06/22 15:50:37 kfall 12 11
c add a bit more Kerberos info
e
s 00074/00043/00024
d D 6.9 90/05/31 09:45:29 bostic 11 10
c make -l, -m mutually exclusive, rename -n as -K for consistency with
c rlogin and rsh; clean up the man page
e
s 00008/00004/00059
d D 6.8 89/10/12 18:13:49 kfall 10 9
c add comments about Kerb. and -n flag
e
s 00007/00003/00056
d D 6.7 88/12/07 12:51:42 bostic 9 8
c change so that -m fails if non-standard shell and not root, rather
c than just running the non-standard shell
e
s 00003/00002/00056
d D 6.6 88/09/26 17:47:39 bostic 8 7
c use getusershell(3) instead of missing password as security flag
e
s 00041/00035/00017
d D 6.5 88/09/26 17:11:07 bostic 7 6
c add -m flag; completely redo the manual page.  Now 3 behaviors, default,
c which is the old hybrid, -m, which is "as me", i.e., don't change anything, and
c -l for the full login.
e
s 00033/00030/00019
d D 6.4 88/09/26 10:02:50 bostic 6 5
c preserve environment and use user's shell by default
e
s 00018/00024/00031
d D 6.3 88/09/13 11:05:05 bostic 5 4
c mention the -l flag; minor cleanups
e
s 00004/00007/00051
d D 6.2 86/05/05 16:55:18 mckusick 4 3
c only those in wheel group can su to root
e
s 00017/00003/00041
d D 6.1 85/04/29 15:03:55 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00002/00002/00042
d D 5.1 85/04/29 15:03:42 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00044/00000/00000
d D 4.1 85/04/29 15:03:31 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
D 6
.\" Copyright (c) 1980 Regents of the University of California.
E 6
I 6
D 7
.\" Copyright (c) 1980, 1988 Regents of the University of California.
E 6
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 7
I 7
D 14
.\" Copyright (c) 1988 The Regents of the University of California.
E 14
I 14
D 16
.\" Copyright (c) 1988, 1990 The Regents of the University of California.
E 14
.\" All rights reserved.
E 16
I 16
D 17
.\" Copyright (c) 1988, 1990, 1993
E 17
I 17
.\" Copyright (c) 1988, 1990, 1993, 1994
E 17
.\"	The Regents of the University of California.  All rights reserved.
E 16
E 7
.\"
I 7
D 11
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 11
I 11
D 15
.\" %sccs.include.redist.man%
E 15
I 15
.\" %sccs.include.redist.roff%
E 15
E 11
.\"
E 7
D 14
.\"	%W% (Berkeley) %G%
E 14
I 14
D 15
.\"     %W% (Berkeley) %G%
E 15
I 15
.\"	%W% (Berkeley) %G%
E 15
E 14
.\"
D 2
.TH SU 1 11/16/79
E 2
I 2
D 3
.TH SU 1 "16 November 1979"
E 3
I 3
D 14
.TH SU 1 "%Q%"
E 3
E 2
.UC
.SH NAME
D 6
su \- substitute user id temporarily
E 6
I 6
su \- substitute user id
E 6
.SH SYNOPSIS
D 11
.B su
D 3
[ userid ]
E 3
I 3
D 5
[ \-f ] [ \- ] [ userid ]
E 5
I 5
D 6
[ \-fl] [ login ]
E 6
I 6
D 7
[-fl] [login]
E 7
I 7
D 10
[-flm] [login]
E 10
I 10
[-flmn] [login]
E 11
I 11
.nf
.ft B
su [ -Kflm ] [ login ]
.ft R
.nf
E 11
E 10
E 7
E 6
E 5
E 3
.SH DESCRIPTION
D 7
.I Su
D 5
demands the password of the specified
.I userid,
and if it is given,
changes to that 
E 5
I 5
D 6
requests the password for the specified
.I login,
changes to that
E 5
.I userid
D 5
and invokes the Shell
.IR sh (1)
I 3
or
.IR csh (1)
E 3
without changing the current directory.
The user environment
is unchanged except for HOME and SHELL,
which are taken from the password file
for the user being substituted
(see
E 5
I 5
and invokes the login's shell without changing the current directory.
The user environment is unchanged except for HOME and SHELL, which are
taken from the password file for the user being substituted (see
E 5
D 2
.IR environ (5)).
E 2
I 2
.IR environ (7)).
E 6
I 6
requests the password for
.I login
(or for ``root'', if no login is provided), changes to that user and
group ID and invokes another instance of your login shell.
The environment is unmodified.
E 7
I 7
D 10
\fISu\fP requests the password for \fIlogin\fP (or for ``root'', if no
login is provided), and switches to that user and group ID.  A shell is
then invoked.
E 10
I 10
D 11
\fISu\fP requests the Kerberos password
for \fIlogin\fP (or for ``\fIlogin\fP.root'', if no
login is provided), and switches to that user and group ID after
issueing a Kerberos ticket granting ticket.
A shell is then invoked .
\fISu\fP will resort to the local password file to find the password
for \fIlogin\fP if there is a Kerberos error or if the \fB-n\fP flag is given.
E 11
I 11
.I Su
E 14
I 14
.Dd %Q%
.Dt SU 1
D 15
.Os BSD 4.4
E 15
I 15
.Os
E 15
.Sh NAME
.Nm su
.Nd substitute user identity
.Sh SYNOPSIS
.Nm su
.Op Fl Kflm
.Op Ar login
.Sh DESCRIPTION
.Nm Su
E 14
requests the Kerberos password for
D 14
.I login
(or for ``\fIlogin\fP.root'', if no login is provided), and switches to
E 14
I 14
.Ar login
(or for
.Dq Ar login Ns .root ,
if no login is provided), and switches to
E 14
D 12
that user and group ID after issuing a Kerberos ticket granting ticket.
E 12
I 12
that user and group ID after obtaining a Kerberos ticket granting ticket.
E 12
D 14
A shell is then invoked.
.I Su
E 14
I 14
A shell is then executed.
.Nm Su
E 14
will resort to the local password file to find the password for
D 14
.I login
E 14
I 14
.Ar login
E 14
if there is a Kerberos error.
I 12
If
D 14
.I su
E 14
I 14
.Nm su
E 14
is executed by root, no password is requested and a shell
D 14
with the appropriate user ID is invoked; no additional Kerberos tickets
E 14
I 14
with the appropriate user ID is executed; no additional Kerberos tickets
E 14
are obtained.
E 12
E 11
E 10
E 7
D 14
.PP
E 14
I 14
.Pp
E 14
D 7
If the invoked shell is
.IR csh ,
the
.I -f
option prevents it from reading your
.I .cshrc
file.  Otherwise, the
.I -f
option is ignored.
E 7
I 7
D 11
By default, your environment is unmodified with the exception of
\fIUSER\fP, \fIHOME\fP, and \fISHELL\fP.  \fIHOME\fP and \fISHELL\fP
are set to the target login's \fI/etc/passwd\fP values.  \fIUSER\fP
is set to the target login, unless the target login has a UID of 0,
in which  case it is unmodified.  The invoked shell is the target
login's.  This is the traditional behavior of \fIsu\fP.
E 11
I 11
By default, the environment is unmodified with the exception of
D 14
.IR USER ,
.IR HOME ,
E 14
I 14
.Ev USER ,
.Ev HOME ,
E 14
and
D 14
.IR SHELL .
.I HOME
E 14
I 14
.Ev SHELL .
.Ev HOME
E 14
and
D 14
.I SHELL
E 14
I 14
.Ev SHELL
E 14
are set to the target login's default values.
D 14
.I USER
E 14
I 14
.Ev USER
E 14
is set to the target login, unless the target login has a user ID of 0,
in which case it is unmodified.
The invoked shell is the target login's.
This is the traditional behavior of
D 14
.IR su .
E 11
E 7
.PP
E 14
I 14
.Nm su .
.Pp
E 14
D 7
The
.I -l
option simulates a full login; the environment is discarded except for
HOME, SHELL, TERM, and USER.  HOME, SHELL, and USER are taken from the
password file for the user being substituted.  TERM is copied from
your environment.  The invoked shell is the substituted user's, not
yours.
E 7
I 7
D 11
The \fI-l\fP option simulates a full login.  The environment is discarded
except for \fIHOME\fP, \fISHELL\fP, \fIPATH\fP, \fITERM\fP, and \fIUSER\fP.
\fIHOME\fP and \fISHELL\fP are modified as above.  \fIUSER\fP is set to
the target login.  \fIPATH\fP is set to ``/usr/ucb:/bin:/usr/bin''.
\fITERM\fP is imported from your current environment.  The invoked shell
is the target login's, and \fIsu\fP will change directory to the target
login's home directory.
E 7
.PP
E 6
E 2
D 5
The new user ID stays in force until the Shell exits.
E 5
I 5
D 7
The new user ID stays in force until the shell exits.
E 7
I 7
The \fI-m\fP option causes the environment to remain unmodified, and
the invoked shell to be your login shell.  No directory changes are
D 8
made.  As a security precaution, if the target login has no password,
its shell is used, rather than yours.
E 8
I 8
D 9
made.  As a security precaution, if the target shell is not a standard
shell (as defined by \fIgetusershell\fP(3)) it is invoked instead of
your login shell.
E 9
I 9
made.  As a security precaution, if the 
.I -m
option is specified, the target user's shell is a non-standard shell
(as defined by \fIgetusershell\fP(3)) and the caller's real uid is
E 11
I 11
The options are as follows:
D 14
.TP
\-K
E 14
I 14
.Bl -tag -width Ds
.It Fl K
E 14
Do not attempt to use Kerberos to authenticate the user.
D 14
.TP
\-f
E 14
I 14
.It Fl f
E 14
If the invoked shell is
D 14
.IR csh (1),
this option prevents it from reading the ``.cshrc'' file.
.TP
\-l
E 14
I 14
.Xr csh 1 ,
this option prevents it from reading the
.Dq Pa .cshrc
file.
.It Fl l
E 14
Simulate a full login.
The environment is discarded except for
D 14
.IR HOME ,
.IR SHELL ,
.IR PATH ,
.IR TERM ,
E 14
I 14
.Ev HOME ,
.Ev SHELL ,
.Ev PATH ,
.Ev TERM ,
E 14
and
D 14
.IR USER .
.I HOME
E 14
I 14
.Ev USER .
.Ev HOME
E 14
and
D 14
.I SHELL
E 14
I 14
.Ev SHELL
E 14
are modified as above.
D 14
.I USER
E 14
I 14
.Ev USER
E 14
is set to the target login.
D 14
.I PATH
is set to ``/bin:/usr/bin''.
.I TERM
E 14
I 14
.Ev PATH
is set to
.Dq Pa /bin:/usr/bin .
.Ev TERM
E 14
is imported from your current environment.
The invoked shell is the target login's, and
D 14
.I su
E 14
I 14
.Nm su
E 14
will change directory to the target login's home directory.
D 14
.TP
\-m
E 14
I 14
.It Fl m
E 14
Leave the environment unmodified.
The invoked shell is your login shell, and no directory changes are made.
As a security precaution, if the target user's shell is a non-standard
D 14
shell (as defined by \fIgetusershell\fP(3)) and the caller's real uid is
E 14
I 14
shell (as defined by
.Xr getusershell 3 )
and the caller's real uid is
E 14
E 11
non-zero,
D 14
.I su
E 14
I 14
.Nm su
E 14
will fail.
E 9
E 8
E 7
E 5
D 14
.PP
D 5
If no 
.I userid
D 4
is specified, `root' is assumed.
E 4
I 4
is specified, ``root'' is assumed.
E 5
I 5
D 6
If
.I login
is unspecified, the super-user, ``root'' is assumed.
E 5
Only users in the ``wheel'' group (group 0) can
E 6
I 6
D 7
If the substituted user has no password, their login shell is invoked
rather than yours.
E 7
I 7
D 11
If the invoked shell is \fIcsh\fP, the \fI-f\fP option prevents it from
reading the \fI.cshrc\fP file.  Otherwise, this option is ignored.
E 11
I 11
The \-l and \-m options are mutually exclusive; the last one specified
E 14
I 14
.El
.Pp
The
.Fl l
and
.Fl m
options are mutually exclusive; the last one specified
E 14
overrides any previous ones.
E 11
E 7
D 14
.PP
D 7
Only users in group 0 (normally ``wheel'') can
E 6
.I su
to ``root'', even with the root password.
E 7
I 7
D 11
Only users in group 0 (normally ``wheel'') can \fIsu\fP to ``root''.
E 11
I 11
Only users in group 0 (normally ``wheel'') can
.I su
to ``root''.
E 11
E 7
I 6
.PP
E 14
I 14
.Pp
Only users in group 0 (normally
.Dq wheel )
can
.Nm su
to
.Dq root .
.Pp
E 14
E 6
E 4
D 5
To remind the super-user of his responsibilities,
the Shell substitutes `#' for its usual prompt.
E 5
I 5
D 7
To remind the super-user of his responsibilities, by default,
the shell substitutes ``#'' for its usual prompt.
E 7
I 7
By default (unless the prompt is reset by a startup file) the super-user
D 14
prompt is set to ``#'' to remind one of its awesome power.
E 7
E 5
I 3
D 6
.PP
The
.B \-f
option prevents
.IR csh (1)
D 5
from executing the .cshrc file; thus making
E 5
I 5
from executing the
.I .cshrc
file; thus making
E 5
.I su
start up faster.
.PP
The
D 5
.B \-
E 5
I 5
.B \-l
E 5
option simulates a full login.
E 6
E 3
.SH "SEE ALSO"
D 3
sh(1)
E 3
I 3
D 5
sh(1), csh(1)
E 5
I 5
D 6
sh(1), csh(1), environ(7)
E 6
I 6
D 7
csh(1), login(1), sh(1), environ(7)
E 7
I 7
D 12
csh(1), login(1), sh(1), passwd(5), group(5), environ(7)
E 12
I 12
csh(1), login(1), sh(1), kinit(1), kerberos(1), passwd(5), group(5), environ(7)
E 14
I 14
prompt is set to
.Dq Sy \&#
to remind one of its awesome power.
.Sh SEE ALSO
.Xr csh 1 ,
.Xr login 1 ,
.Xr sh 1 ,
.Xr kinit 1 ,
.Xr kerberos 1 ,
.Xr passwd 5 ,
.Xr group 5 ,
.Xr environ 7
.Sh ENVIRONMENT
Environment variables used by
.Nm su :
.Bl -tag -width HOME
.It Ev HOME
Default home directory of real user ID unless modified as
specified above.
.It Ev PATH
Default search path of real user ID unless modified as specified above.
.It Ev TERM
Provides terminal type which may be retained for the substituted
user ID.
.It Ev USER
The user ID is always the effective ID (the target user ID) after an
.Nm su
unless the user ID is 0 (root).
.El
.Sh HISTORY
A
.Nm
command appeared in
.At v7 .
D 17
The version desribed
D 15
here is an adaptation of the MIT Athena Kerberos command.
E 15
I 15
here is an adaptation of the
.Tn MIT
Athena Kerberos command.
E 17
E 15
E 14
E 12
E 7
E 6
E 5
E 3
D 4
.SH BUGS
Local administrative rules cause restrictions to
be placed on who can
.I su
to `root', even with the root password.
These rules vary from site to site.
E 4
E 1
