usr.bin/rwho/SCCS/s.rwho.1
h58913
s 00002/00002/00052
d D 8.1 93/06/06 16:11:58 bostic 11 10
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00002/00002/00052
d D 6.8 91/09/05 17:31:37 sellgren 10 9
c data files are in /var/rwho, not /var/spool/rwho
e
s 00010/00010/00044
d D 6.7 91/04/23 23:54:15 cael 9 8
c mdoc version three
e
s 00002/00000/00052
d D 6.6 91/03/14 00:27:14 cael 8 6
c add .Vx so tmac.andoc will call tmac.mdoc-old
e
s 00001/00000/00052
d R 6.6 91/03/13 20:37:49 cael 7 6
c add .Vx so tmac.andoc will call tmac.mdoc-old
e
s 00000/00000/00052
d D 6.5 90/07/24 22:51:26 cael 6 5
c .Xr botch fix
e
s 00000/00000/00052
d D 6.4 90/06/24 19:24:20 cael 5 4
c converted man page
e
s 00033/00035/00019
d D 6.3 90/06/11 06:00:22 cael 4 3
c converted man page
e
s 00016/00006/00038
d D 6.2 88/09/20 17:30:05 bostic 3 2
c Berkeley copyright
e
s 00001/00001/00043
d D 6.1 85/04/29 21:16:42 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00044/00000/00000
d D 5.1 85/04/29 21:16:24 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
D 3
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 3
I 3
D 4
.\" Copyright (c) 1983 The Regents of the University of California.
E 4
I 4
D 11
.\" Copyright (c) 1983, 1990 The Regents of the University of California.
E 4
.\" All rights reserved.
E 11
I 11
.\" Copyright (c) 1983, 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 11
E 3
.\"
I 3
D 4
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 4
I 4
D 9
.\" %sccs.include.redist.man%
E 9
I 9
.\" %sccs.include.redist.roff%
E 9
E 4
.\"
E 3
D 4
.\"	%W% (Berkeley) %G%
E 4
I 4
.\"     %W% (Berkeley) %G%
E 4
.\"
I 8
D 9
.Vx
.Vx
E 9
E 8
D 2
.TH RWHO 1C "23 March 1982"
E 2
I 2
D 3
.TH RWHO 1C "%Q%"
E 3
I 3
D 4
.TH RWHO 1 "%Q%"
E 3
E 2
.UC 5
.SH NAME
rwho \- who's logged in on local machines
.SH SYNOPSIS
.B rwho
[
.B \-a
]
.SH DESCRIPTION
E 4
I 4
.Dd %Q%
.Dt RWHO 1
.Os BSD 4.2
.Sh NAME
.Nm rwho
D 9
.Nd who's logged in on local machines
E 9
I 9
.Nd who is logged in on local machines
E 9
.Sh SYNOPSIS
.Nm rwho
.Op Fl a
.Sh DESCRIPTION
E 4
The
D 4
.I rwho
E 4
I 4
.Nm rwho
E 4
command produces output similar to
D 4
.I who,
E 4
I 4
.Xr who ,
E 4
but for all machines on the local network.
If no report has been
received from a machine for 5 minutes then
D 4
.I rwho
E 4
I 4
.Nm rwho
E 4
assumes the machine is down, and does not report users last known
to be logged into that machine.
D 4
.PP
E 4
I 4
.Pp
E 4
If a users hasn't typed to the system for a minute or more, then
D 4
.I rwho
E 4
I 4
.Nm rwho
E 4
reports this idle time.  If a user hasn't typed to the system for
an hour or more, then
the user will be omitted from the output of
D 4
.I rwho
E 4
I 4
.Nm rwho
E 4
unless the
D 4
.B \-a
E 4
I 4
.Fl a
E 4
flag is given.
D 4
.SH FILES
/usr/spool/rwho/whod.*	information about other machines
.SH SEE ALSO
D 3
ruptime(1C),
rwhod(8C)
E 3
I 3
ruptime(1), rwhod(8)
E 3
.SH BUGS
E 4
I 4
.Sh FILES
D 9
.Dw /var/spool/rwho/rhowd.*
.Di L
.Dp Pa /var/spool/rwho/whod.*
E 9
I 9
D 10
.Bl -tag -width /var/spool/rwho/rhowd.* -compact
.It Pa /var/spool/rwho/whod.*
E 10
I 10
.Bl -tag -width /var/rwho/rhowd.* -compact
.It Pa /var/rwho/whod.*
E 10
E 9
information about other machines
D 9
.Dp
E 9
I 9
.El
E 9
.Sh SEE ALSO
.Xr ruptime 1 ,
.Xr rwhod 8
.Sh HISTORY
D 9
.Nm Rwho
appeared in 4.3 BSD.
E 9
I 9
The
.Nm rwho
command
appeared in
.Bx 4.3 .
E 9
.Sh BUGS
E 4
This is unwieldy when the number of machines
on the local net is large.
E 1
