usr.sbin/diskpart/SCCS/s.diskpart.8
h46732
s 00002/00002/00115
d D 8.1 93/06/06 13:56:16 bostic 8 7
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00085/00059/00032
d D 6.6 91/03/16 18:12:02 cael 7 6
c macro and text revision (-mdoc version 3)
e
s 00001/00001/00090
d D 6.5 90/06/24 22:14:43 trent 6 5
c new pathname (diskpart)
e
s 00014/00004/00077
d D 6.4 88/07/12 19:56:38 karels 5 4
c update
e
s 00010/00005/00071
d D 6.3 86/05/30 18:54:26 karels 4 3
c change to c partition
e
s 00000/00002/00076
d D 6.2 86/05/21 22:23:57 mckusick 3 2
c one bug down, one to go
e
s 00001/00001/00077
d D 6.1 85/04/27 14:49:55 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00078/00000/00000
d D 5.1 85/04/27 14:49:34 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
D 7
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 7
I 7
D 8
.\" Copyright (c) 1983, 1991 Regents of the University of California.
.\" All rights reserved.
E 8
I 8
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 8
E 7
.\"
D 7
.\"	%W% (Berkeley) %G%
E 7
I 7
.\" %sccs.include.redist.man%
E 7
.\"
D 2
.TH DISKPART 8 "18 July 1983"
E 2
I 2
D 7
.TH DISKPART 8 "%Q%"
E 2
.UC 4
.SH NAME
diskpart \- calculate default disk partition sizes
.SH SYNOPSIS
D 6
.B /etc/diskpart
E 6
I 6
.B diskpart
E 6
[
.B \-p
] [
.B \-d
I 5
] [
.B \-s
size
E 5
]
disk-type
.SH DESCRIPTION
.I Diskpart
E 7
I 7
.\"     %W% (Berkeley) %G%
.\"
.Dd %Q%
.Dt DISKPART 8
.Os BSD 4
.Sh NAME
.Nm diskpart
.Nd calculate default disk partition sizes
.Sh SYNOPSIS
.Nm diskpart
.Op Fl p
.Op Fl d
.Op Fl s Ar size
.Ar disk-type
.Sh DESCRIPTION
.Nm Diskpart
E 7
is used to calculate the disk partition sizes based on the
D 7
default rules used at Berkeley.  If the
.B \-p
option is supplied, tables suitable for inclusion in a device driver
are produced.  If the
.B \-d
option is supplied, an entry suitable for inclusion in the disk
E 7
I 7
default rules used at Berkeley.
.Pp
Available options and operands:
.Bl -tag -width Fl
.It Fl p
Tables suitable for inclusion in a device driver
are produced.
.It Fl d
An entry suitable for inclusion in the disk
E 7
description file
D 7
.I /etc/disktab
is generated; c.f.
.IR disktab (5).
E 7
I 7
.Pa /etc/disktab
is generated; for example,
.Xr disktab 5 .
.It Fl s Ar size
The size of the disk may be limited to
.Ar size
with the
.Fl s
option.
.El
.Pp
E 7
D 4
Space is always left in the last partition on the disk
E 4
I 4
On disks that use
D 7
.IR bad144 \|-style
E 7
I 7
.Xr bad144 8
type of
E 7
bad-sector forwarding,
D 5
space is left in the last partition on the disk
E 4
for a bad sector forwarding table.  The space reserved
E 5
I 5
space is normally left in the last partition on the disk
for a bad sector forwarding table, although this space
is not reflected in the tables produced.  The space reserved
E 5
is one track for the replicated copies of the table and
sufficient tracks to hold a pool of 126 sectors to which bad sectors
are mapped.  For more information, see 
D 7
.IR bad144 (8).
I 5
The size of the disk may be limited with the
.B \-s
option, specifying the amount of the disk to be used.
This option is intended for other controllers that reserve some space at the end
E 7
I 7
.Xr bad144 8 .
The
.Fl s
option is intended for other controllers which reserve some space at the end
E 7
of the disk for bad-sector replacements or other control areas,
even if not a multiple of cylinders.
E 5
D 7
.PP
E 7
I 7
.Pp
E 7
The disk partition sizes are based on the total amount of
D 4
space on the disk as give in the table below (all values
E 4
I 4
space on the disk as given in the table below (all values
E 4
D 5
are supplied in units of 512 byte sectors).  The `c' partition
E 5
I 5
D 7
are supplied in units of sectors).  The `c' partition
E 7
I 7
are supplied in units of sectors).  The
.Ql c
partition
E 7
E 5
D 4
is, by convention, used to access the entire physical disk, including
the space reserved for the bad sector forwarding table.
E 4
I 4
is, by convention, used to access the entire physical disk.
The device driver tables include
D 7
the space reserved for the bad sector forwarding table in the `c' partition;
E 7
I 7
the space reserved for the bad sector forwarding table in the
.Ql c
partition;
E 7
those used in the disktab and default formats exclude reserved tracks.
E 4
D 7
In normal operation, either the `g' partition is used, or the
`d', `e', and `f' partitions are used.  The `g' and `f' partitions
E 7
I 7
In normal operation, either the
.Ql g
partition is used, or the
.Ql d ,
.Ql e ,
and
.Ql f
partitions are used.  The
.Ql g
and
.Ql f
partitions
E 7
D 4
are variable sized, occupying whatever space remains after allocation
E 4
I 4
are variable-sized, occupying whatever space remains after allocation
E 4
of the fixed sized partitions.
If the disk is smaller than 20 Megabytes, then
D 7
.I diskpart
aborts with the message ``disk too small, calculate by hand''.
.in +0.5i
.nf

.ta \w'Partition  'u +\w'20-60 MB  'u +\w'61-205 MB  'u +\w'206-355 MB  'u +\w'356+ MB'u
E 7
I 7
.Nm diskpart
aborts with the message
.Dq Li disk too small, calculate by hand .
.Bl -column Partition 20-60\ MB 61-205\ MB 206-355\ MB 356+\ MB
E 7
Partition	20-60 MB	61-205 MB	206-355 MB	356+ MB
a	15884	15884	15884	15884
b	10032	33440	33440	66880
d	15884	15884	15884	15884
e	unused	55936	55936	307200
h	unused	unused	291346	291346
D 7

.fi
.in -0.5i
.PP
E 7
I 7
.El
.Pp
E 7
If an unknown disk type is specified, 
D 7
.I diskpart
E 7
I 7
.Nm diskpart
E 7
will prompt for the required disk geometry information.
D 7
.SH SEE ALSO
disktab(5),
bad144(8)
.SH BUGS
E 7
I 7
.Sh SEE ALSO
.Xr disktab 5 ,
.Xr bad144 8
.Sh BUGS
E 7
D 5
Certain default partition sizes are based on historical artifacts
E 5
I 5
Most default partition sizes are based on historical artifacts
E 5
D 7
(e.g. RP06), and may result in unsatisfactory layouts.
.PP
When using the \-d flag, alternate disk names are not included
E 7
I 7
(like the RP06), and may result in unsatisfactory layouts.
.Pp
When using the
.Fl d
flag, alternate disk names are not included
E 7
in the output.
I 7
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.2 .
E 7
D 3
.PP
Does not understand how to handle drives attached to a UDA50.
E 3
E 1
