sbin/mount_union/SCCS/s.mount_union.8
h59432
s 00000/00003/00175
d D 8.7 95/05/01 21:51:36 mckusick 7 6
c mount_lofs is gone
e
s 00018/00032/00160
d D 8.6 94/03/27 12:32:37 bostic 6 5
c replace -above, -below, -replace with -b, -r, (-above was the
c default)
e
s 00024/00008/00168
d D 8.5 94/03/27 11:57:31 bostic 5 4
c Jan-Simon Pendry's and my new mount code
e
s 00006/00005/00170
d D 8.4 94/03/05 11:10:14 pendry 4 3
c minor cleanups
e
s 00001/00001/00174
d D 8.3 94/02/17 11:34:39 pendry 3 2
c formatting typo
e
s 00028/00026/00147
d D 8.2 94/02/16 15:58:58 pendry 2 1
c reword
e
s 00173/00000/00000
d D 8.1 94/02/11 19:20:27 pendry 1 0
c date and time created 94/02/11 19:20:27 by pendry
e
u
U
t
T
I 1
D 5
.\" Copyright (c) 1994 The Regents of the University of California.
.\" All rights reserved.
E 5
I 5
.\" Copyright (c) 1994
.\" The Regents of the University of California.  All rights reserved.
E 5
.\" 
.\" This code is derived from software donated to Berkeley by
.\" Jan-Simon Pendry.
.\"
.\" %sccs.include.redist.roff%
.\"
.\"	%W% (Berkeley) %G%
.\"
.Dd %Q%
.Dt MOUNT_UNION 8
.Os BSD 4.4
.Sh NAME
.Nm mount_union
.Nd mount union filesystems
.Sh SYNOPSIS
.Nm mount_union
I 6
.Op Fl br
E 6
I 5
.Op Fl o Ar options
E 5
D 6
.Op Fl above
.Op Fl below
.Op Fl replace
E 6
D 5
.Ar directory uniondir
E 5
I 5
.Ar directory
.Ar uniondir
E 5
.Sh DESCRIPTION
The
.Nm mount_union
command
attaches
.Ar directory
D 2
(called the
.Em upper
layer)
E 2
above
.Ar uniondir
D 2
(called the
E 2
I 2
in such a way that the contents of both directory trees remain visible.
By default,
.Ar directory
becomes the
.Em upper
layer and
.Ar uniondir
becomes the
E 2
.Em lower
D 2
layer)
in such a way that the contents of both directories are remain visible.
E 2
I 2
layer.
E 2
D 5
.Nm mount_union
is setuid root and can be used by any user.
D 2
The kernel enforces security by only allow attempts to mount
onto a directory to which the current user has write permission.
E 2
I 2
To enforce filesystem security, the user must be superuser or else
D 4
have write permission on the mounted on directory.
E 4
I 4
have write permission on the mounted-on directory.
E 5
E 4
E 2
.Pp
I 5
The options are as follows:
.Bl -tag -width indent
I 6
.It Fl b
Invert the default position, so that
.Ar directory
becomes the lower layer and
.Ar uniondir
becomes the upper layer.
However,
.Ar uniondir
remains the mount point.
E 6
.It Fl o
Options are specified with a
.Fl o
flag followed by a comma separated string of options.
See the
.Xr mount 8
man page for possible options and their meanings.
I 6
.It Fl r
Hide the lower layer completely in the same way as mounting with
D 7
.Xr mount_lofs 8
or
E 7
.Xr mount_null 8 .
E 6
.El
.Pp
To enforce filesystem security, the user mounting the filesystem
must be superuser or else have write permission on the mounted-on
directory.
.Pp
E 5
D 2
Once the mount is complete, the lower layer becomes read-only
when accessed via
.Ar uniondir .
The union operation applies recursively down the directory tree
now rooted at
.Em uniondir .
This differs from the
.Em union
option to
.Xr mount 8
which only applies the union operation to the mount point itself,
and then only for lookups.
.Pp
E 2
D 4
Filenames are looked up firstly in the upper layer and then in the
E 4
I 4
Filenames are looked up in the upper layer and then in the
E 4
lower layer.
If a directory is found in the lower layer, and there is no entry
in the upper layer, then a
.Em shadow
directory will be created in the upper layer.
It will be owned by the user who originally did the union mount,
D 5
with mode 0777 modified by the umask in effect at that time.
E 5
I 5
with mode
.Dq rwxrwxrwx
(0777) modified by the umask in effect at that time.
E 5
.Pp
If a file exists in the upper layer then there is no way to access
a file with the same name in the lower layer.
If necessary, a combination of loopback and union mounts can be made
which will still allow the lower files to be accessed by a different
pathname.
.Pp
Except in the case of a directory,
access to an object is granted via the normal filesystem access checks.
For directories, the current user must have access to both the upper
and lower directories (should they both exist).
.Pp
Requests to create or modify objects in
.Ar uniondir
are passed to the upper layer with the exception of a few special cases.
An attempt to open for writing a file which exists in the lower layer
causes a copy of the
.Em entire
file to be made to the upper layer, and then for the upper layer copy
to be opened.
Similarly, an attempt to truncate a lower layer file to zero length
causes an empty file to be created in the upper layer.
I 2
Any other operation which would ultimately require modification to
the lower layer fails with
.Dv EROFS .
E 2
.Pp
D 2
The union filesystem actually deals with namespace, rather than
E 2
I 2
The union filesystem manipulates the namespace, rather than
E 2
individual filesystems.
D 2
This means that any filesystems which are mounted under
E 2
I 2
The union operation applies recursively down the directory tree
now rooted at
D 3
.Em uniondir .
E 3
I 3
.Ar uniondir .
I 4
Thus any filesystems which are mounted under
.Ar uniondir
will take part in the union operation.
E 4
E 3
This differs from the
.Em union
option to
.Xr mount 8
which only applies the union operation to the mount point itself,
and then only for lookups.
D 4
This also means that any filesystems which are mounted under
E 2
.Ar uniondir
will take part in the union operation.
E 4
D 2
.Pp
E 2
I 2
D 6
.Sh OPTIONS
E 2
The options are:
.Bl -tag -width indent
.It Fl above
This is the default mode of operation, where
.Ar directory
becomes the upper layer,
and
.Ar uniondir
becomes the lower layer.
.It Fl below
This inverts the sense of
.Fl above
such that
.Ar directory
becomes the lower layer and
.Ar uniondir
becomes the upper layer.
.Ar uniondir
D 2
is still the mount point.
E 2
I 2
remains the mount point.
E 2
.It Fl replace
This simply hides the lower layer completely in
the same way as mounting with
.Xr mount_lofs 8
or
.Xr mount_null 8 .
E 6
.Sh EXAMPLES
The commands
.Bd -literal -offset indent
D 2
mount -t iso9660 -o ro /dev/cd0a /usr/src
E 2
I 2
mount -t cd9660 -o ro /dev/cd0a /usr/src
E 2
D 6
mount -t union -o -above /var/obj /usr/src
E 6
I 6
mount -t union -o /var/obj /usr/src
E 6
.Ed
.Pp
mount the CD-ROM drive
.Pa /dev/cd0a
on
.Pa /usr/src
and then attaches
.Pa /var/obj
on top.
For most purposes the effect of this is to make the
source tree appear writable
even though it is stored on a CD-ROM.
.Pp
The command
.Bd -literal -offset indent
D 6
mount -t union -o -below /sys $HOME/sys
E 6
I 6
mount -t union -o -b /sys $HOME/sys
E 6
.Ed
.Pp
attaches the system source tree below the
.Pa sys
directory in the user's home directory.
This allows individual users to make private changes
to the source, and build new kernels, without those
changes becoming visible to other users.
Note that the files in the lower layer remain
accessible via
.Pa /sys .
.Sh SEE ALSO
I 4
.Xr intro 2 ,
E 4
.Xr mount 2 ,
.Xr unmount 2 ,
.Xr fstab 5 ,
I 5
.Xr mount 8 ,
E 5
D 7
.Xr mount_lofs 8 ,
E 7
.Xr mount_null 8
.Sh BUGS
Without whiteout support from the filesystem backing the upper layer,
there is no way that delete and rename operations on lower layer
objects can be done.
.Dv EROFS
is returned for this kind of operations along with any others
D 6
which would make modifictions to the lower layer, such as
E 6
I 6
which would make modifications to the lower layer, such as
E 6
.Xr chmod 1 .
.Pp
Running
.Xr find 1
over a union tree has the side-effect of creating
a tree of shadow directories in the upper layer.
.Sh HISTORY
The
.Nm mount_union
command first appeared in
.Bx 4.4 .
E 1
