usr.sbin/pstat/SCCS/s.pstat.8
h50038
s 00000/00001/00294
d D 8.5 94/05/13 16:15:12 mckusick 17 16
c delete spurious header
e
s 00001/00001/00294
d D 8.4 94/04/19 08:43:39 bostic 16 15
c spelling
e
s 00002/00002/00293
d D 8.3 94/04/18 07:13:07 bostic 15 14
c typo
e
s 00033/00024/00262
d D 8.2 94/02/10 23:05:11 pendry 14 13
c update section which describes -v option
e
s 00002/00002/00284
d D 8.1 93/06/06 14:03:58 bostic 13 12
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00123/00279/00163
d D 6.10 93/06/05 16:58:05 mckusick 12 11
c update to reflect current program
e
s 00343/00314/00099
d D 6.9 93/06/01 23:42:40 mckusick 11 10
c rewrite, convert to new macro package
e
s 00004/00003/00409
d D 6.8 93/04/26 10:30:14 bostic 10 9
c typo
e
s 00043/00012/00369
d D 6.7 91/06/26 14:01:49 marc 9 8
c document -v
e
s 00001/00001/00380
d D 6.6 90/06/24 22:28:36 trent 8 7
c new pathname (pstat)
e
s 00000/00002/00381
d D 6.5 89/08/15 16:43:59 mckusick 7 6
c PGRP is no longer in the proc structure
e
s 00009/00009/00374
d D 6.4 89/08/10 17:55:40 mckusick 6 5
c update for vnodes
e
s 00023/00007/00360
d D 6.3 86/05/24 09:50:15 karels 5 4
c more updates
e
s 00042/00043/00325
d D 6.2 86/05/18 01:00:37 lepreau 4 3
c bring up to date with source. A couple descriptions maybe need fixing
e
s 00001/00001/00367
d D 6.1 85/04/27 13:39:51 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00047/00031/00321
d D 5.1 85/04/27 13:39:12 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00352/00000/00000
d D 4.1 85/04/27 13:38:48 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
D 11
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 11
I 11
D 13
.\" Copyright (c) 1980, 1991 Regents of the University of California.
.\" All rights reserved.
E 13
I 13
D 15
.\" Copyright (c) 1980, 1991, 1993
E 15
I 15
.\" Copyright (c) 1980, 1991, 1993, 1994
E 15
.\"	The Regents of the University of California.  All rights reserved.
E 13
E 11
.\"
D 17
.\"	%W% (Berkeley) %G%
E 17
I 11
.\" %sccs.include.redist.man%
E 11
.\"
D 2
.TH PSTAT 8 4/1/81
E 2
I 2
D 3
.TH PSTAT 8 4/1/83
E 3
I 3
D 11
.TH PSTAT 8 "%Q%"
E 3
E 2
.UC 4
.SH NAME
D 9
pstat \- print system facts
E 9
I 9
pstat \- display system data structures
E 9
.SH SYNOPSIS
D 8
.B /etc/pstat
E 8
I 8
.B pstat
E 8
D 2
[
E 2
D 9
.B \-aixptufT
E 9
D 2
] [ suboptions ]
[ file ]
E 2
I 2
[
D 9
.B suboptions
E 9
I 9
.B \-Tpfvtsxn
E 9
] [
I 9
.B \-U
.I pid
] [
E 9
.B system
] [
.B corefile
]
E 2
.SH DESCRIPTION
.I Pstat
E 11
I 11
.\"     %W% (Berkeley) %G%
.\"
.Dd %Q%
.Dt PSTAT 8
.Os BSD 4
.Sh NAME
.Nm pstat
.Nd display system data structures
.Sh SYNOPSIS
.Nm pstat
D 12
.Op Fl Tfnpstvx
.Op Fl U Ar pid
.Op Ar system
.Op Ar corefile
E 12
I 12
.Op Fl Tfnstv
.Op Fl M Ar core
.Op Fl N Ar system
E 12
.Sh DESCRIPTION
.Nm Pstat
E 11
D 9
interprets the contents of certain system tables.
E 9
I 9
D 12
displays certain system data structures.
E 12
I 12
displays open file entry, swap space utilization,
terminal state, and vnode data structures.
E 12
E 9
If
D 2
.I file
E 2
I 2
D 11
.I corefile
E 11
I 11
.Ar corefile
E 11
E 2
D 9
is given, the tables are sought there, otherwise
E 9
I 9
is given, the information is sought there, otherwise
E 9
in
D 11
.I /dev/kmem.
E 11
I 11
.Pa /dev/kmem .
E 11
The required namelist is taken from
D 2
.I /vmunix.
E 2
I 2
D 11
.I /vmunix
E 11
I 11
.Pa /vmunix
E 11
unless 
D 11
.I system
E 11
I 11
.Ar system
E 11
is specified.
I 12
The
.Fl n
option specifies that devices should be printed out by major/minor
number rather than by name.
.Pp
E 12
E 2
Options are
D 9
.TP \w'WCHAN\ 'u
.B \-a
Under
.BR \-p ,
describe all process slots rather than just active ones.
E 9
I 9
D 11
.\" ??? .TP \w'WCHAN\ 'u
E 9
.TP
D 9
.B \-i
Print the inode table with the these headings:
E 9
I 9
.B \-v
Print the active vnodes.  Each group of vnodes coresponding
to a particular filesystem is preceded by a two line header.  The
first line consists of the following:
.sp
*** MOUNT \fIfstype from \fPon \fIon fsflags\fP
.sp
where \fIfstype\fP is one of \fBufs, nfs, mfs, or pc\fP; \fIfrom\fP
is the filesystem is mounted from; \fIon\fP is the directory
the filesystem is mounted on; and \fIfsflags\fP is a list
of optional flags applied to the mount (see
D 10
.IR mount (8)).  The second line is a header for the individual fields,
the first part of which are fixed, and the second part are filesystem
type specific.  The headers common to all vnodes are:
E 10
I 10
.IR mount (8)).
The second line is a header for the individual fields, the first part
of which are fixed, and the second part are filesystem type specific.
The headers common to all vnodes are:
E 10
.IP ADDR
Location of this vnode.
.IP TYP
File type.
.IP VFLAG
A list of letters representing vnode flags:
.nf
.sp
R - VROOT
T - VTEXT
L - VXLOCK
W - VXWANT
E - VEXLOCK
S - VSHLOCK
T - VLWAIT
A - VALIASED
B - VBWAIT
.sp
**** WAS HERE *****
.fi
Next
E 9
.IP LOC
E 11
I 11
D 12
.Tw 5n
.Tl Fl T
E 12
I 12
.Bl -tag -width indent
.It Fl T
E 12
Prints the number of used and free slots in the several system tables
D 12
and is useful for checking to see how full system tables have become if the
system is under heavy load.
.Tl Fl f
E 12
I 12
and is useful for checking to see how large system tables have become
if the system is under heavy load.
.It Fl f
E 12
Print the open file table with these headings:
D 12
.Tt 0 1 0 OFFSET
.Tl LOC
E 12
I 12
.Bl -tag -width indent
.It LOC
E 12
E 11
The core location of this table entry.
D 11
.PD 0
.IP FLAGS
E 11
I 11
D 12
.Tl TYPE
E 12
I 12
.It TYPE
E 12
The type of object the file table entry points to.
D 12
.Tl FLG
E 12
I 12
.It FLG
E 12
E 11
Miscellaneous state variables encoded thus:
D 11
.RS
.IP L
locked
.IP U
update time
D 2
.IR (filsys (5))
E 2
I 2
.RI ( fs (5))
E 2
must be corrected
.IP A
access time must be corrected
D 6
.IP M
file system is mounted here
E 6
.IP W
wanted by another process (L flag is on)
D 6
.IP T
contains a text file
E 6
.IP C
changed time must be corrected
I 2
.IP S
shared lock applied
.IP E
exclusive lock applied
.IP Z
D 5
someone waiting for an exclusive lock
E 5
I 5
someone waiting for a lock
I 6
.IP M
contains modifications
.IP R
has a rename in progress
E 6
E 5
E 2
.RE
.IP CNT
Number of open file table entries for this inode.
.IP DEV
Major and minor device number of file system in which
this inode resides.
I 2
.IP RDC
Reference count of shared locks on the inode.
.IP WRC
Reference count of exclusive locks on the inode (this may
be > 1 if, for example, a file descriptor is inherited across a fork).
E 2
.IP INO
I-number within the device.
.IP MODE
Mode bits, see
.IR chmod (2).
.IP NLK
Number of links to this inode.
.IP UID
User ID of owner.
.IP SIZ/DEV
Number of bytes in an ordinary file, or
major and minor device of special file.
.PD
.TP
.B \-x
Print the text table with these headings:
.IP LOC
The core location of this table entry.
.PD 0
.IP FLAGS
Miscellaneous state variables encoded thus:
.RS
.IP T
.IR ptrace (2)
in effect
.IP W
text not yet written on swap device
.IP L
loading in progress
.IP K
locked
.IP w
wanted (L flag is on)
.IP P
D 6
resulted from demand-page-from-inode exec format (see
E 6
I 6
resulted from demand-page-from-vnode exec format (see
E 6
D 2
.IR exec (2))
E 2
I 2
.IR execve (2))
E 2
.RE
.PD
.IP DADDR
Disk address in swap, measured in multiples of 512 bytes.
.IP CADDR
Head of a linked list of loaded processes using this text segment.
I 4
.IP RSS
Size of resident text, measured in multiples of 512 bytes.
E 4
.IP SIZE
Size of text segment, measured in multiples of 512 bytes.
D 6
.IP IPTR
Core location of corresponding inode.
E 6
I 6
.IP VPTR
Core location of corresponding vnode.
E 6
.IP CNT
Number of processes using this text segment.
.IP CCNT
Number of processes in core using this text segment.
I 4
.IP FORW
Forward link in free list.
.IP BACK
Backward link in free list.
E 4
.PD
.TP
.B \-p
E 11
I 11
D 12
.Tt 0 1 4n 4n
.Tl R
E 12
I 12
.Bl -tag -width indent
.It R
E 12
open for reading
D 12
.Tl W
E 12
I 12
.It W
E 12
open for writing
D 12
.Tl A
E 12
I 12
.It A
E 12
open for appending
D 12
.Tl S
E 12
I 12
.It S
E 12
shared lock present
D 12
.Tl X
E 12
I 12
.It X
E 12
exclusive lock present
D 12
.Tl I
E 12
I 12
.It I
E 12
signal pgrp when data ready
D 12
.Tl
.Tl CNT
E 12
I 12
.El
.It CNT
E 12
Number of processes that know this open file.
D 12
.Tl MSG
E 12
I 12
.It MSG
E 12
Number of messages outstanding for this file.
D 12
.Tl DATA
E 12
I 12
.It DATA
E 12
The location of the vnode table entry or socket structure for this file.
D 12
.Tl OFFSET
E 12
I 12
.It OFFSET
E 12
The file offset (see
.Xr lseek 2 ) .
D 12
.Tl
.Tl Fl p
E 11
Print process table for active processes with these headings:
D 11
.IP LOC
E 11
I 11
.Tt 0 1 0 TEXTP
.Tl LOC
E 11
The core location of this table entry.
D 11
.PD 0
.IP S
E 11
I 11
.Tl S
E 11
Run state encoded thus:
D 11
.RS
.IP 0
E 11
I 11
.Tt 0 1 4n 4n
.Tl 0
E 11
no process
D 11
.IP 1
E 11
I 11
.Tl 1
E 11
waiting for some event
D 11
.IP 3
E 11
I 11
.Tl 3
E 11
runnable
D 11
.IP 4
E 11
I 11
.Tl 4
E 11
being created
D 11
.IP 5
E 11
I 11
.Tl 5
E 11
being terminated
D 11
.IP 6
D 5
stopped under trace
E 5
I 5
stopped (by signal or  under trace)
E 5
.RE
.IP F
E 11
I 11
.Tl 6
stopped (by signal or under trace)
.Tl
.Tl F
E 11
D 5
Miscellaneous state variables, or-ed together (hexadecimal):
E 5
I 5
Miscellaneous state variables, or'ed together (hexadecimal):
E 5
D 11
.RS
D 4
.IP 000001 9n
E 4
I 4
.IP 0001 9n
E 11
I 11
.Tt 0 1 4n 1000000xx
.Tl 0001
E 11
E 4
loaded
D 4
.IP 000002
E 4
I 4
D 11
.IP 0002
E 11
I 11
.Tl 0002
E 11
E 4
the scheduler process
D 4
.IP 000004
E 4
I 4
D 11
.IP 0004
E 11
I 11
.Tl 0004
E 11
E 4
locked for swap out
D 4
.IP 000008
E 4
I 4
D 11
.IP 0008
E 11
I 11
.Tl 0008
E 11
E 4
swapped out
D 4
.IP 000010
E 4
I 4
D 11
.IP 0010
E 11
I 11
.Tl 0010
E 11
E 4
traced
D 4
.IP 000020
E 4
I 4
D 11
.IP 0020
E 11
I 11
.Tl 0020
E 11
E 4
used in tracing
D 2
.IP 000040
locked in by
.IR lock (2).
E 2
I 2
D 11
.	\".IP 000040
.	\"locked in by
.	\".IR lock (2).
E 2
D 4
.IP 000080
E 4
I 4
.IP 0080
E 11
I 11
.       \".Tl 000040
.       \"locked in by
.       \".Xr lock 2 .
.Tl 0080
E 11
E 4
in page-wait
D 4
.IP 000100
E 4
I 4
D 11
.IP 0100
E 11
I 11
.Tl 0100
E 11
E 4
prevented from swapping during
D 11
.IR fork (2)
D 4
.IP 000200
gathering pages for raw i/o
.IP 000400
E 4
I 4
.IP 0200
E 11
I 11
.Xr fork 2
.Tl 0200
E 11
will restore old mask after taking signal
D 11
.IP 0400
E 11
I 11
.Tl 0400
E 11
E 4
exiting
D 4
.IP 001000
E 4
I 4
D 11
.IP 0800
E 11
I 11
.Tl 0800
E 11
D 5
doing physical i/o (bio.c)
E 5
I 5
doing physical I/O (bio.c)
E 5
D 11
.IP 1000
E 11
I 11
.Tl 1000
E 11
E 4
process resulted from a
D 11
.IR vfork (2)
E 11
I 11
.Xr vfork 2
E 11
which is not yet complete
D 4
.IP 002000
E 4
I 4
D 11
.IP 2000
E 11
I 11
.Tl 2000
E 11
E 4
another flag for
D 11
.IR vfork (2)
D 4
.IP 004000
E 4
I 4
.IP 4000
E 11
I 11
.Xr vfork 2
.Tl 4000
E 11
E 4
process has no virtual memory, as it is a parent in the context of
D 11
.IR vfork (2)
D 4
.IP 008000
E 4
I 4
.IP 8000
E 11
I 11
.Xr vfork 2
.Tl 8000
E 11
E 4
D 6
process is demand paging data pages from its text inode.
E 6
I 6
process is demand paging data pages from its text vnode.
E 6
I 5
D 11
.IP 10000
E 11
I 11
.Tl 10000
E 11
process using sequential VM patterns
D 11
.IP 20000
E 11
I 11
.Tl 20000
E 11
process using random VM patterns
D 11
.IP 100000
E 11
I 11
.Tl 100000
E 11
using old 4.1-compatible signal semantics
D 11
.IP 200000
E 11
I 11
.Tl 200000
E 11
process needs profiling tick
D 11
.IP 400000
E 11
I 11
.Tl 400000
E 11
process is scanning descriptors during select
D 11
.IP 1000000
E 11
I 11
.Tl 1000000
E 11
process page tables have changed
E 5
D 4
.IP 010000
process has advised of anomalous behavior with
.IR vadvise (2).
.IP 020000
process has advised of sequential behavior with
.IR vadvise (2).
.IP 040000
process is in a sleep which will timeout.
.IP 080000
a parent of this process has exited and this process
is now considered detached.
.IP 100000
D 2
process used some new signal primitives, i.e.
.IR sigset (3);
more system calls will restart.
E 2
I 2
process used 4.1BSD compatibility mode signal primitives,
no system calls will restart.
E 2
.IP 200000
process is owed a profiling tick.
E 4
D 11
.RE
.IP POIP
E 11
I 11
.Tl
.Tl POIP
E 11
number of pages currently being pushed out from this process.
D 11
.IP PRI
E 11
I 11
.Tl PRI
E 11
Scheduling priority, see
D 2
.IR nice (2).
E 2
I 2
D 11
.IR setpriority (2).
E 2
D 4
.IP SIGNAL
E 4
I 4
.IP SIG
E 11
I 11
.Xr setpriority 2 .
.Tl SIG
E 11
E 4
Signals received (signals 1-32 coded in bits 0-31),
D 11
.IP UID
E 11
I 11
.Tl UID
E 11
Real user ID.
D 11
.IP SLP
E 11
I 11
.Tl SLP
E 11
Amount of time process has been blocked.
D 11
.IP TIM
E 11
I 11
.Tl TIM
E 11
Time resident in seconds; times over 127 coded as 127.
D 11
.IP CPU
E 11
I 11
.Tl CPU
E 11
Weighted integral of CPU time, for scheduler.
D 11
.IP NI
E 11
I 11
.Tl NI
E 11
Nice level,
see
D 2
.IR nice (2).
E 2
I 2
D 11
.IR setpriority (2).
E 2
D 7
.IP PGRP
D 5
Process number of root of process group
(the opener of the controlling terminal).
E 5
I 5
Process number of root of process group.
E 7
E 5
.IP PID
E 11
I 11
.Xr setpriority 2 .
.Tl PID
E 11
The process ID number.
D 11
.IP PPID
E 11
I 11
.Tl PPID
E 11
The process ID of parent process.
D 11
.IP ADDR
E 11
I 11
.Tl ADDR
E 11
If in core, the page frame number of the first page of the `u-area' of
the process.
If swapped out, the position in the swap area
measured in multiples of 512 bytes.
D 11
.IP RSS
E 11
I 11
.Tl RSS
E 11
Resident set size \- the number of physical page frames allocated
to this process.
D 11
.IP SRSS
E 11
I 11
.Tl SRSS
E 11
RSS at last swap (0 if never swapped).
D 11
.IP SIZE
E 11
I 11
.Tl SIZE
E 11
Virtual size of process image (data+stack) in multiples of 512 bytes.
D 11
.IP WCHAN
E 11
I 11
.Tl WCHAN
E 11
Wait channel number of a waiting process.
D 11
.IP LINK
E 11
I 11
.Tl LINK
E 11
Link pointer in list of runnable processes.
D 11
.IP TEXTP
E 11
I 11
.Tl TEXTP
E 11
If text is pure, pointer to location of text table entry.
D 4
.IP CLKT
D 2
Countdown for
.IR alarm (2)
measured in seconds.
E 2
I 2
Countdown for real interval timer,
.IR setitimer (2)
measured in clock ticks (10 milliseconds).
E 4
E 2
D 11
.PD
.TP
.B \-t
E 11
I 11
.Tl
.Tl Fl s
Print information about swap space usage: the number of (1k byte) pages used
and free is given as well as the number of used pages which belong
to text images.
.Tl Fl t
E 12
I 12
.El
.It Fl s
Print information about swap space usage on all the 
swap areas compiled into the kernel.
The first column is the device name of the partition.  The next column is
the total space available in the partition.  The 
.Ar Used
column indicates the total blocks used so far;  the 
.Ar Available
column indicates how much space is remaining on each partition.
The
.Ar Capacity
reports the percentage of space used.
.Pp
If more than one partition is configured into the system, totals for all
of the statistics will be reported in the final line of the report.
.It Fl t
E 12
E 11
Print table for terminals
with these headings:
D 11
.IP RAW
E 11
I 11
D 12
.Tt 0 1 0 STATE
.Tl RAW
E 12
I 12
.Bl -tag -width indent
.It RAW
E 12
E 11
Number of characters in raw input queue.
D 11
.PD 0
.IP CAN
E 11
I 11
D 12
.Tl CAN
E 12
I 12
.It CAN
E 12
E 11
Number of characters in canonicalized input queue.
D 11
.IP OUT
E 11
I 11
D 12
.Tl OUT
E 12
I 12
.It OUT
E 12
E 11
Number of characters in putput queue.
D 11
.IP MODE
E 11
I 11
D 12
.Tl MODE
E 12
I 12
.It MODE
E 12
E 11
See
D 11
.IR tty (4).
.IP ADDR
E 11
I 11
.Xr tty 4 .
D 12
.Tl ADDR
E 12
I 12
.It ADDR
E 12
E 11
Physical device address.
D 11
.IP DEL
E 11
I 11
D 12
.Tl DEL
E 12
I 12
.It DEL
E 12
E 11
Number of delimiters (newlines) in canonicalized input queue.
D 11
.IP COL
E 11
I 11
D 12
.Tl COL
E 12
I 12
.It COL
E 12
E 11
Calculated column position of terminal.
D 11
.IP STATE
E 11
I 11
D 12
.Tl STATE
E 12
I 12
.It STATE
E 12
E 11
Miscellaneous state variables encoded thus:
D 11
.RS
I 4
.IP T
E 11
I 11
D 12
.Tt 0 1 4n 4n
.Tl T
E 12
I 12
.Bl -tag -width indent
.It T
E 12
E 11
delay timeout in progress
E 4
D 11
.IP W
E 11
I 11
D 12
.Tl W
E 12
I 12
.It W
E 12
E 11
waiting for open to complete
D 11
.IP O
E 11
I 11
D 12
.Tl O
E 12
I 12
.It O
E 12
E 11
open
D 4
.IP S
has special (output) start routine
E 4
I 4
D 11
.IP F
E 11
I 11
D 12
.Tl F
E 12
I 12
.It F
E 12
E 11
outq has been flushed during DMA
E 4
D 11
.IP C
E 11
I 11
D 12
.Tl C
E 12
I 12
.It C
E 12
E 11
carrier is on
D 11
.IP B
E 11
I 11
D 12
.Tl B
E 12
I 12
.It B
E 12
E 11
busy doing output
D 11
.IP A
E 11
I 11
D 12
.Tl A
E 12
I 12
.It A
E 12
E 11
process is awaiting output
D 11
.IP X
E 11
I 11
D 12
.Tl X
E 12
I 12
.It X
E 12
E 11
open for exclusive use
I 4
D 11
.IP S
E 11
I 11
D 12
.Tl S
E 12
I 12
.It S
E 12
E 11
output stopped
E 4
D 11
.IP H
E 11
I 11
D 12
.Tl H
E 12
I 12
.It H
E 12
E 11
hangup on close
D 11
.RE
.IP PGRP
E 11
I 11
D 12
.Tl
.Tl PGRP
E 12
I 12
.El
.It PGRP
E 12
E 11
Process group for which this is controlling terminal.
D 11
.IP DISC
Line discipline; blank is old tty OTTYDISC or ``new tty'' for NTTYDISC
or ``net'' for NETLDISC (see
.IR bk (4)).
.PD
.TP
.B \-u
E 11
I 11
D 12
.Tl DISC
E 12
I 12
.It DISC
E 12
Line discipline; blank is old tty
OTTYDISC
or
.Ql new tty
for
NTTYDISC
or
.Ql net
for
NETLDISC
(see
.Xr bk 4 ) .
D 12
.Tl
.Tl Fl u
E 11
print information about a user process;
the next argument is its address as given
by
D 11
.IR ps (1).
E 11
I 11
.Xr ps 1 .
E 11
The process must be in main memory, or the file used can
be a core image and the address 0.
I 5
Only the fields located in the first page cluster can be located
succesfully if the process is in main memory.
E 5
D 11
.TP
.B \-f
Print the open file table with these headings:
.IP LOC
E 11
I 11
.Tl Fl v
E 12
I 12
.El
.It Fl v
E 12
D 15
Print the active vnodes.  Each group of vnodes coresponding
E 15
I 15
Print the active vnodes.  Each group of vnodes corresponding
E 15
to a particular filesystem is preceded by a two line header.  The
first line consists of the following:
.Pp
.Df I
.No *** MOUNT Em fstype from 
on
.Em on fsflags
.De
.Pp
where
.Em fstype
is one of
.Em ufs , nfs , mfs , or pc ;
.Em from
is the filesystem is mounted from;
.Em on
is the directory
the filesystem is mounted on; and
.Em fsflags
is a list
of optional flags applied to the mount (see
.Xr mount 8 ) .
.The second line is a header for the individual fields ,
the first part of which are fixed, and the second part are filesystem
type specific.  The headers common to all vnodes are:
D 12
.\" .Tt 0 1 0 VFLAG
.Tt 0 1 0 SIZ/DEV
.Tl ADDR
E 12
I 12
.Bl -tag -width indent
.It ADDR
E 12
Location of this vnode.
D 12
.Tl TYP
E 12
I 12
.It TYP
E 12
File type.
D 12
.Tl VFLAG
A list of letters representing vnode flags:
E 12
I 12
.It VFLAG
E 12
.Pp
D 12
.Tt 0 1 4n 4n
.Tl R
E 12
I 12
A list of letters representing vnode flags:
.Bl -tag -width indent
.It R
E 12
\- VROOT
D 12
.Tl T
E 12
I 12
.It T
E 12
\- VTEXT
D 12
.Tl L
E 12
I 12
.It L
E 12
\- VXLOCK
D 12
.Tl W
E 12
I 12
.It W
E 12
\- VXWANT
D 12
.Tl E
E 12
I 12
.It E
E 12
\- VEXLOCK
D 12
.Tl S
E 12
I 12
.It S
E 12
\- VSHLOCK
D 12
.Tl T
E 12
I 12
.It T
E 12
\- VLWAIT
D 12
.Tl A
E 12
I 12
.It A
E 12
\- VALIASED
D 12
.Tl B
E 12
I 12
.It B
E 12
\- VBWAIT
D 12
.Tl \&\&
.Tl \&**** WAS HERE *****
.Tl \&Next
.Tl
E 12
I 12
.El
E 12
.Pp
D 12
.Tl LOC
E 12
I 12
D 14
.It LOC
E 12
E 11
The core location of this table entry.
I 2
D 11
.IP TYPE
The type of object the file table entry points to.
E 2
.PD 0
.IP FLG
E 11
I 11
D 12
.Tl FLAGS
E 12
I 12
.It FLAGS
E 12
E 11
Miscellaneous state variables encoded thus:
E 14
I 14
.It USE
The number of references to this vnode.
.It HOLD
The number of I/O buffers held by this vnode.
.It FILEID
The vnode fileid.
In the case of
.Em ufs
this is the inode number.
.It IFLAG
Miscellaneous filesystem specific state variables encoded thus:
E 14
D 11
.RS
.IP R
open for reading
.IP W
open for writing
D 2
.IP P
pipe
E 2
I 2
.IP A
open for appending
I 4
.IP S
shared lock present
.IP X
exclusive lock present
.IP I
signal pgrp when data ready
E 4
E 2
.RE
.IP CNT
Number of processes that know this open file.
D 4
.IP INO
The location of the inode table entry for this file.
D 2
.IP OFFS
The file offset, see
.IR lseek (2).
E 2
I 2
.IP OFFS/SOCK
E 4
I 4
.IP MSG
Number of messages outstanding for this file.
.IP DATA
D 6
The location of the inode table entry or socket structure for this file.
E 6
I 6
The location of the vnode table entry or socket structure for this file.
E 6
.IP OFFSET
E 4
The file offset (see
D 4
.IR lseek (2)),
or the core address of the associated socket structure.
E 4
I 4
.IR lseek (2)).
E 4
E 2
.PD
.PP
.B \-s
print information about swap space usage: the number of (1k byte) pages used
and free is given as well as the number of used pages which belong
to text images.
.PP
.B \-T
prints the number of used and free slots in the several system tables
and is useful for checking to see how full system tables have become if the
system is under heavy load.
D 2
.B \-m
and
.B \-g
flags print the multiplexor tables.  These tables are rather difficult to
explain.  The potential explorer should examine the multiplexor code in
the system.
E 2
.SH FILES
.ta \w'/dev/kmem  'u
/vmunix	namelist
.br
/dev/kmem	default source of tables
.SH SEE ALSO
I 5
iostat(1),
E 5
D 2
ps(1), stat(2), filsys(5)
E 2
I 2
ps(1),
I 5
systat(1),
vmstat(1),
E 5
stat(2),
D 5
fs(5)
E 5
I 5
fs(5),
E 5
E 2
.br
K. Thompson,
.I UNIX Implementation
.SH BUGS
E 11
I 11
D 12
.Tt 0 1 4n 4n
.Tl L
E 12
I 12
.Bl -tag -width indent
I 14
.It "For ufs:"
.Pp
.Bl -tag -width indent
E 14
.It L
E 12
locked
D 12
.Tl U
E 12
I 12
.It U
E 12
update time
.Pq Xr fs 5
must be corrected
D 12
.Tl A
E 12
I 12
.It A
E 12
access time must be corrected
D 12
.Tl W
E 12
I 12
.It W
E 12
wanted by another process (L flag is on)
D 12
.Tl C
E 12
I 12
.It C
E 12
changed time must be corrected
D 12
.Tl S
E 12
I 12
.It S
E 12
shared lock applied
D 12
.Tl E
E 12
I 12
.It E
E 12
exclusive lock applied
D 12
.Tl Z
E 12
I 12
.It Z
E 12
someone waiting for a lock
D 12
.Tl M
E 12
I 12
.It M
E 12
contains modifications
D 12
.Tl R
E 12
I 12
.It R
E 12
has a rename in progress
D 12
.Tl
.Tl CNT
E 12
I 12
.El
D 14
.It CNT
E 12
Number of open file table entries for this inode.
D 12
.Tl DEV
E 12
I 12
.It DEV
E 12
Major and minor device number of file system in which
this inode resides.
D 12
.Tl RDC
E 12
I 12
.It RDC
E 12
Reference count of shared locks on the inode.
D 12
.Tl WRC
E 12
I 12
.It WRC
E 12
Reference count of exclusive locks on the inode (this may
be > 1 if, for example, a file descriptor is inherited across a fork).
D 12
.Tl INO
E 12
I 12
.It INO
E 12
I-number within the device.
D 12
.Tl MODE
E 12
I 12
.It MODE
E 12
Mode bits, see
.Xr chmod 2 .
D 12
.Tl NLK
E 12
I 12
.It NLK
E 12
Number of links to this inode.
D 12
.Tl UID
E 12
I 12
.It UID
E 12
User ID of owner.
D 12
.Tl SIZ/DEV
E 12
I 12
.It SIZ/DEV
E 14
I 14
.It "For nfs:"
.Bl -tag -width indent
.It W
waiting for I/O buffer flush to complete
.It P
I/O buffers being flushed
.It M
locally modified data exists
.It E
an earlier write failed
.It X
D 16
non-cachable lease (nqnfs)
E 16
I 16
non-cacheable lease (nqnfs)
E 16
.It O
write lease (nqnfs)
.It G
lease was evicted (nqnfs)
.El
.El
.It SIZ/RDEV
E 14
E 12
Number of bytes in an ordinary file, or
major and minor device of special file.
D 12
.Tl
.Tl Fl x
Print the text table with these headings:
.Tt 0 1 0 FLAGS
.Tl LOC
The core location of this table entry.
.Tl FLAGS
Miscellaneous state variables encoded thus:
.Tt 0 1 4n 4n
.Tl T
.Xr ptrace 2
in effect
.Tl W
text not yet written on swap device
.Tl L
loading in progress
.Tl K
locked
.Tl w
wanted (L flag is on)
.Tl P
resulted from demand-page-from-vnode exec format (see
.Xr execve 2 )
.Tl
.Tl DADDR
Disk address in swap, measured in multiples of 512 bytes.
.Tl CADDR
Head of a linked list of loaded processes using this text segment.
.Tl RSS
Size of resident text, measured in multiples of 512 bytes.
.Tl SIZE
Size of text segment, measured in multiples of 512 bytes.
.Tl VPTR
Core location of corresponding vnode.
.Tl CNT
Number of processes using this text segment.
.Tl CCNT
Number of processes in core using this text segment.
.Tl FORW
Forward link in free list.
.Tl BACK
Backward link in free list.
.Tl
.Tl
E 12
I 12
.El
.El
E 12
.Sh FILES
D 12
.Tw /dev/kmemxx
.Tl Pa /vmunix
E 12
I 12
.Bl -tag -width /dev/kmemxxx -compact
.It Pa /vmunix
E 12
namelist
D 12
.Tl Pa /dev/kmem
E 12
I 12
.It Pa /dev/kmem
E 12
default source of tables
D 12
.Tl
E 12
I 12
.El
E 12
.Sh SEE ALSO
.Xr iostat 1 ,
.Xr ps 1 ,
.Xr systat 1 ,
.Xr vmstat 1 ,
.Xr stat 2 ,
.Xr fs 5 ,
.Rs
.Rt Tn UNIX Rt Implementation ,
.Ra K. Thompson
.Re
.Sh BUGS
E 11
D 12
It would be very useful if the system recorded \*(lqmaximum occupancy\*(rq
on the tables reported by
D 11
.B \-T;
E 11
I 11
.Fl T ;
E 11
even more useful if these tables were dynamically allocated.
E 12
I 12
Swap statistics are reported for all swap partitions compiled into the kernel,
regardless of whether those partitions are being used.
.Pp
Does not understand NFS swap servers.
E 12
I 11
.Sh HISTORY
The
D 12
.Nm
E 12
I 12
.Nm pstat
E 12
command appeared in 4.0BSD.
E 11
E 1
