usr.bin/uuencode/SCCS/s.uuencode.format.5
h50388
s 00001/00000/00075
d D 8.2 94/01/12 17:22:56 mckusick 10 9
c clarify
e
s 00002/00002/00073
d D 8.1 93/06/06 22:18:00 bostic 9 8
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00003/00003/00072
d D 6.5 91/08/07 00:05:38 cael 8 7
c fix .Os and history
e
s 00039/00020/00036
d D 6.4 91/05/10 14:19:49 cael 7 6
c mdoc version three
e
s 00001/00011/00055
d D 6.3 90/06/23 18:08:03 trent 6 5
c new copyright notice
e
s 00018/00003/00048
d D 6.2 89/04/30 21:51:00 bostic 5 3
c add Berkeley specific copyright
e
s 00000/00000/00051
d R 6.2 86/04/24 22:06:06 mckusick 4 3
c update from rfg
e
s 00001/00001/00050
d D 6.1 85/05/15 18:42:31 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00005/00005/00046
d D 5.1 85/05/15 18:42:10 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00051/00000/00000
d D 4.1 85/05/15 18:41:27 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 5
D 7
.\" Copyright (c) 1989 The Regents of the University of California.
E 7
I 7
D 9
.\" Copyright (c) 1989, 1991 The Regents of the University of California.
E 7
.\" All rights reserved.
E 9
I 9
.\" Copyright (c) 1989, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 9
.\"
D 6
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 6
I 6
D 7
.\" %sccs.include.redist.man%
E 7
I 7
.\" %sccs.include.redist.roff%
E 7
E 6
.\"
E 5
I 1
D 7
.\"	%W% (Berkeley) %G%
E 7
I 7
D 8
.\"     %W% (Berkeley) %G%
E 8
I 8
.\"	%W% (Berkeley) %G%
E 8
E 7
.\"
D 2
.TH UUENCODE 5 6/1/80
E 2
I 2
D 3
.TH UUENCODE 5 "1 June 1980"
E 3
I 3
D 7
.TH UUENCODE 5 "%Q%"
E 3
E 2
.AT 3
.SH NAME
uuencode \- format of an encoded uuencode file
.SH DESCRIPTION
E 7
I 7
.Dd %Q%
.Dt UUENCODE 5
D 8
.Os BSD 4.0
E 8
I 8
.Os BSD 4
E 8
.Sh NAME
.Nm uuencode
.Nd format of an encoded uuencode file
.Sh DESCRIPTION
E 7
Files output by
D 2
.I uuencode(1)
E 2
I 2
D 5
.I uuencode(1C)
E 5
I 5
D 7
.I uuencode(1)
E 7
I 7
.Xr uuencode 1
E 7
E 5
E 2
consist of a header line,
followed by a number of body lines,
and a trailer line.
D 2
.I Uudecode(1)
E 2
I 2
D 5
.I Uudecode(1C)
E 5
I 5
D 7
.I Uudecode(1)
E 7
I 7
The
.Xr uudecode 1
command
E 7
E 5
E 2
will ignore any lines preceding the header or
following the trailer.
Lines preceding a header must not, of course,
look like a header.
D 7
.PP
E 7
I 7
.Pp
E 7
The header line is distinguished by having the first
D 7
6 characters \*(lqbegin\ \*(rq.
E 7
I 7
6 characters
.Dq begin\ \&
I 10
(note the trailing space).
E 10
E 7
The word
D 7
.I begin
E 7
I 7
.Em begin
E 7
is followed by a mode (in octal),
and a string which names the remote file.
A space separates the three items in the header line.
D 7
.PP
E 7
I 7
.Pp
E 7
The body consists of a number of lines, each at most 62 characters
long (including the trailing newline).
These consist of a character count,
followed by encoded characters,
followed by a newline.
The character count is a single printing character,
and represents an integer, the number of bytes
the rest of the line represents.
Such integers are always in the range from 0 to 63 and can
be determined by subtracting the character space (octal 40)
from the character.
D 7
.PP
E 7
I 7
.Pp
E 7
Groups of 3 bytes are stored in 4 characters, 6 bits per character.
All are offset by a space to make the characters printing.
The last line may be shorter than the normal 45 bytes.
If the size is not a multiple of 3, this fact can be determined
by the value of the count on the last line.
Extra garbage will be included to make the character count a multiple
of 4.
The body is terminated by a line with a count of zero.
D 7
This line consists of one ASCII space.
.PP
The trailer line consists of \*(lqend\*(rq on a line by itself.
D 2
.SH SEE\ ALSO
uuencode(1), uudecode(1), uusend(1), uucp(1), mail(1)
E 2
I 2
.SH "SEE ALSO"
D 5
uuencode(1C), uudecode(1C), uusend(1C), uucp(1C), mail(1)
E 5
I 5
uuencode(1), uudecode(1), uusend(1), uucp(1), mail(1)
E 7
I 7
This line consists of one
.Tn ASCII
space.
.Pp
The trailer line consists of
.Dq end
on a line by itself.
.Sh SEE ALSO
.Xr uuencode 1 ,
.Xr uudecode 1 ,
.Xr uusend 1 ,
.Xr uucp 1 ,
.Xr mail 1
.Sh HISTORY
The
D 8
.Nm
E 8
I 8
.Nm uuencode
E 8
file format appeared in
.Bx 4.0 .
.\" It was named uuencode.5 prior to 4.3
E 7
E 5
E 2
E 1
