usr.sbin/sendmail/src/SCCS/s.aliases.5
h56587
s 00001/00001/00079
d D 8.2 93/12/11 23:20:09 mckusick 13 11
c copyediting for Usenix manuals
e
s 00029/00003/00077
d R 8.2 93/12/11 23:16:39 mckusick 12 11
c copyediting for Usenix manuals
e
s 00002/00002/00078
d D 8.1 93/06/16 14:48:01 bostic 11 10
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00008/00006/00072
d D 6.7 93/06/16 12:03:56 bostic 10 8
c update for current reality
e
s 00002/00002/00076
d R 8.1 93/06/07 10:29:08 bostic 9 8
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00000/00000/00078
d D 6.6 92/12/21 16:08:32 eric 8 7
c Release 6
e
s 00054/00034/00024
d D 6.5 91/05/10 13:09:08 cael 7 6
c mdoc version three
e
s 00001/00011/00057
d D 6.4 90/06/23 18:09:03 trent 6 5
c new copyright notice
e
s 00004/00004/00064
d D 6.3 90/06/23 16:42:34 trent 5 4
c changed /usr/lib/aliases to /etc/aliases and /usr/lib/sendmail to /usr/sbin/sendmail
e
s 00014/00003/00054
d D 6.2 88/10/25 15:07:51 bostic 4 3
c add manual pages, correct copyright notices
e
s 00001/00001/00056
d D 6.1 85/05/15 18:18:11 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00028/00028/00029
d D 5.1 85/05/15 18:17:53 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00057/00000/00000
d D 4.1 85/05/15 18:17:33 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
D 4
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 4
I 4
D 7
.\" Copyright (c) 1985 The Regents of the University of California.
E 7
I 7
D 11
.\" Copyright (c) 1985, 1991 The Regents of the University of California.
E 7
.\" All rights reserved.
E 11
I 11
.\" Copyright (c) 1985, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 11
.\"
D 6
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 6
I 6
D 7
.\" %sccs.include.redist.man%
E 7
I 7
.\" %sccs.include.redist.roff%
E 7
E 6
E 4
.\"
D 7
.\"	%W% (Berkeley) %G%
E 7
I 7
.\"     %W% (Berkeley) %G%
E 7
.\"
D 2
.TH ALIASES 5
E 2
I 2
D 3
.TH ALIASES 5 "15 January 1983"
E 3
I 3
D 7
.TH ALIASES 5 "%Q%"
E 3
E 2
.UC 4
.SH NAME
D 2
aliases \- aliases file for delivermail
E 2
I 2
aliases \- aliases file for sendmail
E 2
.SH SYNOPSIS
D 5
.B /usr/lib/aliases
E 5
I 5
.B /etc/aliases
E 5
.SH DESCRIPTION
D 2
This file describes user id aliases
that will be used
by
.I /etc/delivermail.
It is formatted as a series of lines
of the form
E 2
I 2
This file describes user id aliases used by
D 5
.I /usr/lib/sendmail.
E 5
I 5
.I /usr/sbin/sendmail.
E 5
It is formatted as a series of lines of the form
E 2
.in +0.5i
E 7
I 7
.Dd %Q%
.Dt ALIASES 5
.Os BSD 4
.Sh NAME
.Nm aliases
.Nd aliases file for sendmail
.Sh SYNOPSIS
.Nm aliases
.Sh DESCRIPTION
This file describes user
.Tn ID
aliases used by
.Pa /usr/sbin/sendmail .
The file resides in
.Pa /etc
and
is formatted as a series of lines of the form
.Bd -filled -offset indent
E 7
D 2
name:addr1,addr2,...addrn
E 2
I 2
name: name_1, name2, name_3, . . .
E 2
D 7
.in
E 7
I 7
.Ed
.Pp
E 7
The
D 7
.I name
E 7
I 7
.Em name
E 7
D 2
is the name to alias,
and the
.I addri
are the addresses to send the message to.
Lines beginning with white space
are continuation lines.
Lines beginning with `\|#\|'
are comments.
E 2
I 2
is the name to alias, and the
D 7
.I name_n
E 7
I 7
.Em name_n
E 7
are the aliases for that name.
Lines beginning with white space are continuation lines.
D 7
Lines beginning with `\|#\|' are comments.
E 2
.PP
E 7
I 7
Lines beginning with
.Ql #
are comments.
.Pp
E 7
Aliasing occurs only on local names.
D 2
Loops can not occur,
since no message will be sent to any person
more than once.
E 2
I 2
Loops can not occur, since no message will be sent to any person more than once.
D 7
.LP
E 7
I 7
.Pp
E 7
After aliasing has been done, local and valid recipients who have a
D 7
``.forward'' file in their home directory have messages forwarded to the
E 7
I 7
.Dq Pa .forward
file in their home directory have messages forwarded to the
E 7
list of users defined in that file.
E 2
D 7
.PP
E 7
I 7
.Pp
E 7
This is only the raw data file; the actual aliasing information is
D 10
placed into a binary format in the files
D 2
/usr/lib/aliases.dir
E 2
I 2
D 5
.I /usr/lib/aliases.dir
E 5
I 5
D 7
.I /etc/aliases.dir
E 7
I 7
.Pa /etc/aliases.dir
E 7
E 5
E 2
and
D 2
/usr/lib/aliases.pag
E 2
I 2
D 5
.I /usr/lib/aliases.pag
E 5
I 5
D 7
.I /etc/aliases.pag
E 7
I 7
.Pa /etc/aliases.pag
E 10
I 10
placed into a binary format in the file
.Pa /etc/aliases.db
E 10
E 7
E 5
E 2
using the program
D 2
.IR newaliases (5).
E 2
I 2
D 7
.IR newaliases (1).
E 7
I 7
.Xr newaliases 1 .
E 7
E 2
A
D 7
.I newaliases
E 7
I 7
.Xr newaliases
E 7
command should be executed each time the aliases file is changed for the
change to take effect.
D 2
.SH SEE\ ALSO
newaliases(1), dbm(3), delivermail(8)
E 2
I 2
D 7
.SH "SEE  ALSO"
newaliases(1), dbm(3X), sendmail(8)
.br
SENDMAIL Installation and Operation Guide.
.br
SENDMAIL An Internetwork Mail Router.
E 2
.SH BUGS
E 7
I 7
.Sh SEE  ALSO
.Xr newaliases 1 ,
I 10
.Xr dbopen 3 ,
E 10
.Xr dbm 3 ,
.Xr sendmail 8
.Rs
.%T "SENDMAIL Installation and Operation Guide"
.Re
.Rs
.%T "SENDMAIL An Internetwork Mail Router"
.Re
.Sh BUGS
E 7
D 10
Because of restrictions in
E 10
I 10
If you have compiled
.Xr sendmail
with DBM support instead of NEWDB,
D 13
you may have encounter problems in
E 13
I 13
you may have encountered problems in
E 13
E 10
D 2
.IR dbm (3)
E 2
I 2
D 7
.IR dbm (3X)
E 7
I 7
.Xr dbm 3
E 7
E 2
D 10
a single alias cannot contain more than about 1000 bytes of information.
E 10
I 10
restricting a single alias to about 1000 bytes of information.
E 10
D 2
You can get longer aliases by ``chaining''; i.e. make the last name in
the alias by a dummy name which is a continuation alias.
E 2
I 2
You can get longer aliases by ``chaining''; that is, make the last name in
the alias be a dummy name which is a continuation alias.
I 7
.Sh HISTORY
The
.Nm
file format appeared in
.Bx 4.0 .
E 7
E 2
E 1
