libexec/tftpd/SCCS/s.tftpd.8
h05295
s 00002/00002/00078
d D 8.1 93/06/04 19:07:48 bostic 10 9
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00021/00007/00059
d D 6.8 93/02/12 20:29:00 andrew 9 8
c document -l, -n options, relative filename lookup, misc. changes
e
s 00002/00012/00064
d D 6.7 91/05/13 17:36:55 bostic 8 7
c new copyright; att/bsd/shared
e
s 00053/00025/00023
d D 6.6 91/03/16 17:05:41 cael 7 6
c macro and text revision (-mdoc version 3)
e
s 00002/00012/00046
d D 6.5 90/06/24 21:25:36 trent 6 5
c new copyright & pathnames (tftpd)
e
s 00009/00000/00049
d D 6.4 88/10/10 22:24:24 tef 5 4
c restrict directories from which files may be accessed
e
s 00016/00005/00033
d D 6.3 88/09/20 09:49:34 bostic 4 3
c Berkeley copyright
e
s 00007/00024/00031
d D 6.2 86/05/26 17:22:22 karels 3 2
c updates
e
s 00001/00001/00054
d D 6.1 85/04/27 16:00:09 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00055/00000/00000
d D 5.1 85/04/27 16:00:02 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
D 4
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 4
I 4
D 7
.\" Copyright (c) 1983 The Regents of the University of California.
E 7
I 7
D 9
.\" Copyright (c) 1983, 1991 The Regents of the University of California.
E 9
I 9
D 10
.\" Copyright (c) 1983, 1991, 1993 The Regents of the University of California.
E 9
E 7
.\" All rights reserved.
E 10
I 10
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 10
E 4
.\"
I 7
D 8
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.
.\"	%W% (Berkeley) %G%
E 7
I 4
D 6
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 6
I 6
.\" %sccs.include.redist.man%
E 8
I 8
.\" %sccs.include.redist.roff%
E 8
E 6
.\"
E 4
D 7
.\"	%W% (Berkeley) %G%
E 7
I 7
D 8
.\"     %W% (Berkeley) %G%
E 8
I 8
.\"	%W% (Berkeley) %G%
E 8
E 7
.\"
D 2
.TH TFTPD 8C "4 March 1983"
E 2
I 2
D 4
.TH TFTPD 8C "%Q%"
E 4
I 4
D 7
.TH TFTPD 8 "%Q%"
E 4
E 2
.UC 5
.SH NAME
tftpd \- DARPA Trivial File Transfer Protocol server
.SH SYNOPSIS
D 6
.B /etc/tftpd
E 6
I 6
.B tftpd
E 6
I 5
[ directory ... ]
E 5
D 3
[
.B \-d
] [
.I port
]
E 3
.SH DESCRIPTION
.I Tftpd
is a server which supports the DARPA Trivial File Transfer
E 7
I 7
.Dd %Q%
.Dt TFTPD 8
.Os BSD 4.2
.Sh NAME
.Nm tftpd
.Nd
D 9
.Tn DARPA
Trivial File Transfer Protocol server
E 9
I 9
Internet Trivial File Transfer Protocol server
E 9
.Sh SYNOPSIS
.Nm tftpd
I 9
.Op Fl l
.Op Fl n
E 9
.Op Ar directory ...
.Sh DESCRIPTION
.Nm Tftpd
is a server which supports the
D 9
.Tn DARPA
Trivial File Transfer
E 7
D 3
Protocol.  The TFTP server operates
E 3
I 3
Protocol.
E 9
I 9
Internet Trivial File Transfer
Protocol (\c
.Tn RFC 783).
E 9
D 7
The TFTP server operates
E 3
at the port indicated in the ``tftp'' service description;
E 7
I 7
The
.Tn TFTP
server operates
at the port indicated in the
.Ql tftp
service description;
E 7
see
D 7
.IR services (5).
E 7
I 7
.Xr services 5 .
E 7
D 3
This port number may be overridden (for debugging purposes)
by specifying a port number on the command line.  If the
.B \-d
option is specified, each socket created by
.I tftpd
will have debugging enabled (see SO_DEBUG in
.IR socket (2)).
E 3
I 3
The server is normally started by
D 7
.IR inetd (8).
E 3
.PP
E 7
I 7
.Xr inetd 8 .
.Pp
E 7
The use of
D 7
.I tftp
E 7
I 7
.Xr tftp 1
E 7
does not require an account or password on the remote system.
Due to the lack of authentication information, 
D 7
.I tftpd
E 7
I 7
.Nm tftpd
E 7
will allow only publicly readable files to be
accessed.
I 9
Files containing the string ``/\|\fB.\|.\fP\|/'' are not allowed.
E 9
I 3
Files may be written only if they already exist and are publicly writable.
E 3
D 7
Note that this extends the concept of ``public'' to include
E 7
I 7
Note that this extends the concept of
.Dq public
to include
E 7
all users on all hosts that can be reached through the network;
this may not be appropriate on all systems, and its implications
should be considered before enabling tftp service.
I 3
The server should have the user ID with the lowest possible privilege.
I 5
D 7
.PP
E 7
I 7
.Pp
E 7
Access to files may be restricted by invoking
D 7
.I tftpd
E 7
I 7
.Nm tftpd
E 7
D 9
with a list of directories by including pathnames
E 9
I 9
with a list of directories by including up to 20 pathnames
E 9
as server program arguments in
D 7
.IR /etc/inetd.conf .
E 7
I 7
.Pa /etc/inetd.conf .
E 7
In this case access is restricted to files whose
names are prefixed by the one of the given directories.
I 9
The given directories are also treated as a search path for 
relative filename requests.
.Pp
The options are:
.Bl -tag -width Ds
.It Fl l
Logs all requests using
.Xr syslog 3 .
.It Fl n
Suppresses negative acknowledgement of requests for nonexistent
relative filenames.
.El
E 9
E 5
E 3
D 7
.SH "SEE ALSO"
D 3
tftp(1C)
.SH BUGS
This server is known only to be self consistent
(i.e. it operates with the user TFTP program,
.IR tftp (1C)).
Due to the unreliability of the transport protocol
(UDP) and the scarcity of TFTP implementations,
it is uncertain whether it really works.
.PP
The search permissions of the directories leading to the files accessed
are not checked.
E 3
I 3
D 4
tftp(1C), inetd(8)
E 4
I 4
tftp(1), inetd(8)
E 7
I 7
.Sh SEE ALSO
.Xr tftp 1 ,
.Xr inetd 8
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.2 .
E 7
E 4
E 3
E 1
