bin/sync/SCCS/s.sync.8
h20692
s 00002/00002/00045
d D 8.1 93/05/31 15:48:57 bostic 7 6
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00010/00009/00037
d D 6.4 92/06/23 18:54:53 cael 6 5
c minor nits
e
s 00035/00027/00011
d D 6.3 91/03/16 17:04:46 cael 5 4
c macro and text revision (-mdoc version 3)
e
s 00010/00001/00028
d D 6.2 86/05/28 10:30:41 karels 4 3
c encourage use of halt/reboot
e
s 00001/00001/00028
d D 6.1 85/04/27 13:53:55 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00003/00003/00026
d D 5.1 85/04/27 13:53:35 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00029/00000/00000
d D 4.1 85/04/27 13:53:20 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
D 5
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 5
I 5
D 7
.\" Copyright (c) 1980, 1991 Regents of the University of California.
.\" All rights reserved.
E 7
I 7
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 7
E 5
.\"
D 5
.\"	%W% (Berkeley) %G%
E 5
I 5
D 6
.\" %sccs.include.redist.man%
E 6
I 6
.\" %sccs.include.redist.roff%
E 6
E 5
.\"
D 2
.TH SYNC 8 "4/1/81"
E 2
I 2
D 3
.TH SYNC 8  "4 February 1983"
E 3
I 3
D 5
.TH SYNC 8 "%Q%"
E 3
E 2
.UC 4
.SH NAME
sync \- update the super block
.SH SYNOPSIS
D 2
.B sync
E 2
I 2
.B /etc/sync
E 2
.SH DESCRIPTION
.I Sync
executes the
.I sync
system primitive.
.I Sync
E 5
I 5
D 6
.\"     %W% (Berkeley) %G%
E 6
I 6
.\"	%W% (Berkeley) %G%
E 6
.\"
.Dd %Q%
.Dt SYNC 8
.Os BSD 4
.Sh NAME
.Nm sync
D 6
.Nd synchronize internal filesystem information with that on the disk
E 6
I 6
.Nd force completion of pending disk writes (flush cache)
E 6
.Sh SYNOPSIS
D 6
.Nm /etc/sync
E 6
I 6
.Nm sync
E 6
.Sh DESCRIPTION
D 6
.Xr Sync
E 6
I 6
.Nm Sync
E 6
E 5
D 4
can be called to insure all disk writes have been completed before the
E 4
I 4
can be called to insure that all disk writes have been completed before the
E 4
processor is halted in a way not suitably done by
D 5
.IR reboot (8)
E 5
I 5
.Xr reboot 8
E 5
or
D 5
.IR halt (8).
E 5
I 5
.Xr halt 8 .
E 5
I 4
Generally, it is preferable to use
D 5
.I reboot
E 5
I 5
.Xr reboot
E 5
or
D 5
.I halt
E 5
I 5
.Xr halt
E 5
to shut down the system,
as they may perform additional actions
such as resynchronizing the hardware clock
and flushing internal caches before performing a final
D 5
.IR sync .
E 4
.PP
See
.IR sync (2)
for details on the system primitive.
.SH "SEE ALSO"
D 2
sync(2), halt(8), reboot(8), update(8)
E 2
I 2
sync(2), fsync(2), halt(8), reboot(8), update(8)
E 5
I 5
D 6
.Xr sync .
E 6
I 6
.Nm sync .
E 6
.Pp
D 6
.Nm sync
E 6
I 6
.Nm Sync
E 6
utilizes the
.Xr sync 2
function call.
.Sh SEE ALSO
.Xr sync 2 ,
.Xr fsync 2 ,
.Xr halt 8 ,
.Xr reboot 8 ,
.Xr update 8
.Sh HISTORY
A
D 6
.Nm
command appeared in Version 6 AT&T UNIX.
E 6
I 6
.Nm sync
command appeared in
.At v6 .
E 6
E 5
E 2
E 1
