share/man/man4/man4.tahoe/SCCS/s.ace.4
h36121
s 00002/00002/00088
d D 8.1 93/06/05 13:41:23 bostic 6 5
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00060/00033/00030
d D 6.5 91/03/27 23:30:40 cael 5 4
c macro and text revision (-mdoc version 3)
e
s 00001/00011/00062
d D 6.4 90/06/23 18:03:34 trent 4 3
c new copyright notice
e
s 00017/00006/00056
d D 6.3 89/02/14 17:22:32 bostic 3 2
c add Berkeley specific copyright notice
e
s 00001/00001/00061
d D 6.2 87/06/30 21:22:13 sam 2 1
c update addresses to reflect change form 24 to 32 bit addresses 
c in config file; rewrite cy.4 and vd.4 as well as vx.4
e
s 00062/00000/00000
d D 6.1 86/11/29 12:14:56 sam 1 0
c date and time created 86/11/29 12:14:56 by sam
e
u
U
t
T
I 1
D 3
.\" Copyright (c) 1986 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 3
I 3
D 5
.\" Copyright (c) 1986 The Regents of the University of California.
E 5
I 5
D 6
.\" Copyright (c) 1986, 1991 The Regents of the University of California.
E 5
.\" All rights reserved.
E 6
I 6
.\" Copyright (c) 1986, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 6
E 3
.\"
I 3
D 4
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 4
I 4
.\" %sccs.include.redist.man%
E 4
.\"
E 3
D 5
.\"	%W% (Berkeley) %G%
E 5
I 5
.\"     %W% (Berkeley) %G%
E 5
.\"
D 3
.TH ACE 4 "May 16, 1986"
E 3
I 3
D 5
.TH ACE 4 "%Q%"
E 3
.UC 5
.SH NAME
ace \- ACC 10 Mb/s Ethernet interface
.SH SYNOPSIS
D 2
.B "device ace0 at vba? csr 0xff0000 flags 0xfff80000 vector acecint acerint"
E 2
I 2
.B "device ace0 at vba? csr 0xffff0000 flags 0xfff80000 vector acecint acerint"
E 2
.SH DESCRIPTION
E 5
I 5
.Dd %Q%
.Dt ACE 4 tahoe
.Os BSD 4.2
.Sh NAME
.Nm ace
.Nd
.Tn ACC
10 Mb/s Ethernet interface
.Sh SYNOPSIS
.Cd "device ace0 at vba? csr 0xffff0000 flags 0xfff80000 vector acecint acerint"
.Sh DESCRIPTION
E 5
The
D 5
.I ace
E 5
I 5
.Nm ace
E 5
interface provides access to a 10 Mb/s Ethernet network through
D 5
an ACC controller.
.PP
The hardware has 32 kilobytes of dual-ported memory on the VERSAbus. 
E 5
I 5
an
.Tn ACC
controller.
.Pp
The hardware has 32 kilobytes of dual-ported memory on the
.Tn VERSAbus . 
E 5
This memory
is used for internal buffering by the board, and the interface code reads
D 5
the buffer contents directly through the VERSAbus.
The address of this memory is given in the \fIflags\fP field
E 5
I 5
the buffer contents directly through the
.Tn VERSAbus .
The address of this memory is given in the
.Ar flags
field
E 5
in the configuration file.
D 5
.PP
E 5
I 5
.Pp
E 5
Each of the host's network addresses
D 5
is specified at boot time with an SIOCSIFADDR
ioctl.  The
.I ace
E 5
I 5
is specified at boot time with an
.Dv SIOCSIFADDR
.Xr ioctl 2 .
The
.Nm ace
E 5
interface employs the address resolution protocol described in
D 3
.IR arp (4P)
E 3
I 3
D 5
.IR arp (4)
E 5
I 5
.Xr arp 4
E 5
E 3
to dynamically map between Internet and Ethernet addresses on the local
network.
D 5
.PP
The interface normally tries to use a ``trailer'' encapsulation
E 5
I 5
.Pp
The interface normally tries to use a
.Dq trailer
encapsulation
E 5
to minimize copying data on input and output.
D 5
The use of trailers is negotiated with ARP.
E 5
I 5
The use of trailers is negotiated with
.Tn ARP .
E 5
This negotiation may be disabled, on a per-interface basis,
D 5
by setting the IFF_NOTRAILERS
flag with an SIOCSIFFLAGS ioctl.
.PP
E 5
I 5
by setting the
.Dv IFF_NOTRAILERS
flag with an
.Dv SIOCSIFFLAGS
.Xr ioctl .
.Pp
E 5
The device implements an exponential backoff algorithm
when notified of a collision on the cable.  This algorithm utilizes
a table of random numbers setup by the system at boot time.
The delay is done in the controller.
D 5
.SH DIAGNOSTICS
.BR "ace%d: stray xmit interrupt, xnct %d" .
E 5
I 5
.Sh DIAGNOSTICS
.Bl -diag
.It "ace%d: stray xmit interrupt, xnct %d."
E 5
An unexpected transmission complete interrupt was received;
the interrupt is ignored.
D 5
.BR "ace%d: can't handle af%d" .
E 5
I 5
.It "ace%d: can't handle af%d."
E 5
The interface was handed
a message with addresses formatted in an unsuitable address
family; the packet was dropped.
D 5
.SH SEE ALSO
D 3
intro(4N), inet(4F), arp(4P)
E 3
I 3
intro(4), inet(4), arp(4)
E 3
.SH BUGS
E 5
I 5
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr inet 4 ,
.Xr arp 4
.Sh HISTORY
The
.Nm
driver appeared in
.Bx 4.3 tahoe .
.Sh BUGS
E 5
The hardware is not capable of talking to itself.  The software
implements local sending and broadcast by sending such packets to the
loop interface.  This is a kludge.
D 5
.PP
E 5
I 5
.Pp
E 5
The device doesn't autoconfigure its interrupt vector; it is set
at 0x90 + eight times the unit number.
E 1
