share/man/man4/man4.tahoe/SCCS/s.autoconf.4
h06607
s 00002/00002/00125
d D 8.1 93/06/05 13:41:29 bostic 4 3
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00106/00048/00021
d D 6.3 91/03/27 23:30:41 cael 3 2
c macro and text revision (-mdoc version 3)
e
s 00032/00010/00037
d D 6.2 87/06/30 21:22:15 sam 2 1
c update addresses to reflect change form 24 to 32 bit addresses 
c in config file; rewrite cy.4 and vd.4 as well as vx.4
e
s 00047/00000/00000
d D 6.1 86/11/24 18:19:27 mckusick 1 0
c from CCI
e
u
U
t
T
I 1
D 3
.\" Copyright (c) 1986 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 3
I 3
D 4
.\" Copyright (c) 1986, 1991 Regents of the University of California.
.\" All rights reserved.
E 4
I 4
.\" Copyright (c) 1986, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 4
E 3
.\"
D 3
.\"	%W% (Berkeley) %G%
E 3
I 3
.\" %sccs.include.redist.man%
E 3
.\"
D 3
.TH AUTOCONF 4 "%Q%"
.UC 7
.SH NAME
D 2
autoconf \- diagnostics from autoconfiguartion code
E 2
I 2
autoconf \- diagnostics from autoconfiguration code
E 2
.SH DESCRIPTION
When UNIX bootstraps it probes the innards of the machine it is running
E 3
I 3
.\"     %W% (Berkeley) %G%
.\"
.Dd %Q%
.Dt AUTOCONF 4 tahoe
.Os BSD 4.3t
.Sh NAME
.Nm autoconf
.Nd diagnostics from autoconfiguration code
.Sh DESCRIPTION
When
.Tn UNIX
bootstraps it probes the innards of the machine it is running
E 3
on and locates controllers, drives, and other devices, printing out
what it finds on the console.  This procedure is driven by a system
configuration table which is processed by
D 3
.IR config (8)
E 3
I 3
.Xr config 8
E 3
and compiled into each kernel.
D 3
.PP
D 2
VERSABUS devices are located by probing to see if their control-status
E 2
I 2
VERSAbus devices are located by probing to see if their control-status
E 3
I 3
.Pp
.Tn VERSAbus
devices are located by probing to see if their control-status
E 3
E 2
registers respond.  If not, they are silently ignored.  If the control
status register responds but the device cannot be made to interrupt,
a diagnostic warning will be printed on the console and the device
will not be available to the system.
D 3
.PP
E 3
I 3
.Pp
E 3
A generic system may be built which picks its root device at boot time
D 3
as the ``best'' available device.
If such a system is booted with the RB_ASKNAME option of (see
.IR reboot (2v)),
E 3
I 3
as the
.Dq best
available device.
If such a system is booted with the
.Dv RB_ASKNAME
option of (see
.Xr reboot 2 ) ,
E 3
then the name of the root device is read from the console terminal at boot
time, and any available device may be used.
D 3
.SH SEE ALSO
config(8)
.SH DIAGNOSTICS
I 2
\fBvba%d at %x\fR.  A VERSAbus adapter was found and mapped into the
address space of the operating system starting at virtual address %x.
UNIX will call it vba%d.
E 2
.PP
D 2
\fB%s%d at vba address %o vec %o\fR.  The device %s%d, e.g. fsd0
was found on the bus at control-status register address %o and with
device vector %o.
E 2
I 2
\fB%s%d at vba%d drive %d\fR.  A tape formatter or a disk was found
on the VERSAbus; for disks %s%d will look like ``dk0'', for tape formatters
like ``yc1''.  The drive number comes from the unit plug on the drive
or in the tape formatter (\fBnot\fR on the tape drive; see below).
E 2
.PP
D 2
\fB%s%d at vba address %o didn't interrupt\fR.  The device did not interrupt,
E 2
I 2
\fB%s%d at %s%d slave %d\fR. 
Which would look like ``yc0 at cy0 slave 0'',
where \fByc0\fR is the name for the tape device and \fBcy0\fR is the name
E 3
I 3
.Sh DIAGNOSTICS
.Bl -diag
.It vba%d at %x.
A
.Tn VERSAbus
adapter was found and mapped into the
address space of the operating system starting at virtual address
.Sq Li  %x .
.Tn UNIX
will call it
.Sq Li vba%d .
.It %s%d at vba%d drive %d.
A tape formatter or a disk was found
on the
.Tn VERSAbus ;
for disks
.Sq Li %s%d
will look like
.Sq Li dk0 ,
for tape formatters
like
.Sq Li yc1 .
The drive number comes from the unit plug on the drive
or in the tape formatter
.Pf ( Em not
on the tape drive; see below).
.It %s%d at %s%d slave %d.
Which would look like
.Sq Li yc0 at cy0 slave 0% ,
where
.Em yc0
is the name for the tape device and
.Em cy0
is the name
E 3
for the formatter.  A tape slave was found on the tape formatter at the
indicated drive number (on the front of the tape drive).
D 3
UNIX will call the device, e.g., \fBcy0\fR.
.PP
\fB%s%d at vba%d csr %x vec %x ipl %x\fR.  The device %s%d, e.g. vd0
was found on vba%d at control-status register address %x and with
device vector %x.  The device interrupted at priority level %x.
.PP
\fB%s%d at vba%d csr %x no interrupts\fR.  The device was found
on vba%d at control-status register address %x; no
E 3
I 3
.Tn UNIX
will call the device, e.g.,
.Li cy0.
.It %s%d at vba%d csr %x vec %x ipl %x.
The device
.Sq Li %s%d ,
e.g.
.Sq Li vd0
was found on
.Sq Li vba%d
at control-status register address
.Sq Li %x
and with
device vector
.Sq Li %x .
The device interrupted at priority level
.Sq Li %x .
.It %s%d at vba%d csr %x no interrupts.
The device was found
on
.Sq Li vba%d
at control-status register address
.Sq Li %x ;
no
E 3
interrupts were configured for the device.
D 3
.PP
\fB%s%d at vba%d csr %x didn't interrupt\fR.  The device did not interrupt,
E 3
I 3
.It %s%d at vba%d csr %x didn't interrupt.
The device did not interrupt,
E 3
E 2
likely because it is broken, hung, or not the kind of device it is advertised
D 2
to be.
E 2
I 2
to be.  The csr address is interpreted as described above.
E 2
D 3
.PP
\fB%s%d at %s%d slave %d\fR.
D 2
Which would look like ``smd0 at vd0 slave 0'',
where \fBsmd0\fR is the name of a disk drive and \fBvd0\fR is the name
of the controller.
E 2
I 2
Which would look like ``dk0 at vd0 slave 0'',
where \fBdk0\fR is the name of a disk drive and \fBvd0\fR is the name
E 3
I 3
.It %s%d at %s%d slave %d.
Which would look like
.Sq Li dk0 at vd0 slave 0 ,
where
.Em dk0
is the name of a disk drive and
.Em vd0
is the name
E 3
of the controller. 
E 2
D 3
.SH BUGS
E 3
I 3
.El
.Sh SEE ALSO
.Xr config 8
.Sh HISTORY
The
.Nm
special file appeared in
.Bx 4.3 tahoe .
.Sh BUGS
E 3
I 2
Very few devices actually figure out their interrupt vector
by forcing the device to interrupt.  Only the upper megabyte of the
D 3
VERSAbus address space is mapped into the system's virtual address space.
E 3
I 3
.Tn VERSAbus
address space is mapped into the system's virtual address space.
E 3
E 2
E 1
