share/man/man4/man4.tahoe/SCCS/s.cons.4
h51813
s 00002/00002/00072
d D 8.1 93/06/05 13:41:35 bostic 4 3
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00062/00029/00012
d D 6.3 91/03/27 23:30:42 cael 3 2
c macro and text revision (-mdoc version 3)
e
s 00024/00005/00017
d D 6.2 87/06/30 21:22:16 sam 2 1
c update addresses to reflect change form 24 to 32 bit addresses 
c in config file; rewrite cy.4 and vd.4 as well as vx.4
e
s 00022/00000/00000
d D 6.1 86/11/24 18:20:12 mckusick 1 0
c from CCI
e
u
U
t
T
I 1
D 3
.\" Copyright (c) 1986 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 3
I 3
D 4
.\" Copyright (c) 1986, 1991 Regents of the University of California.
.\" All rights reserved.
E 4
I 4
.\" Copyright (c) 1986, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 4
E 3
.\"
D 3
.\"	%W% (Berkeley) %G%
E 3
I 3
.\" %sccs.include.redist.man%
E 3
.\"
D 3
.TH CONS 4 "%Q%"
.UC 7
.SH NAME
D 2
cons \- TAHOE console interface
E 2
I 2
cons, CP, remote \- Tahoe console interface
E 2
.SH DESCRIPTION
E 3
I 3
.\"     %W% (Berkeley) %G%
.\"
.Dd %Q%
.Dt CONS 4 tahoe
.Os BSD 4.3t
.Sh NAME
.Nm cons ,
.Nm CP ,
.Nm remote
.Nd Tahoe console interface
.Sh DESCRIPTION
E 3
The console is available to the processor through the console registers.
D 3
It acts like a normal terminal, except that a ``~'' is used to transfer
E 3
I 3
It acts like a normal terminal, except that a
.Dq Ic ~
is used to transfer
E 3
D 2
command to the console processor.
E 2
I 2
commands to the console processor when the front panel key switch is
D 3
in the ``foo'' or ``bar'' position.
.PP
Useful commands to the console processor include ``~h'' to halt
the machine and ``~b'' to force a reboot.  When the console processor
is in control, a ``#>'' prompt is displayed.  To continue execution
after halting the machine with ``~h'', use ``r.''.
E 3
I 3
in the
.Dq foo
or
.Dq bar
position.
When the console processor
is in control, a
.Ql #>
prompt is displayed.  To continue execution
after halting the machine with
.Ql ~h ,
use
.Ql r .
.Bl -tag -width Ds
.It Ic \&~h
Halt the machine.
.It Ic \&~b
Force a reboot.
.It Ic \&~r
Continue execution after a
.Ic \&~h .
.El
.Pp
E 3
Refer to the Tahoe
console processor handbook for the complete list of facilities available
through the console processor.
D 3
.PP
E 3
I 3
.Pp
E 3
The
D 3
.I CP
E 3
I 3
.Nm CP
E 3
device provides direct access to the console processor.  The
D 3
.I remote
E 3
I 3
.Nm remote
E 3
device is a secondary console terminal used for remote diagnosis;
it is normally connected to a modem.
E 2
D 3
.SH FILES
D 2
/dev/console
E 2
I 2
.nf
/dev/console,
/dev/CP,
/dev/remote
E 2
.SH "SEE ALSO"
D 2
tty(4), reboot(8)
E 2
I 2
kdb(4), tty(4), reboot(8)
E 2
.br
D 2
CP Handbook
E 2
I 2
Console processor handbook
E 2
.SH DIAGNOSTICS
E 3
I 3
.Sh FILES
.Bl -tag -width /dev/consolexx -compact
.It Pa /dev/console
.It Pa /dev/CP
.It Pa /dev/remote
.El
.Sh DIAGNOSTICS
E 3
None.
I 3
.Sh SEE ALSO
.Xr kdb 4 ,
.Xr tty 4 ,
.Xr reboot 8
.Rs
.%T Console Processor Handbook
.Re
.Sh HISTORY
The
.Nm
interface appeared in
.Bx 4.3 tahoe .
E 3
E 1
