share/man/man4/man4.tahoe/SCCS/s.cy.4
h05391
s 00002/00002/00148
d D 8.1 93/06/05 13:41:50 bostic 5 4
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00097/00077/00053
d D 6.4 91/03/27 23:30:43 cael 4 3
c macro and text revision (-mdoc version 3)
e
s 00001/00001/00129
d D 6.3 88/07/08 13:10:00 bostic 3 2
c not mt, mtio
e
s 00111/00105/00019
d D 6.2 87/06/30 21:22:17 sam 2 1
c update addresses to reflect change form 24 to 32 bit addresses 
c in config file; rewrite cy.4 and vd.4 as well as vx.4
e
s 00124/00000/00000
d D 6.1 86/11/24 18:20:36 mckusick 1 0
c from CCI
e
u
U
t
T
I 1
D 4
.\" Copyright (c) 1986 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 4
I 4
D 5
.\" Copyright (c) 1986, 1991 Regents of the University of California.
.\" All rights reserved.
E 5
I 5
.\" Copyright (c) 1986, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 5
E 4
.\"
D 4
.\"	%W% (Berkeley) %G%
E 4
I 4
.\" %sccs.include.redist.man%
E 4
.\"
D 4
.TH CY 4 "%Q%"
.UC 7
.SH NAME
cy \- Cipher/tapemaster magtape interface
.SH SYNOPSIS
D 2
tapemaster0 at vba address ff4000 
E 2
I 2
.B "controller cy0 at vba? csr 0xffff4000 vector cyintr"
E 2
.br
I 2
.B "device yc0 at cy0 drive 0"
E 2
.SH DESCRIPTION
The Cipher F880, M990/Tapemaster combination provides a standard tape drive
E 4
I 4
.\"     %W% (Berkeley) %G%
.\"
.Dd %Q%
.Dt CY 4 tahoe
.Os BSD 4.3t
.Sh NAME
.Nm cy
.Nd Cipher/tapemaster magtape interface
.Sh SYNOPSIS
.Cd "controller cy0 at vba? csr 0xffff4000 vector cyintr"
.Cd "device yc0 at cy0 drive 0"
.Sh DESCRIPTION
The Cipher
.Tn F880 ,
.Tn M990 Ns / Tapemaster
combination provides a standard tape drive
E 4
interface as described in
D 4
.IR mt (4).
D 2
The Cipher F880 tape drive operates at 1600 or 3200 bpi - controlled by a switch on the drive. The Cipher M990 operates at 1600,3200 or 6250 bpi - controlled by switches on the front of the drive.
E 2
I 2
The Cipher F880 tape drive operates at 1600 or 3200 bpi \-
E 4
I 4
.Xr mt 4 .
The Cipher
.Tn F880
tape drive operates at 1600 or 3200
.Tn BPI \-
E 4
controlled by a switch on the drive. 
D 4
The Cipher M990 operates at 1600, 3200 or 6250 bpi \-
E 4
I 4
The Cipher
.Tn M990
operates at 1600, 3200 or 6250
.Tn BPI \-
E 4
controlled by switches on the front of the drive.
D 4
.PP
E 4
I 4
.Pp
E 4
The Tapemaster controller board is actually a Multibus controller
D 4
accessed through a Halversa Multibus to VERSAbus converter card.
E 2
.SH "SEE ALSO"
D 3
mt(1), tar(1), mt(4)
E 3
I 3
mt(1), tar(1), mtio(4)
E 3
.SH DIAGNOSTICS
D 2
Listed below are all possible error messages and an explanation of what
the messages mean. Any comment related to hardware problems is in no way
definitive or complete. Every error will produce one or more messages.
Some errors, such as tape is write protected, are displayed on the user's terminal. All system errors are also displayed on the system console with the status that caused the drive to fail.
.br
The meaning of the status fields are:
.sp 1
.in +0.1i
.nf
 7      0 15     8
+--------|--------+
|||||||||||||||||||
+-----------------+
 ^^^^^^^^ ^^^^---^
 |||||||| ||||
 |||||||| |||+---- ERROR - This 5-bit field specifies an error
 |||||||| |||              code when a non-recoverable error is
 |||||||| |||              encountered.
 |||||||| ||+----- E     - (Enter) The Parameter Block has been
 |||||||| ||               entered and execution has been begun.
 |||||||| |+------ C     - (Complete) The TAPEMASTER has
 |||||||| |                successfully completed the command.
 |||||||| +------- R	- (Retry) At least one retry was executed
 ||||||||                  by the TAPEMASTER during this command.
 |||||||+---------       - Unused.
 ||||||+---------- P	- (Write Protect) The tape does not have
 ||||||                    a write enable ring.
 |||||+----------- FB	- (Formatter Busy) The Formatter is busy.
 ||||+------------ R	- (Ready) The selected drive is ready.
 |||+------------- EOT	- (End of Tape)The EOT marker was detected.
 ||+-------------- LP	- (Load Point) The tape is at load point.
 |+--------------- OL	- (On Line) The drive is On Line.
 +---------------- FM	- (Filemark) A filemark was detected on
                           this operation.
.fi
.sp 1
.sp 1
.in -0.2i
Error messages will be displayed with the drive number (# stands for number), the message and its error code.
.sp 1
	\fBcy#: Drive timed out during transfer\fP.            
.br
Time out errors during transfer; this may be due to trying to read a blank tape or the controller failing to interrupt or the drive dropping off-line ... (Error:01-05)\fR 
.sp1
	\fBcy#: Tape is write protected\fP.
.br
An attempt was made to write on the tape drive when no write ring was present; this message is written only on the terminal of the user who tried to access the tape. (Error:11)\fR
.sp1
	\fBcy#: Drive is not on-line\fP.
.br
An attempt was made to access the tape while it was offline; this message is written only on the terminal of the user who tried to access the tape. (Error:10)\fR
.sp1
\fB	cy#: Controller referenced non-existent system memory\fP.
A memory time-out occurred during a system memory reference. (Error:06)\fR.
.sp1
\fB	cy#: Controller diagnostics failed\fP.
.br
An error occurred in the micro-diagnostics or the diagnostic mode jumper was not installed while attempting to execute a Diagnostics command. (Error:08,13)\fR
.sp1
\fB	cy#: Unsatisfactory media found\fP.
.br
A tape time-out occured, because the tape drive did not supply an expected read or write strobe. This normally occurs when attempting to read a larger record than was written. It may also occur during a write due to a damaged tape. This message is written on the terminal of the user who tried to access the tape. (Error:0F)\fR
.sp1
	\fBcy#: Checksum error in controller proms\fP.
.br
An error was detected while calculating a checksum on the PROM. (Error:0E)\fR
.sp1
\fB	cy#: Unrecoverable media error during read\fP.
.br
A hard or soft error occurred which could not eliminated by retry. (Error:0A)\fR
.sp1
\fB	cy#: Unrecoverable tape parity error\fP.
.br
A read parity error occurred on the byte interface between the drive and the TAPEMASTER. (Error:0D)\fR 
.sp1
\fB	cy#: Blank tape found (data expected)\fP.
.br
Blank tape was encountered where data was expected. (Error:07)\fR
.sp1
.sp1
\fB****Tapemaster controller time-out during initialization!****\fP
.br
Tapemaster controller failed to acknowledge the first attention while initializing the tape parameter blocks.\fP
.sp1
\fR****Tapemaster configuration failure!****\fP
.br
Tapemaster failed while initializng the on-board registers, memory and calculate the buffer space which is available for buffered operations.\fP
.sp1
\fR****Unrecoverble hardware error****\fP
.br
An unrecoverable hardware error occured. Controller or drive failure!!\fP
.sp1
The following are Warning messages:
.sp1
	\fRcy#: # cm of tape were used for recovering bad spots.\fP
.br
Displays the number of centimeters of tape that were skipped over while retrying due to bad spots on the tape.\fP
.sp1
	\fRcy#: Maximum block size is #!\fP
.br
Specified block size exceeded the displayed maximum block size.\fP

BUGS
E 2
I 2
\fBcy%d: %dkb buffer\fP.  The formatter was found to have a
%d kilobyte buffer during autoconfiguration.
.PP
\fBcy%d: timeout or err during init, status=%b\fP.  The controller
E 4
I 4
accessed through a Halversa Multibus to
.Tn VERSAbus
converter card.
.Sh DIAGNOSTICS
.Bl -diag
.It cy%d: %dkb buffer.
The formatter was found to have a
.Ql %d
kilobyte buffer during autoconfiguration.
.It cy%d: timeout or err during init, status=%b.
The controller
E 4
timed out or an error occurred on a nop command during autoconfiguration;
the controller may be hung.
D 4
.PP
\fBcy%d: configuration failure, status=%b\fP.  The controller
E 4
I 4
.It cy%d: configuration failure, status=%b.
The controller
E 4
timed out or an error occurred on a configure command during
autoconfiguration; the controller may be hung.
D 4
.PP
\fByc%d: no write ring\fR.  An attempt was made to write on the tape drive
E 4
I 4
.It yc%d: no write ring.
An attempt was made to write on the tape drive
E 4
when no write ring was present; this message is written on the terminal of
the user who tried to access the tape.
D 4
.PP
\fByc%d: not online\fR.  An attempt was made to access the tape while it
E 4
I 4
.It yc%d: not online.
An attempt was made to access the tape while it
E 4
was offline; this message is written on the terminal of the user
who tried to access the tape.
D 4
.PP
\fBcy%d: i/o size too large\fP.  A read or a write request exceeded the
E 4
I 4
.It cy%d: i/o size too large.
A read or a write request exceeded the
E 4
maximum transfer size for the controller \- 32 kilobytes; this message
is written on the terminal of the user who made the read or write request.
D 4
.PP
\fByc%d: hard error bn%d status=%b\fR.   A tape error occurred
at block \fIbn\fR; the cy error register is
E 4
I 4
.It yc%d: hard error bn%d status=%b.
A tape error occurred
at block
.Em bn ;
the cy error register is
E 4
printed in hexadecimal with the bits symbolically decoded.  Any error is
fatal on non-raw tape; when possible the driver will have retried
the operation which failed several times before reporting the error.
D 4
For known errors, the trailing %s is one of the following:
.RS
\fBtimeout\fP, \fBtimeout1\fP, \fBtimeout2\fP, \fBtimeout3\fP, \fBtimeout4\fP. 
E 4
I 4
For known errors, the trailing
.Ql %s
is one of the following:
.Pp
.Bl -diag -offset indent -compact
.It timeout, timeout1, timeout2, timeout3, timeout4.
E 4
Time out errors; this may be due to trying to read a blank tape
or the controller failing to interrupt or the drive dropping off-line.
D 4
.PP
\fBnon-existent memory\fP.  A controller transfer to memory timed out.
.PP
\fBblank tape\fP.  The controller detected a blank tape when
E 4
I 4
.It non-existent memory.
A controller transfer to memory timed out.
.It blank tape.
The controller detected a blank tape when
E 4
data was expected.
D 4
.PP
\fBmicro-diagnostic\fP, \fBmissing diagnostic jumper\fP. 
E 4
I 4
.It micro-diagnostic, missing diagnostic jumper.
E 4
An error occurred in the micro-diagnostics or
the diagnostic mode jumper was not installed while attempting to execute
a diagnostics command.
D 4
.PP
\fBeot/bot detected\fP.  The controller unexpectedly encountered
E 4
I 4
.It eot/bot detected.
The controller unexpectedly encountered
E 4
end-of-tape or beginning-of-tape during an operation.
D 4
.PP
\fBretry unsuccessful\fP.  
E 4
I 4
.It retry unsuccessful.
E 4
An error occurred which could not be recovered by repeated retries.
D 4
.PP
\fBfifo over/under-flow\fP.
E 4
I 4
.It fifo over/under-flow.
E 4
The controller was unable to transfer data to the drive fast enough.
This usually occurs because a transfer was performed without using the
controller's internal buffer.
D 4
.PP
\fBdrive to controller parity error\fP.
E 4
I 4
.It drive to controller parity error.
E 4
A parity error was detected by the controller in data transferred
between the drive and the controller's internal buffer.
D 4
.PP
\fBprom checksum\fP.
The controller thinks its PROM is corrupted.
.PP
\fBtime out tape strobe (record length error)\fP.
E 4
I 4
.It prom checksum.
The controller thinks its
.Tn PROM
is corrupted.
.It time out tape strobe (record length error).
E 4
The controller timed out while looking for an inter-record gap.
This usually occurs because the records on the tape are larger than
expected (or can be handled).
D 4
.PP
\fBtape not ready\fP.
E 4
I 4
.It tape not ready.
E 4
The drive does not respond; usually the power has been turned off
or a cable has come off.
D 4
.PP
\fBwrite protected\fP.
E 4
I 4
.It write protected.
E 4
A write ring was present in the tape when a write was attempted.
D 4
.PP
\fBinvalid link pointer\fP.
E 4
I 4
.It invalid link pointer.
E 4
An invalid pointer was encountered in a tape parameter block.
D 4
.PP
\fBunexpected file mark\fP.
E 4
I 4
.It unexpected file mark.
E 4
A tape file mark was encountered while trying to read or space.
D 4
.PP
\fBinvalid byte count\fP.
E 4
I 4
.It invalid byte count.
E 4
An invalid byte count parameter was encountered in a tape parameter
block.
D 4
.PP
\fBunidentified hardware error\fP, \fBstreaming terminated\fP.
E 4
I 4
.It unidentified hardware error.
.It streaming terminated.
E 4
These should not happen.
D 4
.RE
.PP
\fByc%d: lost interrupt\fP.
E 4
I 4
.El
.Pp
.It yc%d: lost interrupt.
E 4
The controller failed to respond with an interrupt signifying completion
of the current command.  The system will attempt to abort the
outstanding command and reset the controller.
D 4
.PP
\fBcy%d: reset failed\fP.
E 4
I 4
.Pp
.It cy%d: reset failed.
E 4
The system was unable to reset the controller.  This is normally preceded
by another message from the driver.
D 4
.SH BUGS
E 4
I 4
.El
.Sh SEE ALSO
.Xr mt 1 ,
.Xr tar 1 ,
.Xr mtio 4
.Sh HISTORY
The
.Nm
driver appeared in
.Bx 4.3 tahoe .
.Sh BUGS
E 4
The controller supports only 20-bit addresses.  The only way the
system can insure the controller will be able to address data
to be transferred
is to copy it into an intermediate buffer allocated in the first megabyte
of system memory.
E 2
E 1
