share/man/man4/man4.tahoe/SCCS/s.dr.4
h17563
s 00002/00002/00135
d D 8.1 93/06/05 13:41:58 bostic 4 3
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00086/00080/00051
d D 6.3 91/03/27 23:30:44 cael 3 2
c macro and text revision (-mdoc version 3)
e
s 00001/00001/00130
d D 6.2 87/06/30 21:22:19 sam 2 1
c update addresses to reflect change form 24 to 32 bit addresses 
c in config file; rewrite cy.4 and vd.4 as well as vx.4
e
s 00131/00000/00000
d D 6.1 86/11/29 12:14:55 sam 1 0
c date and time created 86/11/29 12:14:55 by sam
e
u
U
t
T
I 1
D 3
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 3
I 3
D 4
.\" Copyright (c) 1983, 1991 Regents of the University of California.
.\" All rights reserved.
E 4
I 4
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 4
E 3
.\"
D 3
.\"	%W% (Berkeley) %G%
E 3
I 3
.\" %sccs.include.redist.man%
E 3
.\"
D 3
.TH DR 4 "November 21, 1986"
.UC 5
.SH NAME
dr \- Ikon DR-11W interface
.SH SYNOPSIS
D 2
.B "device dr0 at vba? csr 0xff8000 vector drintr"
E 2
I 2
.B "device dr0 at vba? csr 0xffff8000 vector drintr"
E 2
.SH DESCRIPTION
E 3
I 3
.\"     %W% (Berkeley) %G%
.\"
.Dd %Q%
.Dt DR 4 tahoe
.Os BSD 4.2
.Sh NAME
.Nm dr
.Nd Ikon
.Tn DR-11W
interface
.Sh SYNOPSIS
.Cd "device dr0 at vba? csr 0xffff8000 vector drintr"
.Sh DESCRIPTION
E 3
The
D 3
.I dr
E 3
I 3
.Nm dr
E 3
driver provides access
D 3
to an Ikon DR-11W DMA controller.
E 3
I 3
to an Ikon
.Tn DR-11W
.Tn DMA
controller.
E 3
Each minor device is a different controller.
D 3
.PP
E 3
I 3
.Pp
E 3
In addition to reading and writing, the following
D 3
.I ioctl
E 3
I 3
.Xr ioctl 2
E 3
requests are available:
D 3
.TP 10
DRWAIT
E 3
I 3
.Bl -tag -width DRSETNORSTALL
.It Dv DRWAIT
E 3
Wait for an attention interrupt from the associated device.
D 3
.TP
DRPIOW
Write to the programmed i/o register.
.TP
DRPACL
E 3
I 3
.It Dv DRPIOW
Write to the programmed
.Tn I/O
register.
.It Dv DRPACL
E 3
Write to the pulse register.
D 3
.TP
DRDACL
Set the ``ac-low'' bit in the next command sent to the DR-11W.
.TP
DRPCYL
Set the ``cycle'' bit in the next command sent to the DR-11W.
.TP
DRDFCN
E 3
I 3
.It Dv DRDACL
Set the ``ac-low'' bit in the next command sent to the
.Tn DR-11W .
.It Dv DRPCYL
Set the ``cycle'' bit in the next command sent to the
.Tn DR-11W .
.It Dv DRDFCN
E 3
Hold the function bits until the next command is issused.
D 3
.TP
DRRATN
E 3
I 3
.It Dv DRRATN
E 3
Reset the attention flag.
D 3
.TP
DRRDMA
Reset the DMA complete flag.
.TP
DRSFCN
E 3
I 3
.It Dv DRRDMA
Reset the
.Tn DMA
complete flag.
.It Dv DRSFCN
E 3
Set the function bits in the control status register and,
as a side effect, clear the interrupt enable flag.
D 3
.TP
DRRPER
E 3
I 3
.It Dv DRRPER
E 3
Reset the parity error flag.
D 3
.TP
DRSETRSTALL
E 3
I 3
.It Dv DRSETRSTALL
E 3
Set ``no stall'' mode for all subsequent reads.
In no stall mode the driver will abort
read requests that fail to complete before a user
specified timeout expires.
D 3
.TP
DRSETNORSTALL
E 3
I 3
.It Dv DRSETNORSTALL
E 3
Disable no stall mode for reads.
D 3
.TP
DRGETRSTALL
E 3
I 3
.It Dv DRGETRSTALL
E 3
Return true if in no stall mode for reads.
D 3
.TP
DRSETRTIMEOUT
E 3
I 3
.It Dv DRSETRTIMEOUT
E 3
Set the value of the timeout used in no stall mode  for
reads.  The time is specified in tenths of seconds.
D 3
.TP
DRGETRTIMEOUT
E 3
I 3
.It Dv DRGETRTIMEOUT
E 3
Return the time until (in tenths of seconds) before a read
is timed out when in no stall mode.
D 3
.TP
DRSETWSTALL
E 3
I 3
.It Dv DRSETWSTALL
E 3
Set ``no stall'' mode for all subsequent writes.
In no stall mode the driver will abort
write requests that fail to complete before a user
specified timeout expires.
D 3
.TP
DRSETNOWSTALL
E 3
I 3
.It Dv DRSETNOWSTALL
E 3
Disable no stall mode for writes.
D 3
.TP
DRGETWSTALL
E 3
I 3
.It Dv DRGETWSTALL
E 3
Return true if in no stall mode for writes.
D 3
.TP
DRSETWTIMEOUT
E 3
I 3
.It Dv DRSETWTIMEOUT
E 3
Set the value of the timeout used in no stall mode  for
writes.  The time is specified in tenths of seconds.
D 3
.TP
DRGETRTIMEOUT
E 3
I 3
.It Dv DRGETRTIMEOUT
E 3
Return the time until (in tenths of seconds) before a write
is timed out when in no stall mode.
D 3
.TP
DRWRITEREADY
E 3
I 3
.It Dv DRWRITEREADY
E 3
Return 1 if the device can accept data, 0 otherwise
D 3
(this is areally the DR-11W A status bit).
.TP
DRREADREADY
E 3
I 3
(this is really the
.Tn DR-11W A
status bit).
.It Dv DRREADREADY
E 3
Return 1 if the device has data for the host to read,
D 3
0 otherwise (this is really the DR-11W B status bit).
.TP
DRBUSY
E 3
I 3
0 otherwise (this is really the
.Tn DR-11W B
status bit).
.It Dv DRBUSY
E 3
Return 1  if the device is busy, 0 otherwise.
D 3
.TP
DRRESET
E 3
I 3
.It Dv DRRESET
E 3
Reset the DR-11W.
D 3
.TP
DR11STAT
E 3
I 3
.It Dv DR11STAT
E 3
Return the driver status and the contents of the
D 3
DR-11W i/o registers.  The
E 3
I 3
.Tn DR-11W
.Tn I/O registers.  The
E 3
eight words returned are, in order, the driver
status flags, the contents of the control status
register, the contents of the status register
at the time of the last interrupt from the device,
D 3
the contents of the programmed i/o data register,
E 3
I 3
the contents of the programmed
.Tn I/O data register,
E 3
a combination of the address modifier used by the
D 3
device in performing VERSAbus transfers and the
E 3
I 3
device in performing
.Tn VERSAbus
transfers and the
E 3
interrupt vector used by the device, the contents
of the range register, the contents of the rahi
register, and the contents of the ralo register.
D 3
.TP
DR11LOOP
E 3
I 3
.It Dv DR11LOOP
E 3
Perform loopback testing (the loopback cable must
be in place for this to work).
D 3
.SH FILES
/dev/dr[0-7]	standard devices
.SH DIAGNOSTICS
E 3
I 3
.El
.Sh FILES
.Bl -tag -width /dev/dr[0-7]xx -compact
.It Pa /dev/dr[0-7]
standard devices
.El
.Sh DIAGNOSTICS
E 3
Lots of them, none of them meaningful.
D 3
.SH BUGS
E 3
I 3
.Sh HISTORY
The
.Nm
driver appeared in
.Bx 4.3 tahoe .
.Sh BUGS
E 3
This driver needs to be rewritten.
E 1
