share/man/man4/man4.tahoe/SCCS/s.enp.4
h15747
s 00002/00002/00093
d D 8.1 93/06/05 13:42:04 bostic 5 4
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00066/00034/00029
d D 5.4 91/03/27 23:30:45 cael 4 3
c macro and text revision (-mdoc version 3)
e
s 00001/00011/00062
d D 5.3 90/06/23 18:03:28 trent 3 2
c new copyright notice
e
s 00017/00006/00056
d D 5.2 89/02/14 17:22:33 bostic 2 1
c add Berkeley specific copyright notice
e
s 00062/00000/00000
d D 5.1 87/12/12 18:20:31 bostic 1 0
c date and time created 87/12/12 18:20:31 by bostic
e
u
U
t
T
I 1
D 2
.\" Copyright (c) 1986 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 2
I 2
D 4
.\" Copyright (c) 1986 The Regents of the University of California.
E 4
I 4
D 5
.\" Copyright (c) 1986, 1991 The Regents of the University of California.
E 4
.\" All rights reserved.
E 5
I 5
.\" Copyright (c) 1986, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 5
E 2
.\"
I 2
D 3
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 3
I 3
.\" %sccs.include.redist.man%
E 3
.\"
E 2
D 4
.\"	%W% (Berkeley) %G%
E 4
I 4
.\"     %W% (Berkeley) %G%
E 4
.\"
D 2
.TH ENP 4 "April 29, 1987"
E 2
I 2
D 4
.TH ENP 4 "%Q%"
E 2
.UC 5
.SH NAME
enp \- CMC 10 Mb/s Ethernet interface
.SH SYNOPSIS
.B "device enp0 at vba? csr 0xfff40000 vector enpintr"
.SH DESCRIPTION
E 4
I 4
.Dd %Q%
.Dt ENP 4 tahoe
.Os BSD 4.3t
.Sh NAME
.Nm enp
.Nd
.Tn CMC
10 Mb/s Ethernet interface
.Sh SYNOPSIS
.Cd "device enp0 at vba? csr 0xfff40000 vector enpintr"
.Sh DESCRIPTION
E 4
The
D 4
.I enp
E 4
I 4
.Nm enp
E 4
interface provides access to a 10 Mb/s Ethernet network through
D 4
a CMC ENP-20 controller.
.PP
The hardware has 128 kilobytes of dual-ported memory on the VERSAbus. 
E 4
I 4
a
.Tn CMC ENP-20
controller.
.Pp
The hardware has 128 kilobytes of dual-ported memory on the
.Tn VERSAbus . 
E 4
This memory
is used for internal buffering by the board, and the interface code reads
D 4
the buffer contents directly through the VERSAbus.
E 4
I 4
the buffer contents directly through the
.Tn VERSAbus .
E 4
The address of this memory is derived from the address specified
in the configuration file.
D 4
.PP
E 4
I 4
.Pp
E 4
Each of the host's network addresses
D 4
is specified at boot time with an SIOCSIFADDR
ioctl.  The
.I ace
E 4
I 4
is specified at boot time with an
.Dv SIOCSIFADDR
.Xr ioctl 2 .
The
.Nm enp
E 4
interface employs the address resolution protocol described in
D 2
.IR arp (4P)
E 2
I 2
D 4
.IR arp (4)
E 4
I 4
.Xr arp 4
E 4
E 2
to dynamically map between Internet and Ethernet addresses on the local
network.
D 4
.PP
The interface normally tries to use a ``trailer'' encapsulation
E 4
I 4
.Pp
The interface normally tries to use a
.Dq trailer
encapsulation
E 4
to minimize copying data on input and output.
D 4
The use of trailers is negotiated with ARP.
E 4
I 4
The use of trailers is negotiated with
.Tn ARP .
E 4
This negotiation may be disabled, on a per-interface basis,
D 4
by setting the IFF_NOTRAILERS
flag with an SIOCSIFFLAGS ioctl.
.PP
E 4
I 4
by setting the
.Dv IFF_NOTRAILERS
flag with an
.Dv SIOCSIFFLAGS
.Xr ioctl .
.Pp
E 4
Associated with each interface is a character device which
is used to dowload, start, and reset the firmware in the controller.
D 4
Reading or writing the ``ram device'' reads or writes the writable
E 4
I 4
Reading or writing the
.Dq ram device
reads or writes the writable
E 4
control store in the controller.  Two
D 4
.IR ioctl (2)
calls, ENPIOGO and ENPIORESET, are used to start and reset the
E 4
I 4
.Xr ioctl 2
calls,
.Dv ENPIOGO
and
.Dv ENPIORESET ,
are used to start and reset the
E 4
firmware.
D 4
.SH DIAGNOSTICS
.BR "enp%d: can't handle af%d" .
E 4
I 4
.Sh DIAGNOSTICS
.Bl -diag
.It enp%d: can't handle af%d.
E 4
The interface was handed
a message with addresses formatted in an unsuitable address
family; the packet was dropped.
D 4
.SH SEE ALSO
D 2
intro(4N), inet(4F), arp(4P), enpload(8C)
E 2
I 2
intro(4), inet(4), arp(4), enpload(8)
E 2
.SH BUGS
E 4
I 4
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr inet 4 ,
.Xr arp 4 ,
.Xr enpload 8
.Sh HISTORY
The
.Nm
driver appeared in
.Bx 4.3 tahoe .
.Sh BUGS
E 4
The hardware is not capable of talking to itself.  The software
implements local sending and broadcast by sending such packets to the
loop interface.  This is a kludge.
D 4
.PP
E 4
I 4
.Pp
E 4
The link level firmware does not support setting the board's
Ethernet address.
E 1
