share/man/man4/man4.tahoe/SCCS/s.ik.4
h10455
s 00002/00002/00162
d D 8.1 93/06/05 13:42:19 bostic 4 3
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00131/00069/00033
d D 6.3 91/03/27 23:30:46 cael 3 2
c macro and text revision (-mdoc version 3)
e
s 00001/00001/00101
d D 6.2 87/06/30 21:22:21 sam 2 1
c update addresses to reflect change form 24 to 32 bit addresses 
c in config file; rewrite cy.4 and vd.4 as well as vx.4
e
s 00102/00000/00000
d D 6.1 86/11/29 12:14:55 sam 1 0
c date and time created 86/11/29 12:14:55 by sam
e
u
U
t
T
I 1
D 3
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 3
I 3
D 4
.\" Copyright (c) 1983, 1991 Regents of the University of California.
.\" All rights reserved.
E 4
I 4
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 4
E 3
.\"
D 3
.\"	%W% (Berkeley) %G%
E 3
I 3
.\" %sccs.include.redist.man%
E 3
.\"
D 3
.TH IK 4 "November 21, 1986"
.UC 5
.SH NAME
ik \- Evans and Sutherland Picture System 300 graphics device interface
.SH SYNOPSIS
D 2
.B "device ik0 at vba? csr 0xff8000 vector ikintr"
E 2
I 2
.B "device ik0 at vba? csr 0xfffb100 vector ikintr"
E 2
.SH DESCRIPTION
E 3
I 3
.\"     %W% (Berkeley) %G%
.\"
.Dd %Q%
.Dt IK 4
.Os BSD 4.2
.Sh NAME
.Nm ik
.Nd Evans and Sutherland Picture System 300 graphics device interface
.Sh SYNOPSIS
.Cd "device ik0 at vba? csr 0xfffb100 vector ikintr"
.Sh DESCRIPTION
E 3
The
D 3
.I ik
E 3
I 3
.Nm ik
E 3
driver provides access
to an Evans and
D 3
Sutherland Picture System 300 through an Ikon DR-11W
E 3
I 3
Sutherland Picture System 300 through an Ikon
.Tn DR-11W
E 3
interface card.
D 3
Each two minor device numbers are a different PS300;
E 3
I 3
Each two minor device numbers are a different
.Tn PS300 ;
E 3
within a pair of device numbers the odd valued
device is used for ``diagnostic'' purposes.   That is,
for even numbered minor devices, opening the device results
D 3
in a PS300 ``attach'' request being performed while for
E 3
I 3
in a
.Tn PS300
``attach'' request being performed while for
E 3
odd numbered minor devices the attach request is not performed.
D 3
.PP
All operations between the host and the PS300 utilize DMA.
The driver currently supports only ``physical i/o'' operations
E 3
I 3
.Pp
All operations between the host and the
.Tn PS300
utilize
.Tn DMA .
The driver currently supports only physical
.Tn I/O operations
E 3
when reading and writing; this makes the device useless with
standard Evans and Sutherland software.
D 3
.PP
The interface provided by the interface is as UNIX-like as possible.
When a device is opened a PS300 attach request is automatically
E 3
I 3
.Pp
The interface provided by the interface is as
.Ux Ns -like
as possible.
When a device is opened a
.Tn PS300
attach request is automatically
E 3
performed.  When a device is closed a detach is performed.  Reads
D 3
and writes result in physical i/o requests, but hide all the details
of the physical i/o protocol.  This is programming style is completely
different from the VMS-oriented qio-style interface supplied by Evans
E 3
I 3
and writes result in physical
.Tn I/O
requests, but hide all the details
of the physical
.Tn I/O
protocol.  This is programming style is completely
different from the
.Tn VMS Ns -oriented
qio-style interface supplied by Evans
E 3
and Sutherland.
D 3
.PP
Reads and writes to the device result in a physical i/o request
to the PS300.  If a
.IR readv (2)
E 3
I 3
.Pp
Reads and writes to the device result in a physical
.Tn I/O
request
to the
.Tn PS300 .
If a
.Xr readv 2
E 3
or
D 3
.IR writev (2)
call is used, each i/o request results in a single physical i/o
E 3
I 3
.Xr writev 2
call is used, each
.Tn I/O
request results in a single physical
.Tn I/O
E 3
request (i.e. the scatter-gather facilities are not supported).
D 3
In normal operation, the address used in a physical i/o request
E 3
I 3
In normal operation, the address used in a physical
.Tn I/O
request
E 3
is the current file offset as specified explicitly with
D 3
.IR lseek (2)
E 3
I 3
.Xr lseek 2
E 3
or implictly as a result of reading or writing the device.
D 3
To specify an address to be used with each physical i/o request,
E 3
I 3
To specify an address to be used with each physical
.Tn I/O
request,
E 3
the
D 3
.I ik
E 3
I 3
.Nm ik
E 3
driver interprets the
D 3
.I iov
E 3
I 3
.Ar iov
E 3
entries in a non-standard way.  If
D 3
.I iov_len
E 3
I 3
.Ar iov_len
E 3
is zero, then
D 3
.I iov_base
is interpreted as an address to be used in the physical i/o
request.  If the address has the PSIO_SYNC flag or-d into it,
the physical i/o request is made as a ``write with sync''.
E 3
I 3
.Ar iov_base
is interpreted as an address to be used in the physical
.Tn I/O
request.  If the address has the
.Dv PSIO_SYNC
flag or-d into it,
the physical
.Tn I/O
request is made as a ``write with sync''.
E 3
All addresses and data presented to the driver should be in
the byte order of the host; any byte swapping required to converse
D 3
with the PS300 is performed in the driver/controller.
.PP
E 3
I 3
with the
.Tn PS300
is performed in the driver/controller.
.Pp
E 3
In addition to reading and writing, the following
D 3
.I ioctl
E 3
I 3
.Xr ioctl
E 3
requests are available:
D 3
.TP
PSIOLOOKUP
.br
E 3
I 3
.Bl -tag -width PSIOGETERROR
.It Dv PSIOLOOKUP
E 3
Perform a ``name lookup'' request.  The
D 3
.I pslookup
E 3
I 3
.Ar pslookup
E 3
structure passed indicates the symbol name to be looked up
D 3
and contains the address returned by the PS300.  A zero
E 3
I 3
and contains the address returned by the
.Tn PS300 .
A zero
E 3
address return indicates the symbol was undefined.
D 3
.TP
PSIOGETERROR
.br
E 3
I 3
.It Dv PSIOGETERROR
E 3
In the event of an error, this request may be made to
D 3
return a more detailed and, sometimes PS300-specific,
E 3
I 3
return a more detailed and, sometimes
.Tn PS300 Ns -specific ,
E 3
error code.
D 3
.SH FILES
/dev/ik[0-7]	auto-attach devices
.br
/dev/ik[0-7]d	diagnostic interfaces to devices
.SH DIAGNOSTICS
\fBik%d: bad cmd %x\fP.
E 3
I 3
.Sh FILES
.Bl -tag -width /dec/ik[0-7]xx -compact
.It Pa /dev/ik[0-7]
auto-attach devices
.It Pa /dev/ik[0-7]d
diagnostic interfaces to devices
.El
.Sh DIAGNOSTICS
.Bl -diag
.It ik%d: bad cmd %x.
E 3
An unknown or unsupported command was received by the host.
D 3
.PP
\fBik%d: spurious interrupt, code %x\fP.
An unexpected interrupt was received from the PS300; the
attention code from the PS300 is printed.
.PP
\fBik%d: timeout\fP.
E 3
I 3
.It ik%d: spurious interrupt, code %x.
An unexpected interrupt was received from the
.Tn PS300 ;
the
attention code from the
.Tn PS300
is printed.
.It ik%d: timeout.
E 3
A command failed to elicit a response within a reasonable
D 3
time; the PS300 probably crashed.
.SH BUGS
An invalid access (e.g. illegal address) to the PS300 can
cause the PS300 to crash.  It is not always possible to unwedge
the PS300 interface hardware hung by an i/o request.
E 3
I 3
time; the
.Tn PS300
probably crashed.
.El
.Sh HISTORY
The
Tahoe Version
.Nm
driver appeared in
.Bx 4.2 .
.Sh BUGS
An invalid access (e.g. illegal address) to the
.Tn PS300
can
cause the
.Tn PS300
to crash.  It is not always possible to unwedge
the
.Tn PS300
interface hardware hung by an
.Tn I/O
request.
E 3
E 1
