share/man/man4/man4.tahoe/SCCS/s.lp.4
h42614
s 00002/00002/00031
d D 8.1 93/06/05 13:42:34 bostic 4 3
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00002/00002/00031
d D 6.3 91/07/24 19:45:15 cael 3 2
c fix .Os
e
s 00030/00018/00003
d D 6.2 91/03/27 23:30:47 cael 2 1
c macro and text revision (-mdoc version 3)
e
s 00021/00000/00000
d D 6.1 86/11/24 18:21:46 mckusick 1 0
c from CCI
e
u
U
t
T
I 1
D 2
.\" Copyright (c) 1986 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 2
I 2
D 4
.\" Copyright (c) 1986, 1991 Regents of the University of California.
.\" All rights reserved.
E 4
I 4
.\" Copyright (c) 1986, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 4
E 2
.\"
D 2
.\"	%W% (Berkeley) %G%
E 2
I 2
.\" %sccs.include.redist.man%
E 2
.\"
D 2
.TH LP 4 "%Q%"
.UC 7
.SH NAME
lp \- line printer
.SH SYNOPSIS
device lp on the VIOC-P
.SH DESCRIPTION
.I Lp
provides the interface to 4 serial
E 2
I 2
.\"     %W% (Berkeley) %G%
.\"
.Dd %Q%
.Dt LP 4 tahoe
D 3
.Os 4.3t
E 3
I 3
.Os BSD 4.3t
E 3
.Sh NAME
.Nm lp
.Nd line printer
.Sh SYNOPSIS
device lp on the
.Tn VIOC-P
.Sh DESCRIPTION
The
.Nm lp
driver provides an interface to 4 serial
E 2
printer lines.
D 2
.SH FILES
/dev/lp
.SH "SEE ALSO"
lpr(1),
vioc(4)
E 2
I 2
.Sh FILES
.Bl -tag -width /dev/lpxx
.It Pa /dev/lp
.El
.Sh SEE ALSO
.Xr lpr 1 ,
.Xr vioc 4
.Sh HISTORY
The
D 3
.Nm
E 3
I 3
.Nm lp
E 3
driver appeared in
.Bx 4.3 tahoe .
E 2
E 1
