usr.bin/fstat/SCCS/s.fstat.1
h33567
s 00003/00002/00190
d D 8.3 94/02/25 01:41:25 pendry 17 16
c clarify -f option
e
s 00001/00000/00191
d D 8.2 94/02/16 08:21:48 bostic 16 15
c add -p flag, missing from synopsis
e
s 00002/00002/00189
d D 8.1 93/06/06 14:40:23 bostic 15 14
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00006/00000/00185
d D 5.13 93/05/25 14:29:24 mckusick 14 13
c add description of R/W field
e
s 00001/00001/00184
d D 5.12 91/07/22 17:46:51 cael 13 12
c fix history
e
s 00013/00003/00172
d D 5.11 91/04/23 16:24:07 bostic 12 11
c add -M, -N
e
s 00115/00090/00060
d D 5.10 91/04/22 19:13:09 cael 11 9
c mdoc conversion and bsd copyright notice
e
s 00116/00091/00059
d R 5.10 91/04/22 14:19:31 cael 10 9
c mdoc conversion
e
s 00002/00012/00148
d D 5.9 91/04/18 15:06:56 bostic 9 8
c new copyright; att/bsd/shared
e
s 00072/00029/00088
d D 5.8 90/10/04 09:34:28 marc 8 7
c bring manpage up to date
e
s 00001/00001/00116
d D 5.7 90/06/22 18:55:09 bostic 7 6
c mv fstat from section 8 to section 1
e
s 00002/00000/00115
d D 5.6 89/08/15 16:14:38 mckusick 6 5
c note description used for remote filesystems
e
s 00038/00040/00077
d D 5.5 89/03/01 11:49:49 bostic 5 4
c rework to make a bit clearer, minor man page syntax stuff;
e
s 00010/00005/00107
d D 5.4 88/07/09 11:32:02 bostic 4 3
c install approved copyright notice
e
s 00027/00025/00085
d D 5.3 87/12/12 18:26:32 marc 3 2
c Berkeley version, remove user interface garbadge
e
s 00004/00001/00106
d D 5.2 87/10/11 00:00:33 marc 2 1
c Initial checkin to sccs.  Revamp -f flag.
e
s 00107/00000/00000
d D 5.1 87/10/10 23:53:08 marc 1 0
c date and time created 87/10/10 23:53:08 by marc
e
u
U
t
T
I 1
D 3
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 3
I 3
D 9
.\" Copyright (c) 1987 Regents of the University of California.
E 9
I 9
D 11
.\" Copyright (c) 1987 The Regents of the University of California.
E 11
I 11
D 15
.\" Copyright (c) 1987, 1991 Regents of the University of California.
E 11
E 9
.\" All rights reserved.
E 15
I 15
.\" Copyright (c) 1987, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 15
E 3
.\"
I 3
D 9
.\" Redistribution and use in source and binary forms are permitted
D 4
.\" provided that this notice is preserved and that due credit is given
.\" to the University of California at Berkeley. The name of the University
.\" may not be used to endorse or promote products derived from this
.\" software without specific prior written permission. This software
.\" is provided ``as is'' without express or implied warranty.
E 4
I 4
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 9
I 9
.\" %sccs.include.redist.roff%
E 9
E 4
.\"
E 3
D 11
.\"	%W% (Berkeley) %G%
E 11
I 11
.\"     %W% (Berkeley) %G%
E 11
.\"
D 7
.TH FSTAT 8 "%Q%"
E 7
I 7
D 11
.TH FSTAT 1 "%Q%"
E 7
.UC 4
.SH NAME
fstat \- file status
.SH SYNOPSIS
.B fstat
[
.B \-u
user ] [
.B \-p
pid ] [
I 8
.B \-fnv ] [
E 8
D 3
.B \-f
filename ]
.br
D 2
.B fstat filename
E 2
I 2
.B fstat filename [ filename... ]
E 3
I 3
.B filename... 
]
E 3
E 2
.SH DESCRIPTION
.I Fstat
E 11
I 11
.Dd %Q%
.Dt FSTAT 1
.Os BSD 4
.Sh NAME
.Nm fstat
.Nd file status
.Sh SYNOPSIS
.Nm fstat
.Op Fl fnv
D 12
.Op Fl p Ar pid
E 12
I 12
.Op Fl M Ar core
.Op Fl N Ar system
I 16
.Op Fl p Ar pid
E 16
E 12
.Op Fl u Ar user
.Op Ar filename...
.Sh DESCRIPTION
.Nm Fstat
E 11
identifies open files.
D 8
A file is considered open if a process has it open,
if it is the working directory for a process,
or if it is an active pure text file.
E 8
I 8
A file is considered open by a process if it was explicitly opened,
is the working directory, root directory, active pure text, or kernel
trace file for that process.
E 8
If no options are specified,
D 11
.I fstat
E 11
I 11
.Nm fstat
E 11
D 8
reports on all open files.
E 8
I 8
reports on all open files in the system.
E 8
D 11
.PP
E 11
I 11
.Pp
E 11
Options:
D 11
.TP 6
.B  \-u
D 5
Report all files open by a specified user.
E 5
I 5
Report all files open by the specified user.
E 5
.TP 6
.B  \-p
D 5
Report all files open by a specified process id.
E 5
I 5
Report all files open by the specified process.
E 5
.TP 6
I 8
.B  \-f
If additional filename arguments are present, restrict to files
that are open in the same filesystem as the named file arguments.
For example, to find all files open in the filesystem that the
directory "/usr/src" resides in, type "fstat -f /usr/src".
.TP 6
.B  \-n
E 11
I 11
.Bl -tag -width Ds
.It Fl f
D 17
If additional filename arguments are present, restrict examination to files
open in the same filesystem as the named file arguments.
E 17
I 17
Restrict examination to files open in the same filesystems as
the named file arguments, or to the filesystem containing the
current directory if there are no additional filename arguments.
E 17
For example, to find all files open in the filesystem where the
directory
.Pa /usr/src
resides, type
.Dq Li fstat -f /usr/src .
I 12
.It Fl M
Extract values associated with the name list from the specified core
instead of the default
.Pa /dev/kmem .
.It Fl N
Extract the name list from the specified system instead of the default
.Pa /vmunix .
E 12
.It Fl n
E 11
Numerical format.  Print the device number (maj,min) of the filesystem
the file resides in rather than the mount point name; for special
files, print the
device number that the special device refers to rather than the filename
D 11
in /dev; and print the mode of the file in octal instead of symbolic form.
.TP 6
.B  \-v
E 11
I 11
in
.Pa /dev ;
and print the mode of the file in octal instead of symbolic form.
.It Fl p
Report all files open by the specified process.
.It Fl u
Report all files open by the specified user.
.It Fl v
E 11
Verbose mode.  Print error messages upon failures to locate particular
system data structures rather than silently ignoring them.  Most of
D 11
these data structures are dynamically created and deleted and it is
possible for them to disappear while fstat is running.  This
E 11
I 11
these data structures are dynamically created or deleted and it is
possible for them to disappear while
.Nm fstat
is running.  This
E 11
is normal and  unavoidable since the rest of the system is running while
D 11
fstat itself is running.
.TP 6
E 8
D 3
.B  \-f
Restrict reports to the specified file.
E 3
I 3
.B filename...
E 11
I 11
.Nm fstat
itself is running.
.It Ar filename ...
E 11
Restrict reports to the specified files.
E 3
D 8
If the file is a block special file,
.I fstat
additionally reports on any open files on that device,
treating it as a mounted file system.  
E 8
D 11
.PP
E 11
I 11
.El
.Pp
E 11
D 3
If more than one type of option is specified, files
must match the criteria of each option specified.
I 2
More than one file flag may be present.  In particular,
one may say "fstat foo* bar*" and the right thing will
happen.
E 2
.PP
E 3
D 5
The following fields are printed
E 5
I 5
The following fields are printed:
E 5
D 11
.TP 6
.B  USER
E 11
I 11
.Bl -tag -width MOUNT
.It Li USER
E 11
D 8
The username of the owner of the process.
E 8
I 8
The username of the owner of the process (effective uid).
E 8
D 11
.TP 6
.B CMD
E 11
I 11
.It Li CMD
E 11
The command name of the process.
D 11
.TP 6
.B PID
E 11
I 11
.It Li PID
E 11
The process id.
D 11
.TP 6
.B FD
E 11
I 11
.It Li FD
E 11
D 8
The file number in the per-process open file table.  The special
D 5
names "text" and "wd" mean that the file is the pure text inode
or the working directory for the process.  If the file number is
followed by an asterick (*), then the file is not an inode, but
either a socket, fifo, or has an error of some kind. In this case
the rest of the entry is variable format, doesn't correspond
to the rest of the
headings, and is
enclosed in parenthesis.
The following paragraph describing sockets will explain the
variable format.
E 5
I 5
names ``text'' and ``wd'' mean that the file is the pure text inode
or the working directory for the process.
If the file number is followed by an asterisk (``*''), then the file is
not an inode, but is a socket or a FIFO or has an error of some kind.
In this case the rest of the entry is in variable format, doesn't
correspond to the rest of the headings, and is enclosed in parentheses.
I 6
If the file resides on a remote filesystem, the device, inode,
and size fields are replaced by the text ``from remote filesystem''.
E 8
I 8
The file number in the per-process open file table or one of the following
special names:
D 11
.sp
.nf
	text	- pure text inode
	wd 	- current working directory
	root	- root inode
	tr	- kernel trace file
.fi
.sp
E 11
I 11
.Pp
.Bd -ragged -offset indent -compact
text	- pure text inode
wd 	- current working directory
root	- root inode
tr	- kernel trace file
.Ed
.Pp
E 11
If the file number is followed by an asterisk (``*''), the file is
D 11
not an inode, but rather a socket, FIFO, or there is an error.
E 11
I 11
not an inode, but rather a socket,
.Tn FIFO ,
or there is an error.
E 11
In this case the remainder of the line doesn't
correspond to the remaining headers -- the format of the line
D 11
is described later under "Sockets".
E 8
E 6
E 5
.TP 6
D 8
.B DEVICE
D 5
Major minor number of the device this file exists on.
E 5
I 5
Major/minor number of the device this file exists on.
E 8
I 8
.B MOUNT
If the -n flag wasn't specified, this header is present and is the
E 11
I 11
is described later under
.Sx Sockets .
.It Li MOUNT
If the
.Fl n
flag wasn't specified, this header is present and is the
E 11
pathname that the filesystem the file resides in is mounted on.
E 8
E 5
D 11
.TP 6
D 8
.B INODE
E 8
I 8
.B DEV
If the -n flag is specified, this header is present and is the
E 11
I 11
.It Li DEV
If the
.Fl n
flag is specified, this header is present and is the
E 11
major/minor number of the device that this file resides in.
D 11
.TP 6
.B INUM
E 11
I 11
.It Li INUM
E 11
E 8
The inode number of the file.
D 11
.TP 6
D 8
.B SIZE
D 5
The size in bytes of the file.
E 5
I 5
The size, in bytes, of the file.
E 8
I 8
.B MODE
The mode of the file.  If the -n flag isn't specified, the mode is printed
using a symbolic format (see strmode(3)); otherwise, the mode is printed
E 11
I 11
.It Li MODE
The mode of the file.  If the
.Fl n
flag isn't specified, the mode is printed
using a symbolic format (see
.Xr strmode 3 ) ;
otherwise, the mode is printed
E 11
as an octal number.
E 8
E 5
D 11
.TP 6
D 8
.B TYPE
D 5
The type of the file. (see stat(2))
.PP
Sockets
.sp1 6
D 3
The variable formatting of open sockets depends on the protocol domain of the socket.  In
all cases the first field is the name of the domain, the second field
E 3
I 3
The formating of open sockets depends on the protocol domain.  In
all cases the first field is the domain name, the second field
E 5
I 5
The type of the file (see
.IR stat (2)).
E 8
I 8
.B SZ|DV
E 11
I 11
.It Li SZ\&|DV
E 11
If the file is not a character or block special, prints the size of
D 11
the file in bytes.  Otherwise, if the -n flag is not specified, prints
the name of the special file as located in /dev.  If that cannot be
located, or the -n flag is specified, prints the major/minor device
E 11
I 11
the file in bytes.  Otherwise, if the
.Fl n
flag is not specified, prints
the name of the special file as located in
.Pa /dev .
If that cannot be
located, or the
.Fl n
flag is specified, prints the major/minor device
E 11
number that the special device refers to.
I 14
.It Li R/W
This column describes the access mode that the file allows.
The letter ``r'' indicates open for reading;
the letter ``w'' indicates open for writing.
This field is useful when trying to find the processes that are
preventing a filesystem from being down graded to read-only.
E 14
D 11
.TP 6
.B NAME
If filename arguments are specified and the -f flag is not, then
E 11
I 11
.It Li NAME
If filename arguments are specified and the
.Fl f
flag is not, then
E 11
this field is present and is the name associated with the given file.
Normally the name cannot be determined since there is no mapping
from an open file back to the directory entry that was used to open
that file.  Also, since different directory entries may reference
D 11
the same file (via ln(2)), the name printed may not be the actual
E 11
I 11
the same file (via
.Xr ln 2 ) ,
the name printed may not be the actual
E 11
name that the process originally used to open that file.
E 8
D 11
.SH Sockets
E 11
I 11
.El
.Sh SOCKETS
E 11
The formating of open sockets depends on the protocol domain.
In all cases the first field is the domain name, the second field
E 5
E 3
is the socket type (stream, dgram, etc), and the third is the socket
D 3
flags (in hex).  The rest are protocol dependent.  For tcp,
it is the address of the tcpcb, for udp,
the inpcb (socket pcb).  For unix domain, its the address of the socket
E 3
I 3
D 5
flags field (in hex).  The remaining fields are protocol dependent.  For tcp,
it is the address of the tcpcb, and for udp,
the inpcb (socket pcb).  For unix domain sockets, its the address of the socket
E 3
pcb and the address of the connected pcb (if connected).  Otherwise
the protocol number and address of the socket itself are printed. The
idea is not to duplicate netstat, but to make available enough
information for further analysis.  For example, the addresses mentioned
above are the addresses which the "netstat -A" command would print for
tcp, udp, and unixdomain.  Note that since pipe(2) is implemented
D 3
with sockets, a pipe appears as a connected unixdomain stream socket.
E 3
I 3
with sockets, a pipe appears as a connected unix domain stream socket.
A unidirectional unix domain socket indicates the direction of
flow with an arrow ("<-" or "->"), and a full duplex socket shows
a double arrow ("<->").
E 3
.dt
D 3
.SH "BUGS"
Socket information clutters the output.  It should be possible
to specify more than one of each type of argument. A logical or
connective would be nice.
E 3
I 3
.SH BUGS
Socket information clutters the output.
E 5
I 5
flags field (in hex).
The remaining fields are protocol dependent.
For tcp, it is the address of the tcpcb, and for udp, the inpcb (socket pcb).
For unix domain sockets, its the address of the socket pcb and the address
of the connected pcb (if connected).
Otherwise the protocol number and address of the socket itself are printed.
D 8
The attempt is to not duplicate
.IR netstat (1),
but rather to make enough information available to permit further analysis.
E 8
I 8
The attempt is to make enough information available to 
permit further analysis without duplicating
D 11
.IR netstat (1).
E 8
E 5
.PP
E 11
I 11
.Xr netstat 1 .
.Pp
E 11
D 5
Since \fIfstat\fP takes a snapshot of the system, it is only correct for
a very short period of time.
E 5
I 5
For example, the addresses mentioned above are the addresses which the
D 11
``netstat -A'' command would print for tcp, udp, and unixdomain.
E 11
I 11
.Dq Li netstat -A
command would print for tcp, udp, and unixdomain.
E 11
Note that since pipes are implemented using sockets, a pipe appears as a
connected unix domain stream socket.
A unidirectional unix domain socket indicates the direction of flow with
an arrow (``<-'' or ``->''), and a full duplex socket shows a double arrow
(``<->'').
D 11
.SH BUGS
E 11
I 11
.Sh BUGS
E 11
Since
D 11
.I fstat
E 11
I 11
.Nm fstat
E 11
takes a snapshot of the system, it is only correct for a very short period
of time.
E 5
E 3
D 11
.SH "SEE ALSO"
D 5
ps(1), stat(2), pstat(8)
E 5
I 5
netstat(1), ps(1), systat(1), stat(2), pstat(8)
E 11
I 11
.Sh SEE ALSO
.Xr netstat 1 ,
I 12
.Xr nfsstat 1 ,
E 12
.Xr ps 1 ,
.Xr systat 1 ,
D 12
.Xr stat 2 ,
E 12
I 12
.Xr vmstat 1 ,
.Xr iostat 8 ,
E 12
.Xr pstat 8
.Sh HISTORY
The
.Nm
command appeared in
D 12
.Bx 4.2 .
E 12
I 12
D 13
.Bx 4.4 .
E 13
I 13
.Bx 4.3 tahoe .
E 13
E 12
E 11
E 5
E 1
