usr.bin/rdist/SCCS/s.rdist.1
h65334
s 00002/00002/00384
d D 8.3 94/03/17 05:34:09 bostic 16 15
c typos
e
s 00002/00002/00384
d D 8.2 93/12/30 15:39:08 mckusick 15 14
c copyediting for Usenix manuals
e
s 00002/00002/00384
d D 8.1 93/06/09 22:50:05 bostic 14 13
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00001/00001/00385
d D 6.12 93/01/09 10:34:06 bostic 13 12
c typo
e
s 00066/00082/00320
d D 6.11 91/07/27 17:40:58 cael 12 11
c mdoc version three
e
s 00002/00000/00400
d D 6.10 91/03/14 00:25:48 cael 11 9
c add .Vx so tmac.andoc will call tmac.mdoc-old
e
s 00001/00000/00400
d R 6.10 91/03/13 20:37:04 cael 10 9
c add .Vx so tmac.andoc will call tmac.mdoc-old
e
s 00004/00004/00396
d D 6.9 90/07/24 22:50:46 cael 9 8
c .Xr botch fix
e
s 00235/00198/00165
d D 6.8 90/06/11 06:00:08 cael 8 7
c converted man page
e
s 00014/00003/00349
d D 6.7 88/09/20 17:17:22 bostic 7 6
c Berkeley copyright
e
s 00001/00001/00351
d D 6.6 86/05/13 09:24:11 anne 6 5
c missing word
e
s 00003/00003/00349
d D 6.5 86/05/12 09:01:44 anne 5 4
c grammar
e
s 00021/00007/00331
d D 6.4 86/05/11 21:27:44 lepreau 4 3
c doc non-empty dirs (mis?)feature; version # mismatch might be something else;
c expcept_pat example was wrong; negative mtimes cause abort; minor fomratting
e
s 00001/00001/00337
d D 6.3 86/03/27 11:07:44 kjd 3 2
c Change example format host.user to user@host
e
s 00002/00001/00336
d D 6.2 85/05/16 17:20:31 bloom 2 1
c Also check for Distfile as well as distfile
e
s 00337/00000/00000
d D 6.1 85/04/29 21:54:57 mckusick 1 0
c manual page first distributed with 4.3BSD
e
u
U
t
T
I 1
D 7
.\" Copyright (c) 1985 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 7
I 7
D 8
.\" Copyright (c) 1985 The Regents of the University of California.
E 8
I 8
D 14
.\" Copyright (c) 1985, 1990 The Regents of the University of California.
E 8
.\" All rights reserved.
E 14
I 14
.\" Copyright (c) 1985, 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 14
.\"
D 8
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 8
I 8
D 12
.\" %sccs.include.redist.man%
E 12
I 12
.\" %sccs.include.redist.roff%
E 12
E 8
E 7
.\"
D 8
.\"	%W% (Berkeley) %G%
E 8
I 8
D 12
.\"     %W% (Berkeley) %G%
E 12
I 12
.\"	%W% (Berkeley) %G%
E 12
E 8
.\"
I 11
D 12
.Vx
.Vx
E 12
E 11
D 8
.TH RDIST 1 "%Q%"
.UC 6
.ad
.SH NAME
rdist \- remote file distribution program
.SH SYNOPSIS
.B rdist
[ \-nqbRhivwy ]
[ \-f distfile ] [ \-d var=value ] [ \-m host ]
[ name ... ]
.PP
.B rdist
[ \-nqbRhivwy ] -c name ... [login@]host[:dest]
.SH DESCRIPTION
.I Rdist
is a program to maintain identical copies of files over multiple hosts. 
E 8
I 8
.Dd %Q%
.Dt RDIST 1
.Os BSD 4.3
.Sh NAME
.Nm rdist
.Nd remote file distribution program
.Sh SYNOPSIS
.Nm rdist
.Op Fl nqbRhivwy
.Op Fl f Ar distfile
.Op Fl d Ar var=value
D 13
.Op Fl m host
E 13
I 13
.Op Fl m Ar host
E 13
.Op Ar name ...
D 12
.Pp
E 12
.Nm rdist
.Op Fl nqbRhivwy
.Fl c
.Ar name ...
D 12
.Cx Op login@
.Ar host
.Op :dest
.Cx
E 12
I 12
.Oo login@ Oc Ns Ar host Ns Op :dest
E 12
.Sh DESCRIPTION
.Nm Rdist
is a program to maintain identical copies of files over multiple hosts.
E 8
It preserves the owner, group, mode, and mtime of files if possible and
can update programs that are executing.
D 8
.I Rdist
E 8
I 8
.Nm Rdist
E 8
reads commands from
D 8
.I distfile
E 8
I 8
.Ar distfile
E 8
to direct the updating of files and/or directories.
I 8
.Pp
Options specific to the first SYNOPSIS form:
.Pp
D 9
.Tw Ar
E 9
I 9
D 12
.Tw Fl
E 9
.Tp Fl 
E 12
I 12
.Bl -tag -width indent
.It Fl
E 12
E 8
If
D 8
.I distfile
is `\-', the standard input is used.
If no
.B \-f
D 2
option is present, the file `distfile' is used for input.
E 2
I 2
option is present, the program looks first for `distfile',
then `Distfile' to use as the input.
E 8
I 8
.Ar distfile
is
D 9
.Fl ,
E 9
I 9
.Sq Fl ,
E 9
the standard input is used.
D 12
.Tp Cx Fl f
.Cx \&\ \&
.Ar distfile
.Cx
E 12
I 12
.It Fl f Ar distfile
E 12
Use the specified
.Ar distfile.
D 12
.Tp
E 12
I 12
.El
E 12
.Pp
If either the
.Fl f
or
D 9
.Fl
E 9
I 9
.Sq Fl
E 9
option is not specified, the program looks first for
.Dq Pa distfile ,
then
.Dq Pa Distfile
to use as the input.
E 8
E 2
If no names are specified on the command line,
D 8
.I rdist
E 8
I 8
.Nm rdist
E 8
will update all of the files and directories listed in
D 8
.IR distfile .
E 8
I 8
.Ar distfile  .
E 8
Otherwise, the argument is taken to be the name of a file to be updated
or the label of a command to execute. If label and file names conflict,
it is assumed to be a label.
These may be used together to update specific files
using specific commands.
D 8
.PP
The
.B \-c
option forces
.I rdist
E 8
I 8
.Pp
Options specific to the second SYNOPSIS form:
.Pp
D 12
.Tp Fl c
E 12
I 12
.Bl -tag -width Fl c
.It Fl c
E 12
Forces
.Nm rdist
E 8
to interpret the remaining arguments as a small
D 8
.IR distfile .
E 8
I 8
.Ar distfile  .
.Pp
E 8
The equivalent distfile is as follows.
D 8
.nf

.ti +.5i
( \fIname\fP ... ) -> [\fIlogin\fP@]\fIhost\fP
.ti +1i
install	[\fIdest\fP] ;

.fi
.PP
Other options:
.TP
.B \-d
E 8
I 8
.Pp
D 12
.Df I
E 12
I 12
.Bd -filled -offset indent -compact
E 12
.Pq Ar name ...
.Li ->
.Op Ar login@
.Ar host
D 12
.Df I
E 12
I 12
.Bd -filled -offset indent -compact
E 12
.Li install
.Op Ar dest ;
D 12
.De
.De
.Tp
E 12
I 12
.Ed
.Ed
.El
E 12
.Pp
Options common to both forms:
.Pp
D 12
.Tw Ic
.Tp Cx Fl d
.Cx \&\ \&
.Ar var=value
.Cx
E 12
I 12
.Bl -tag -width Ic
.It Fl b
Binary comparison. Perform a binary comparison and update files if they differ
rather than comparing dates and sizes.
.It Fl d Ar var=value
E 12
E 8
Define
D 8
.I var
E 8
I 8
.Ar var
E 8
to have
D 8
.IR value .
E 8
I 8
.Ar value  .
E 8
The
D 8
.B \-d
E 8
I 8
.Fl d
E 8
option is used to define or override variable definitions in the
D 8
.IR distfile .
.I Value
E 8
I 8
.Ar distfile  .
.Ar Value
E 8
can be the empty string, one name, or a list of names surrounded by
parentheses and separated by tabs and/or spaces.
D 8
.TP
.B \-m
E 8
I 8
D 12
.Tp Cx Fl m
.Cx \&\ \&
.Ar host
.Cx
E 12
I 12
.It Fl h
Follow symbolic links. Copy the file that the link points to rather than the
link itself.
.It Fl i
Ignore unresolved links.
.Nm Rdist
D 16
will normally try to maintain the link structure of files being transfered
E 16
I 16
will normally try to maintain the link structure of files being transferred
E 16
and warn the user if all the links cannot be found.
.It Fl m Ar host
E 12
E 8
Limit which machines are to be updated. Multiple
D 8
.B -m
E 8
I 8
.Fl m
E 8
D 15
arguments can be given to limit updates to a subset of the hosts listed the
E 15
I 15
arguments can be given to limit updates to a subset of the hosts listed in the
E 15
D 8
.IR distfile .
.TP
.B \-n
E 8
I 8
.Ar distfile  .
D 12
.Tp Fl n
E 12
I 12
.It Fl n
E 12
E 8
Print the commands without executing them. This option is
useful for debugging
D 8
.IR distfile .
.TP
.B \-q
E 8
I 8
.Ar distfile  .
D 12
.Tp Fl q
E 12
I 12
.It Fl q
E 12
E 8
Quiet mode. Files that are being modified are normally
printed on standard output. The
D 8
.B \-q
E 8
I 8
.Fl q
E 8
option suppresses this.
D 8
.TP
.B \-R
E 8
I 8
D 12
.Tp Fl R
E 12
I 12
.It Fl R
E 12
E 8
Remove extraneous files. If a directory is being updated, any files that exist
on the remote host that do not exist in the master directory are removed.
D 15
This is useful for maintaining truely identical copies of directories.
E 15
I 15
This is useful for maintaining truly identical copies of directories.
E 15
D 8
.TP
.B \-h
E 8
I 8
D 12
.Tp Fl h
E 8
Follow symbolic links. Copy the file that the link points to rather than the
link itself.
D 8
.TP
.B \-i
E 8
I 8
.Tp Fl i
E 8
Ignore unresolved links.
D 8
.I Rdist
E 8
I 8
.Nm Rdist
E 8
will normally try to maintain the link structure of files being transfered
and warn the user if all the links cannot be found.
D 8
.TP
.B \-v
E 8
I 8
.Tp Fl v
E 12
I 12
.It Fl v
E 12
E 8
Verify that the files are up to date on all the hosts. Any files
that are out of date will be displayed but no files will be changed
nor any mail sent.
D 8
.TP
.B \-w
E 8
I 8
D 12
.Tp Fl w
E 12
I 12
.It Fl w
E 12
E 8
Whole mode. The whole file name is appended to the destination directory
name. Normally, only the last component of a name is used when renaming files.
This will preserve the directory structure of the files being
copied instead of flattening the directory structure. For example,
renaming a list of files such as ( dir1/f1 dir2/f2 ) to dir3 would create
files dir3/dir1/f1 and dir3/dir2/f2 instead of dir3/f1 and dir3/f2.
D 8
.TP
.B \-y
E 8
I 8
D 12
.Tp Fl y
E 12
I 12
.It Fl y
E 12
E 8
Younger mode. Files are normally updated if their
D 8
.I mtime
E 8
I 8
.Ar mtime
E 8
and
D 8
.I size
E 8
I 8
.Ar size
E 8
(see
D 8
.IR stat (2))
E 8
I 8
.Xr stat  2  )
E 8
disagree. The
D 8
.B \-y
E 8
I 8
.Fl y
E 8
option causes
D 8
.I rdist
E 8
I 8
.Nm rdist
E 8
not to update files that are younger than the master copy.
This can be used
to prevent newer copies on other hosts from being replaced.
A warning message is printed for files which are newer than the master copy.
D 8
.TP
.B \-b
E 8
I 8
D 12
.Tp Fl b
E 8
Binary comparison. Perform a binary comparison and update files if they differ
rather than comparing dates and sizes.
D 8
.PP
.I Distfile
E 8
I 8
.Tp
E 12
I 12
.El
E 12
.Pp
.Ar Distfile
E 8
contains a sequence of entries that specify the files
to be copied, the destination hosts, and what operations to perform
to do the updating. Each entry has one of the following formats.
D 8
.nf

.in +.5i
E 8
I 8
.Pp
D 12
.Ds I
E 12
I 12
.Bd -literal -offset indent -compact
E 12
E 8
<variable name> `=' <name list>
D 8
[ label: ] <source list> `\->' <destination list> <command list>
[ label: ] <source list> `::' <time_stamp file> <command list>
.in

.fi
E 8
I 8
[label:]<source list> `\->' <destination list> <command list>
[label:]<source list> `::' <time_stamp file> <command list>
D 12
.De
E 12
I 12
.Ed
E 12
.Pp
E 8
The first format is used for defining variables.
The second format is used for distributing files to other hosts.
The third format is used for making lists of files that have been changed
since some given date.
D 8
The \fIsource list\fP specifies a
E 8
I 8
The
.Ar source list
specifies a
E 8
list of files and/or directories on the local host which are to be used
as the master copy for distribution.
D 5
The \fIdestination list\fP is the list of hosts these files are to be
copied to.  Each file in the source list is added to a list of changes
if the file is out of date on the host being updated (second format) or
E 5
I 5
D 8
The \fIdestination list\fP is the list of hosts to which these files are to be
E 8
I 8
The
.Ar destination list
is the list of hosts to which these files are to be
E 8
D 6
to.  Each file in the source list is added to a list of changes
E 6
I 6
copied.  Each file in the source list is added to a list of changes
E 6
if the file is out of date on the host which is being updated (second format) or
E 5
the file is newer than the time stamp file (third format).
D 8
.PP
E 8
I 8
.Pp
E 8
Labels are optional. They are used to identify a command for partial updates.
D 8
.PP
E 8
I 8
.Pp
E 8
Newlines, tabs, and blanks are only used as separators and are
otherwise ignored. Comments begin with `#' and end with a newline.
D 8
.PP
E 8
I 8
.Pp
E 8
Variables to be expanded begin with `$' followed by one character or
a name enclosed in curly braces (see the examples at the end).
D 8
.PP
E 8
I 8
.Pp
E 8
The source and destination lists have the following format:
D 8
.nf

.ti +.5i
E 8
I 8
D 12
.Pp
.Ds I
E 12
I 12
.Bd -literal -offset indent
E 12
E 8
<name>
I 8
D 12
.De
E 12
I 12
.Ed
E 12
E 8
or
D 8
.ti +.5i
E 8
I 8
D 12
.Ds I
E 12
I 12
.Bd -literal -offset indent -compact
E 12
E 8
`(' <zero or more names separated by white-space> `)'
D 8

.fi
E 8
I 8
D 12
.De
E 12
I 12
.Ed
E 12
.Pp
E 8
The shell meta-characters `[', `]', `{', `}', `*', and `?'
are recognized and expanded (on the local host only) in the same way as
D 8
.IR csh (1).
E 8
I 8
.Xr csh  1  .
E 8
They can be escaped with a backslash.
The `~' character is also expanded in the same way as
D 8
.IR csh
E 8
I 8
.Xr csh 1
E 8
but is expanded separately on the local and destination hosts.
When the
D 8
.B \-w
E 8
I 8
.Fl w
E 8
option is used with a file name that begins with `~', everything except the
home directory is appended to the destination name.
File names which do not begin with `/' or `~' use the destination user's
home directory as the root directory for the rest of the file name.
D 8
.PP
E 8
I 8
.Pp
E 8
The command list consists of zero or more commands of the following
format.
D 8
.nf

.in +.5i
.ta \w'install    'u +\w'name list    'u
`install'	<options>	opt_dest_name `;'
`notify'	<name list>	`;'
`except'	<name list>	`;'
`except_pat'	<pattern list>	`;'
`special'	<name list>	string `;'
.in

.fi
.PP
E 8
I 8
D 12
.Ds I
.Cw except_patx pattern\ listx
.Cl `install'	<options>	opt_dest_name `;'
.Cl `notify'	<name list>	`;'
.Cl `except'	<name list>	`;'
.Cl `except_pat'	<pattern list>	`;'
.Cl `special'	<name list>	string `;'
.Cw
.De
E 12
I 12
.Bd -ragged -offset indent -compact
.Bl -column except_patx pattern\ listx
.It `install'	<options>	opt_dest_name `;'
.It `notify'	<name list>	`;'
.It `except'	<name list>	`;'
.It `except_pat'	<pattern list>	`;'
.It `special'	<name list>	string `;'
.El
.Ed
E 12
.Pp
E 8
The
D 8
.I install
E 8
I 8
.Ic install
E 8
command is used to copy out of date files and/or directories.
Each source file is copied to each host in the destination list.
Directories are recursively copied in the same way.
D 8
.I Opt_dest_name
E 8
I 8
.Ar Opt_dest_name
E 8
is an optional parameter to rename files.
If no
D 8
.I install
E 8
I 8
.Ic install
E 8
command appears in the command list or
the destination name is not specified,
the source file name is used.
Directories in the path name will be created if they
do not exist on the remote host.
I 4
To help prevent disasters, a non-empty directory on a target host will
never be replaced with a regular file or a symbolic link.
However, under the `\-R' option a non-empty directory will be removed
if the corresponding filename is completely absent on the master host.
E 4
The
D 8
.I options
E 8
I 8
.Ar options
E 8
are `\-R', `\-h', `\-i', `\-v', `\-w', `\-y', and `\-b'
and have the same semantics as
options on the command line except they only apply to the files
in the source list.
The login name used on the destination host is the same as the local host
unless the destination name is of the format ``login@host".
D 8
.PP
E 8
I 8
.Pp
E 8
The
D 8
.I notify
E 8
I 8
.Ic notify
E 8
command is used to mail the list of files updated (and any errors
D 16
that may have occured) to the listed names.
E 16
I 16
that may have occurred) to the listed names.
E 16
If no `@' appears in the name, the destination host is appended to
the name
(e.g., name1@host, name2@host, ...).
D 8
.PP
E 8
I 8
.Pp
E 8
The
D 8
.I except
E 8
I 8
.Ic except
E 8
command is used to update all of the files in the source list
D 8
.B except
for the files listed in \fIname list\fP.
E 8
I 8
.Ic except
for the files listed in
.Ar name list  .
E 8
D 4
This is mostly used to copy everything in a directory except certain files.
E 4
I 4
This is usually used to copy everything in a directory except certain files.
E 4
D 8
.PP
E 8
I 8
.Pp
E 8
The
D 8
.I except_pat
E 8
I 8
.Ic except_pat
E 8
command is like the
D 8
.I except
command except that \fIpattern list\fP is a list of regular expressions
E 8
I 8
.Ic except
command except that
.Ar pattern list
is a list of regular expressions
E 8
(see
D 8
.IR ed (1)
E 8
I 8
.Xr ed  1
E 8
for details).
If one of the patterns matches some string within a file name, that file will
be ignored.
D 4
Note that since `\\' is a quote character, it must be doubled to become
part of the regular expression. Variables are expanded in \fIpattern list\fP
but not shell file pattern matching characters. To include a `$', it
must be escaped with `\\'.
E 4
I 4
Note that since `\e' is a quote character, it must be doubled to become
D 8
part of the regular expression.  Variables are expanded in \fIpattern list\fP
E 8
I 8
part of the regular expression.  Variables are expanded in
.Ar pattern list
E 8
but not shell file pattern matching characters.  To include a `$', it
must be escaped with `\e'.
E 4
D 8
.PP
E 8
I 8
.Pp
E 8
The
D 8
.I special
E 8
I 8
.Ic special
E 8
command is used to specify
D 8
.IR sh (1)
E 8
I 8
.Xr sh  1
E 8
commands that are to be executed on the
D 8
remote host after the file in \fIname list\fP is updated or installed.
If the \fIname list\fP is omitted then the shell commands will be executed
E 8
I 8
remote host after the file in
.Ar name list
is updated or installed.
If the
.Ar name list
is omitted then the shell commands will be executed
E 8
for every file updated or installed.  The shell variable `FILE' is set
to the current filename before executing the commands in
D 8
.IR string .
.I String
E 8
I 8
.Ar string  .
.Ar String
E 8
starts and ends with `"' and can cross multiple lines in
D 8
.I distfile.
E 8
I 8
.Ar distfile .
E 8
Multiple commands to the shell should be separated by `;'.
Commands are executed in the user's home directory on the host
being updated.
The
D 8
.I special
E 8
I 8
.Ar special
E 8
command can be used to rebuild private databases, etc.
after a program has been updated.
D 8
.PP
The following is a small example.
.nf

.in +.5i
E 8
I 8
.Pp
The following is a small example:
D 12
.Pp
.Ds I
E 12
I 12
.Bd -literal -offset indent
E 12
E 8
D 3
HOSTS = ( matisse arpa.root )
E 3
I 3
D 9
HOSTS = ( matisse root@arpa)
E 9
I 9
HOSTS = ( matisse root@arpa )
E 9
E 3
D 8

E 8
I 8
D 12
.sp
E 12
I 12

E 12
E 8
FILES = ( /bin /lib /usr/bin /usr/games
D 8
	/usr/include/{*.h,{stand,sys,vax*,pascal,machine}/*.h}
	/usr/lib /usr/man/man? /usr/ucb /usr/local/rdist )

E 8
I 8
\t/usr/include/{*.h,{stand,sys,vax*,pascal,machine}/*.h}
\t/usr/lib /usr/man/man? /usr/ucb /usr/local/rdist )
D 12
.sp
E 12
I 12

E 12
E 8
EXLIB = ( Mail.rc aliases aliases.dir aliases.pag crontab dshrc
D 8
	sendmail.cf sendmail.fc sendmail.hf sendmail.st uucp vfont )

E 8
I 8
\tsendmail.cf sendmail.fc sendmail.hf sendmail.st uucp vfont )
D 12
.sp
E 12
I 12

E 12
E 8
${FILES} -> ${HOSTS}
D 8
	install -R ;
	except /usr/lib/${EXLIB} ;
	except /usr/games/lib ;
	special /usr/lib/sendmail "/usr/lib/sendmail -bz" ;

E 8
I 8
\tinstall -R ;
\texcept /usr/lib/${EXLIB} ;
\texcept /usr/games/lib ;
\tspecial /usr/lib/sendmail "/usr/lib/sendmail -bz" ;
D 12
.sp
E 12
I 12

E 12
E 8
srcs:
/usr/src/bin -> arpa
D 4
	except_pat ( \e\e.o$ /SCCS$ ) ;
E 4
I 4
D 8
	except_pat ( \e\e.o\e$ /SCCS\e$ ) ;
E 4

E 8
I 8
\texcept_pat ( \e\e.o\e$ /SCCS\e$ ) ;
D 12
.sp
E 12
I 12

E 12
E 8
IMAGEN = (ips dviimp catdvi)
D 8

E 8
I 8
D 12
.sp
E 12
I 12

E 12
E 8
imagen:
/usr/local/${IMAGEN} -> arpa
D 8
	install /usr/local/lib ;
	notify ralph ;

E 8
I 8
\tinstall /usr/local/lib ;
\tnotify ralph ;
D 12
.sp
E 12
I 12

E 12
E 8
${FILES} :: stamp.cory
D 8
	notify root@cory ;
.in

.fi
.SH FILES
.nf
.ta \w'/tmp/rdist*    'u
distfile	input command file
/tmp/rdist*	temporary file for update lists
.fi
.SH "SEE ALSO"
sh(1), csh(1), stat(2)
I 4
.SH DIAGNOSTICS
E 8
I 8
\tnotify root@cory ;
D 12
.De
E 12
I 12
.Ed
E 12
.Sh FILES
D 12
.Dw /tmp/rdist*
.Di L
.Dp Pa distfile
E 12
I 12
.Bl -tag -width /tmp/rdist* -compact
.It Pa distfile
E 12
input command file
D 12
.Dp Pa /tmp/rdist*
E 12
I 12
.It Pa /tmp/rdist*
E 12
temporary file for update lists
D 12
.Dp
E 12
I 12
.El
E 12
.Sh SEE ALSO
.Xr sh 1 ,
.Xr csh 1 ,
.Xr stat 2
.Sh HISTORY
The
D 12
.Nm
command appeared in 4.3 BSD.
E 12
I 12
.Nm rdist
command appeared in
.Bx 4.3 .
E 12
.Sh DIAGNOSTICS
E 8
A complaint about mismatch of rdist version numbers may really stem
from some problem with starting your shell, e.g., you are in too many groups.
E 4
D 8
.SH BUGS
Source files must reside on the local host where rdist is executed.
.PP
E 8
I 8
.Sh BUGS
Source files must reside on the local host where
.Nm rdist
is executed.
.Pp
E 8
There is no easy way to have a special command executed after all files
in a directory have been updated.
D 8
.PP
E 8
I 8
.Pp
E 8
D 4
Variable expansion only works for name lists. Should be a general macro
E 4
I 4
Variable expansion only works for name lists; there should be a general macro
E 4
facility.
I 4
D 8
.PP
.I Rdist
E 8
I 8
.Pp
.Nm Rdist
E 8
aborts on files which have a negative mtime (before Jan 1, 1970).
D 8
.PP
E 8
I 8
.Pp
E 8
There should be a `force' option to allow replacement of non-empty directories
by regular files or symlinks.  A means of updating file modes and owners
of otherwise identical files is also needed.
E 4
E 1
