usr.sbin/iostat/SCCS/s.iostat.8
h37245
s 00002/00002/00114
d D 8.1 93/06/06 13:57:31 bostic 12 11
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00088/00080/00028
d D 6.9 91/09/08 19:02:22 cael 11 10
c reworded first sentence, converted to mdoc version three
e
s 00002/00002/00106
d D 6.8 91/04/24 12:30:10 bostic 10 9
c all AT&T source deleted; add Berkeley specific copyright notice
e
s 00006/00000/00102
d D 6.7 91/04/24 11:45:32 bostic 9 8
c  make default interval 1, make "iostat -w 3" repeat indefinitely
e
s 00039/00021/00063
d D 6.6 91/04/24 11:02:50 bostic 8 7
c redo man page, source, removing last of AT&T proprietary source
c change bps to sps, change seek calculation to take rotation and implied
c seeks into account.
e
s 00029/00009/00055
d D 6.5 91/04/23 16:40:13 bostic 7 6
c add -M, -N, use consistent flags for interval and count
e
s 00037/00040/00027
d D 6.4 91/04/22 18:01:15 bostic 6 5
c getopt the interval and count options
e
s 00004/00003/00063
d D 6.3 91/04/20 15:45:22 bostic 5 4
c new copyright; att/bsd/shared
e
s 00001/00001/00065
d D 6.2 90/06/22 17:05:08 bostic 4 3
c move iostat to section 8 of the manual
e
s 00017/00004/00049
d D 6.1 85/04/29 14:27:02 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00004/00002/00049
d D 5.1 85/04/29 14:26:55 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00051/00000/00000
d D 4.1 85/04/29 14:26:48 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
D 5
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 5
I 5
D 10
.\" Copyright (c) 1985 The Regents of the University of California.
E 10
I 10
D 11
.\" Copyright (c) 1985, 1991 The Regents of the University of California.
E 11
I 11
D 12
.\" Copyright (c) 1985, 1991, 1991 The Regents of the University of California.
E 11
E 10
.\" All rights reserved.
E 12
I 12
.\" Copyright (c) 1985, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 12
.\"
D 10
.\" %sccs.include.proprietary.roff%
E 10
I 10
.\" %sccs.include.redist.roff%
E 10
E 5
.\"
.\"	%W% (Berkeley) %G%
.\"
D 2
.TH IOSTAT 1
E 2
I 2
D 3
.TH IOSTAT 1 "18 January 1983"
E 3
I 3
D 4
.TH IOSTAT 1 "%Q%"
E 4
I 4
D 11
.TH IOSTAT 8 "%Q%"
E 4
E 3
E 2
.UC 4
.SH NAME
iostat \- report I/O statistics
.SH SYNOPSIS
D 6
.B iostat
I 3
[ drives ]
E 3
[ interval [ count ] ]
E 6
I 6
.nf
.ft B
D 7
iostat [ \-c count ] [ \-i interval ] [ drives ]
E 7
I 7
iostat [ \-c count ] [ \-M core ] [ \-N system ]
.ti +5
[ \-w wait ] [ drives ]
E 7
.ft R
.fi
E 6
.SH DESCRIPTION
.I Iostat
D 3
iteratively reports the number of characters read and written to terminals,
D 2
and, for each disk, the number of seeks and transfers per second,
E 2
I 2
and, for each disk, the number of seeks transfers per second, kilobytes
transfered per second,
E 3
I 3
D 8
iteratively reports the number of characters read and written to terminals
D 6
per second,
and, for each disk, the number of transfers per second, kilobytes
transferred per second,
E 3
E 2
and the milliseconds per average seek.
It also gives the percentage of time the system has
spent in user mode, in user mode running low priority (niced) processes,
in system mode, and idling.
E 6
I 6
per second, and, for each disk, the number of transfers per second,
kilobytes transferred per second, and the milliseconds per average seek.
It also gives the percentage of time the system has spent in user mode,
in user mode running low priority (niced) processes, in system mode, and
idling.
E 8
I 8
reports certain kernel statistics kept about terminal, disk and cpu
activity.
E 8
E 6
.PP
E 11
I 11
.Dd %Q%
.Dt IOSTAT 8
.Os BSD 4
.Sh NAME
.Nm iostat
.Nd report
.Tn I/O
statistics
.Sh SYNOPSIS
.Nm iostat
.Op Fl c Ar count
.Op Fl M Ar core
.Op Fl N Ar system
.Op Fl w Ar wait
.Op Ar drives
.Sh DESCRIPTION
.Nm Iostat
displays kernel
.Tn I/O
statistics on terminal, disk and cpu
operations.
.Pp
E 11
D 6
To compute this information, for each disk, seeks and data transfer completions
and number of words transferred are counted;
for terminals collectively, the number
of input and output characters are counted.
Also, each sixtieth of a second,
the state of each disk is examined
and a tally is made if the disk is active.
From these numbers and given the transfer rates
of the devices it is possible to determine
average seek times for each device.
E 6
I 6
D 8
To compute this information, for each disk, seeks and data transfer
completions and number of words transferred are counted; for terminals
collectively, the number of input and output characters are counted.
Also, each sixtieth of a second, the state of each disk is examined and
a tally is made if the disk is active.
From these numbers and given the transfer rates of the devices it is
possible to determine average seek times for each device.
E 6
.PP
E 8
D 6
The optional
E 6
I 6
The options are as follows:
D 11
.TP
\-c
E 11
I 11
.Bl -tag -width flag
.It Fl c
E 11
D 7
Display the information
E 7
I 7
Repeat the display
E 7
D 11
.I count
E 11
I 11
.Ar count
E 11
times.
D 8
The first dislpay is for all time since a reboot and each subsequent report
is for the time period since the last display.
E 8
I 8
The first display is for the time since a reboot and each subsequent
report is for the time period since the last display.
I 9
If no
D 11
.I wait
E 11
I 11
.Ar wait
E 11
interval is specified, the default is 1 second.
E 9
E 8
D 11
.TP
D 7
\-i
Sleep
E 6
.I interval
D 6
argument causes
.I iostat
to report once each
.I interval
seconds.
The first report is for  all time since a reboot and each
subsequent report is for the last interval only.
E 6
I 6
seconds between each display of the information.
E 7
I 7
\-M
E 11
I 11
.It Fl M
E 11
Extract values associated with the name list from the specified core
D 11
instead of the default ``/dev/kmem''.
.TP
\-N
E 11
I 11
instead of the default
.Dq Pa /dev/kmem .
.It Fl N
E 11
Extract the name list from the specified system instead of the default
D 11
``/vmunix''.
.TP
\-w
E 11
I 11
.Dq Pa /vmunix .
.It Fl w
E 11
Pause
D 11
.I wait
E 11
I 11
.Ar wait
E 11
seconds between each display.
I 9
If no repeat
D 11
.I count
E 11
I 11
.Ar count
E 11
is specified, the default is infinity.
E 9
E 7
E 6
D 11
.PP
D 6
The optional
.I count
argument restricts the number of reports.
I 3
.PP
E 6
D 8
If more than 4 disk drives are configured in the system,
E 8
I 8
.I Iostat
E 11
I 11
.El
.Pp
.Nm Iostat
E 11
displays its information in the following format:
D 11
.TP
tty
.nf
.RS
tin	characters read from terminals
tout	characters written to terminals
.RE
.fi
.TP
disks
E 11
I 11
.Bl -tag -width flag
.It tty
.Bl -tag -width indent -compact
.It tin
characters read from terminals
.It tout
characters written to terminals
.El
.It disks
E 11
Disk operations (this field is system dependent). 
The header of the field is the disk name and unit number.
If more than four disk drives are configured in the system,
E 8
D 11
.I iostat
E 11
I 11
.Nm iostat
E 11
D 6
displays only the first 4 drives, with priority given
to Massbus disk drives (i.e. if both Unibus and Massbus
drives are present and the total number of drives exceeds
4, then some number of Unibus drives will not be displayed
in favor of the Massbus drives).  To force
E 6
I 6
D 8
displays only the first 4 drives, with priority given to Massbus disk
drives (i.e. if both Unibus and Massbus drives are present and the total
number of drives exceeds 4, then some number of Unibus drives will not be
displayed in favor of the Massbus drives).
E 8
I 8
displays only the first four drives.
E 8
To force
E 6
D 11
.I iostat
E 11
I 11
.Nm iostat
E 11
D 6
to display specific drives, their names may be supplied on
the command line.
E 6
I 6
to display specific drives, their names may be supplied on the command
line.
I 8
D 11
.sp
.nf
.RS
sps	sectors transferred per second
tps	transfers per second
msps	milliseconds per average seek (including implied
	seeks and rotational latency)
.RE
.fi
.TP
cpu
.nf
.RS
us	% of cpu time in user mode
ni	% of cpu time in user mode running niced processes
sy	% of cpu time in system mode
id	% of cpu time in idle mode
.RE
.fi
E 8
E 6
E 3
.SH FILES
D 7
/dev/kmem
E 7
I 7
.ta \w'/dev/kmem  'u
/vmunix	default kernel namelist
E 7
I 2
.br
E 2
D 7
/vmunix
E 7
I 7
/dev/kmem	default memory file
E 7
.SH SEE ALSO
D 6
vmstat(1)
E 6
I 6
D 7
systat(1), vmstat(1)
E 7
I 7
.IR fstat (1),
.IR netstat (1),
.IR nfsstat (1),
.IR ps (1),
.IR systat (1),
.IR vmstat (1),
.IR pstat (8)
.sp
E 11
I 11
.Pp
.Bl -tag -width indent -compact
.It sps
sectors transferred per second
.It tps
transfers per second
.It msps
milliseconds per average seek (including implied
seeks and rotational latency)
.El
.It cpu
.Bl -tag -width indent -compact
.It \&us
% of cpu time in user mode
.It \&ni
% of cpu time in user mode running niced processes
.It \&sy
% of cpu time in system mode
.It \&id
% of cpu time in idle mode
.El
.El
.Sh FILES
.Bl -tag -width /dev/kmem -compact
.It Pa /vmunix
Default kernel namelist.
.It Pa /dev/kmem
Default memory file.
.El
.Sh SEE ALSO
.Xr fstat 1 ,
.Xr netstat 1 ,
.Xr nfsstat 1 ,
.Xr \&ps 1 ,
.Xr systat 1 ,
.Xr vmstat 1 ,
.Xr pstat 8
.Pp
E 11
The sections starting with ``Interpreting system activity'' in
D 11
.IR "Installing and Operating 4.3BSD" .
E 11
I 11
.%T "Installing and Operating 4.3BSD" .
E 11
E 7
E 6
E 1
