share/man/man8/man8.hp300/SCCS/S.rbootd.8
h52202
s 00002/00002/00121
d D 8.1 93/06/09 19:20:30 bostic 8 7
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00002/00003/00121
d D 5.5 93/06/09 19:20:27 bostic 7 5
c fixed the under development line
e
s 00002/00002/00122
d R 8.1 93/06/05 13:57:17 bostic 6 5
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00001/00001/00123
d D 5.4 91/08/05 02:57:35 cael 5 4
c verb fix
e
s 00001/00001/00123
d D 5.3 91/07/19 19:16:45 cael 4 2
c Os change
e
s 00003/00003/00121
d R 5.3 91/07/19 17:04:25 cael 3 2
c Os change
e
s 00076/00064/00048
d D 5.2 91/03/16 18:10:00 cael 2 1
c macro and text revision (-mdoc version 3)
e
s 00112/00000/00000
d D 5.1 90/06/29 20:15:15 bostic 1 0
c date and time created 90/06/29 20:15:15 by bostic
e
u
U
t
T
I 1
D 2
.\" Copyright (c) 1990 The Regents of the University of California.
E 2
I 2
D 8
.\" Copyright (c) 1990, 1991 The Regents of the University of California.
E 2
.\" All rights reserved.
E 8
I 8
.\" Copyright (c) 1990, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 8
.\"
.\" This code is derived from software contributed to Berkeley by
.\" the Systems Programming Group of the University of Utah Computer
D 2
.\" Science Department.
E 2
.\"
I 2
.\" Science Department.
E 2
.\" %sccs.include.redist.man%
.\"
D 2
.\"	%W% (Berkeley) %G%
E 2
I 2
.\"     %W% (Berkeley) %G%
E 2
.\"
D 2
.TH RBOOTD 8 "%Q%"
.UC 7
.SH NAME
rbootd \- HP remote boot server
.SH SYNOPSIS
.B rbootd
[\-a] [\-d] [ConfigFile]
.SH DESCRIPTION
.I Rbootd
E 2
I 2
.Dd %Q%
.Dt RBOOTD 8
D 4
.Os BSD 4.4
E 4
I 4
.Os
E 4
.Sh NAME
.Nm rbootd
.Nd
.Tn HP
remote boot server
.Sh SYNOPSIS
.Nm rbootd
.Op Fl a
.Op Fl d
.Op Ar ConfigFile
.Sh DESCRIPTION
.Nm Rbootd
E 2
services boot requests from Hewlett-Packard workstations over a
local area network.
All boot files must reside in the boot file directory; further, if a
client supplies path information in its boot request, it will be
silently stripped away before processing.
By default,
D 2
.I rbootd
E 2
I 2
.Nm rbootd
E 2
only responds to requests from machines listed in its configuration
file.
D 2
.PP
.I Rbootd
E 2
I 2
.Pp
.Nm Rbootd
E 2
supports the following command line options:
D 2
.TP
.B \-a
E 2
I 2
.Bl -tag -width Ds
.It Fl a
E 2
Respond to boot requests from any machine.  With this option,
the configuration file is ignored.
D 2
.TP
.B \-d
E 2
I 2
.It Fl d
E 2
Run server in debug mode.  Packets sent and
received are displayed to the terminal.
D 2
.TP
.B ConfigFile
E 2
I 2
.It Ar ConfigFile
E 2
Specify a different configuration file.
D 2
.PP
E 2
I 2
.El
.Pp
E 2
The configuration file consists of ascii text where each line describes
a particular machine.  A line must start with a machines'
D 2
.I ethernet address
E 2
I 2
.Em ethernet address
E 2
followed by an optional list of
D 2
.I boot file names.
E 2
I 2
.Em boot file names .
E 2
An ethernet address is specified in hexadecimal with each of its six
octets separated by a colon.  The boot file names come from the boot
file directory.
The ethernet address and boot file(s) must be separated
by white-space and/or commas.  A pound sign causes the remainder of
a line to be ignored.  Here is a sample configuration file:
D 2
.in +4
.nf

.ta \w'08:00:09:01:C6:75  'u +\w'SYSHPBSD,SYSHPUX  'u +\w'# jaguar (either)'u
E 2
I 2
.Bd -literal
E 2
#
D 2
# ethernet addr	boot file(s)	comments
E 2
I 2
# ethernet addr   boot file(s)       comments
E 2
#
D 2
08:00:09:0:66:ad	SYSHPBSD	# snake (4.3BSD)
08:00:09:0:59:5b		# vandy (anything)
8::9:1:C6:75	SYSHPBSD,SYSHPUX	# jaguar (either)
.DT
.fi
.in
.PP
.I Rbootd
E 2
I 2
08:00:09:0:66:ad  SYSHPBSD          # snake (4.3BSD)
08:00:09:0:59:5b                    # vandy (anything)
8::9:1:C6:75      SYSHPBSD,SYSHPUX  # jaguar (either)
.Ed
.Pp
.Nm Rbootd
E 2
logs status and error messages via
D 2
.I syslog.
E 2
I 2
.Xr syslog .
E 2
A startup message is always logged, and in the case of fatal
errors (or deadly signals) a message is logged announcing the
server's termination.  In general, a non-fatal error is handled
by ignoring the event that caused it (e.g. an invalid Ethernet
address in the config file causes that line to be invalidated).
D 2
.PP
E 2
I 2
.Pp
E 2
The following signals have the specified effect when sent to
D 2
the server process using the kill(1) command.
.IP SIGHUP
E 2
I 2
the server process using the
.Xr kill 1
command.
.Bl -tag -width Fl
.It Dv SIGHUP
E 2
Drop all active connections and reconfigure.
D 2
.IP SIGUSR1
Turn on debugging, do nothing if already on.  (SIGEMT on older systems
without SIGUSR1)
.IP SIGUSR2
Turn off debugging, do nothing if already off.  (SIGFPE on older systems
without SIGUSR2)
.SH "FILES"
.PD 0
.TP 22
/etc/rbootd.conf
E 2
I 2
.It Dv SIGUSR1
Turn on debugging, do nothing if already on.
.Pf ( Dv SIGEMT
on older systems
without
.Dv SIGUSR1 )
.It Dv SIGUSR2
Turn off debugging, do nothing if already off.
.Pf ( Dv SIGFPE
on older systems
without
.Dv SIGUSR2 )
.Sh FILES
.Bl -tag -width /usr/tmp/rbootd.dbgxx -compact
.It Pa /etc/rbootd.conf
E 2
configuration file
D 2
.TP
/usr/lib/rbootd
E 2
I 2
.It Pa /usr/lib/rbootd
E 2
directory containing boot files
D 2
.TP
/etc/rbootd.pid
E 2
I 2
.It Pa /etc/rbootd.pid
E 2
process id
D 2
.TP
/usr/tmp/rbootd.dbg
E 2
I 2
.It Pa /usr/tmp/rbootd.dbg
E 2
debug output
D 2
.PD
.SH "SEE ALSO"
kill(1), socket(2), signal(3C), syslog(3), rmp(4)
.SH "AUTHOR"
E 2
I 2
.El
.Sh SEE ALSO
.Xr kill 1 ,
.Xr socket 2 ,
.Xr signal 3 ,
.Xr syslog 3 ,
.Xr rmp 4
.Sh AUTHOR
E 2
Jeff Forys, University of Utah
D 2
.SH "BUGS"
.TP 2
\-
E 2
I 2
.Sh BUGS
E 2
If more than one server is started, both will receive and respond
to the same boot packets.
I 2
.Sh HISTORY
The
D 7
.Nm
D 5
command
E 5
I 5
command is
E 5
.Ud
E 7
I 7
.Nm rbootd
utility first appeared in 4.4BSD.
E 7
E 2
E 1
