usr.bin/uucp/uuxqt/SCCS/s.uuxqt.8
h41227
s 00001/00001/00077
d D 8.2 94/04/19 08:53:22 bostic 6 5
c spelling
e
s 00002/00002/00076
d D 8.1 93/06/06 22:15:22 bostic 5 4
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00066/00039/00012
d D 6.4 91/03/16 18:11:19 cael 4 3
c macro and text revision (-mdoc version 3)
e
s 00006/00006/00045
d D 6.3 90/06/24 22:09:27 trent 3 2
c new pathnames
e
s 00004/00004/00047
d D 6.2 88/10/24 12:00:15 bostic 2 1
c remove refs to [18]C, add copyright if needed
e
s 00051/00000/00000
d D 6.1 86/04/24 22:25:14 mckusick 1 0
c from rfg
e
u
U
t
T
I 1
D 4
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 4
I 4
D 5
.\" Copyright (c) 1980, 1991 Regents of the University of California.
.\" All rights reserved.
E 5
I 5
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 5
E 4
.\"
D 4
.\"	%W% (Berkeley) %G%
E 4
I 4
.\" %sccs.include.redist.man%
E 4
.\"
D 2
.TH UUXQT 8C "%Q%"
E 2
I 2
D 4
.TH UUXQT 8 "%Q%"
E 2
.UC 6
.SH NAME
uuxqt \- \s-1UUCP\s+1 execution file interpreter
.SH SYNOPSIS
.B /usr/lib/uucp/uuxqt
[
.BI \-x debug
]
.SH DESCRIPTION
.I Uuxqt
E 4
I 4
.\"     %W% (Berkeley) %G%
.\"
.Dd %Q%
.Dt UUXQT 8
.Os BSD 4.3
.Sh NAME
.Nm uuxqt
.Nd
.Tn UUCP
execution file interpreter
.Sh SYNOPSIS
.Nm uuxqt
.Op Fl x Ar debug
.Sh DESCRIPTION
.Nm Uuxqt
E 4
interprets
D 4
.I "execution files"
E 4
I 4
.Em execution files
E 4
created on a remote system via
D 2
.IR uux (1C)
E 2
I 2
D 4
.IR uux (1)
E 4
I 4
.Xr uux 1
E 4
E 2
and transferred to the local system via
D 2
.IR uucico (8C).
E 2
I 2
D 4
.IR uucico (8).
E 4
I 4
.Xr uucico 8 .
E 4
E 2
When a user uses
D 4
.I uux
E 4
I 4
.Xr uux
E 4
to request remote command execution, it is
D 4
.I uuxqt
E 4
I 4
.Nm uuxqt
E 4
that actually executes the command. 
I 4
.Pp
D 6
Option availble:
E 6
I 6
The options are as follows:
E 6
.Bl -tag -width Ar
.It Fl x Ns Ar debug
E 4
Normally,
D 4
.I uuxqt
E 4
I 4
.Nm uuxqt
E 4
is forked from
D 4
.I uucico
E 4
I 4
.Xr uucico 8
E 4
to process queued execution files;
D 4
for debugging, it may also be run manually by the \s-1UUCP\s+1 administrator.
.PP
.I Uuxqt
runs in its own subdirectory,
D 3
.IR /usr/spool/uucp/XTMP .
E 3
I 3
.IR /var/spool/uucp/XTMP .
E 4
I 4
for debugging, it may also be run manually by the
.Tn UUCP
administrator.
.El
.Pp
.Nm Uuxqt
runs in its own subdirectory
.Pa /var/spool/uucp/XTMP .
E 4
E 3
It copies intermediate files to this directory when necessary.
D 4
.SH FILES
D 3
.ta \w'/usr/spool/uucp/LCK/LCK.XQT   'u
E 3
I 3
.ta \w'/var/spool/uucp/LCK/LCK.XQT   'u
E 3
.nf
/usr/lib/uucp/L.cmds	Remote command permissions list
/usr/lib/uucp/USERFILE	Remote directory tree permissions list
D 3
/usr/spool/uucp/LOGFILE	UUCP system activity log
/usr/spool/uucp/LCK/LCK.XQT	\fIUuxqt\fP lock file
/usr/spool/uucp/X./	Incoming execution file directory
/usr/spool/uucp/XTMP	\fIUuxqt\fP running directory
E 3
I 3
/var/spool/uucp/LOGFILE	UUCP system activity log
/var/spool/uucp/LCK/LCK.XQT	\fIUuxqt\fP lock file
/var/spool/uucp/X./	Incoming execution file directory
/var/spool/uucp/XTMP	\fIUuxqt\fP running directory
E 3
.fi
.SH SEE ALSO
D 2
uucp(1C), uux(1C), L.cmds(5), USERFILE(5), uucico(8C)
E 2
I 2
uucp(1), uux(1), L.cmds(5), USERFILE(5), uucico(8)
E 4
I 4
.Sh FILES
.Bl -tag -width /var/spool/uucp/LCK/LCK.XQT -compact
.It Pa /usr/lib/uucp/L.cmds
Remote command permissions list
.It Pa /usr/lib/uucp/USERFILE
Remote directory tree permissions list
.It Pa /var/spool/uucp/LOGFILE
.Tn UUCP
system activity log
.It Pa /var/spool/uucp/LCK/LCK.XQT
.Nm Uuxqt
lock file
.It Pa /var/spool/uucp/X./
Incoming execution file directory
.It Pa /var/spool/uucp/XTMP
.Nm Uuxqt
running directory
.El
.Sh SEE ALSO
.Xr uucp 1 ,
.Xr uux 1 ,
.Xr L.cmds 5 ,
.Xr USERFILE 5 ,
.Xr uucico 8
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.3 .
E 4
E 2
E 1
