sbin/shutdown/SCCS/s.shutdown.8
h65170
s 00001/00001/00135
d D 8.2 95/04/27 16:25:25 bostic 12 11
c typo
e
s 00002/00002/00134
d D 8.1 93/06/05 11:21:04 bostic 11 10
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00116/00078/00020
d D 6.8 91/03/16 17:08:56 cael 10 9
c macro and text revision (-mdoc version 3)
e
s 00001/00011/00097
d D 6.7 90/06/24 21:55:27 trent 9 8
c new copyright notice
e
s 00020/00006/00088
d D 6.6 88/12/16 12:00:50 bostic 8 7
c '-' option means read from stdin, don't do it by default.  Fix call to
c reboot/halt, minor cleanups
e
s 00039/00057/00055
d D 6.5 88/09/18 16:09:51 bostic 7 6
c time is now an absolute, warning message is read from stdin by
c default, document fastboot, other minor stuff
e
s 00001/00001/00111
d D 6.4 86/05/26 15:37:57 karels 6 5
c updates
e
s 00018/00001/00094
d D 6.3 86/05/16 02:13:13 lepreau 5 4
c doc -f and -n flags
e
s 00001/00003/00094
d D 6.2 86/05/12 17:44:50 eric 4 3
c shutdownlog subsumed into syslog
e
s 00001/00001/00096
d D 6.1 85/04/27 13:50:56 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00010/00009/00087
d D 5.1 85/04/27 13:50:34 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00096/00000/00000
d D 4.1 85/04/27 13:50:15 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
D 8
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 8
I 8
D 10
.\" Copyright (c) 1988 The Regents of the University of California.
E 10
I 10
D 11
.\" Copyright (c) 1988, 1991 The Regents of the University of California.
E 10
.\" All rights reserved.
E 11
I 11
.\" Copyright (c) 1988, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 11
E 8
.\"
I 8
D 9
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 9
I 9
.\" %sccs.include.redist.man%
E 9
.\"
E 8
D 10
.\"	%W% (Berkeley) %G%
E 10
I 10
.\"     %W% (Berkeley) %G%
E 10
.\"
D 2
.TH SHUTDOWN 8 4/1/81
E 2
I 2
D 3
.TH SHUTDOWN 8 4/1/83
E 3
I 3
D 10
.TH SHUTDOWN 8 "%Q%"
E 3
E 2
.UC 4
.SH NAME
shutdown \- close down the system at a given time
.SH SYNOPSIS
D 8
.B /etc/shutdown
E 8
I 8
.B shutdown
E 8
[
I 8
.B -
] [
E 8
D 7
.B \-k
] [
.B \-r
] [
.B \-h
I 5
] [
.B \-f
] [
.B \-n
E 7
I 7
.B \-fhkrn
E 7
E 5
]
time [ warning-message ... ]
.SH DESCRIPTION
.I Shutdown
provides an automated shutdown procedure which a super-user
D 7
can use to notify users
nicely when the system is shutting down, saving them from
system administrators, hackers, and gurus, who would otherwise
not bother with niceties.
.LP
E 7
I 7
can use to notify users nicely when the system is shutting down,
E 10
I 10
.Dd %Q%
.Dt SHUTDOWN 8
.Os BSD 4
.Sh NAME
.Nm shutdown
.Nd "close down the system at a given time"
.Sh SYNOPSIS
.Nm shutdown
.Op Fl 
.Op Fl fhkrn
.Ar time
.Op Ar warning-message ...
.Sh DESCRIPTION
.Nm Shutdown
provides an automated shutdown procedure for super-users
to nicely notify users when the system is shutting down,
E 10
saving them from system administrators, hackers, and gurus, who
would otherwise not bother with such niceties.
D 10
.PP
E 7
.I Time
D 7
is the time at which
.I shutdown
will bring the system down and
D 2
may take two formats:
E 2
I 2
may be the word
.B now
(indicating an immediate shutdown)
or specify a future time in one of two formats:
E 2
.BR + number
and
.RB hour : min.
The first form brings the system down in
.I number
minutes
and the second brings the system down at the time of day indicated
(as a 24\-hour clock).
E 7
I 7
is the time at which \fIshutdown\fP will bring the system down and
may be the word \fInow\fP (indicating an immediate shutdown) or
specify a future time in one of two formats: \fI+number\fP, or
\fIyymmddhhmm\fP, where the year, month, and day may be defaulted
E 10
I 10
.Pp
Available friendlinesses:
.Bl -tag -width time
.It Fl f
.Nm Shutdown
arranges, in the manner of
.Xr fastboot 8 ,
for the file systems
.Em not to be
checked on reboot.
.It Fl h
The system is halted at the specified
.Ar time
when
.Nm shutdown
execs
.Xr halt 8 .
.It Fl k
D 12
Kick every body off.
E 12
I 12
Kick everybody off.
E 12
The
.Fl k
option
does not actually halt the system, but leaves the
system multi-user with logins disabled (for all but super-user).
.It Fl n
Prevent the normal
.Xr sync 2
before stopping.
.It Fl r 
.Nm Shutdown
execs
.Xr reboot 8
at the specified
.Ar time .
.It Ar time
.Ar Time
is the time at which
.Nm shutdown
will bring the system down and
may be the word
.Ar now
(indicating an immediate shutdown) or
specify a future time in one of two formats:
.Ar +number ,
or
.Ar yymmddhhmm ,
where the year, month, and day may be defaulted
E 10
to the current system values.  The first form brings the system down in
D 10
\fInumber\fP minutes and the second at the absolute time specified.
E 7
.PP
E 10
I 10
.Ar number
minutes and the second at the absolute time specified.
.It Ar warning-message
E 10
D 7
At intervals which get closer together as apocalypse approaches,
warning messages are displayed at the terminals of all users on the
system.  Five minutes before shutdown, or immediately if
shutdown is in less than 5 minutes, logins are disabled by
creating
/etc/nologin
and writing a message there.
D 2
If this file exists when a user logs in,
E 2
I 2
If this file exists when a user attempts to log in,
E 2
.IR login (1)
prints its contents
and exits.
The file is removed just before
.I shutdown
exits.
E 7
I 7
Any other arguments comprise the warning message that is broadcast
D 8
to users currently logged into the system; if no other arguments
are provided, the warning message is read from the standard input.
E 8
I 8
D 10
to users currently logged into the system; if a single dash (``-'')
E 10
I 10
to users currently logged into the system.
.It Fl
If
.Ql Fl
E 10
is supplied as an option, the warning message is read from the standard
input.
E 8
E 7
D 10
.PP
D 7
At shutdown time a
D 4
message is written in the file /usr/adm/shutdownlog, containing the
E 4
I 4
message is written in the system log, containing the
E 4
time of shutdown, who ran shutdown and the reason.
D 6
Then a terminate signal is sent at
E 6
I 6
Then a terminate signal is sent to
E 6
.I init
to bring the system down to single-user state.
E 7
I 7
At intervals, which get closer together as apocalypse approaches,
starting at ten hours before shutdown, warning messages are displayed
at the terminals of all users on the system.  Five minutes before
E 10
I 10
.El
.Pp
At intervals, becoming more frequent as apocalypse approaches
and starting at ten hours before shutdown, warning messages are displayed
on the terminals of all users logged in.  Five minutes before
E 10
shutdown, or immediately if shutdown is in less than 5 minutes,
D 10
logins are disabled by creating \fI/etc/nologin\fP and copying the
E 10
I 10
logins are disabled by creating
.Pa /etc/nologin
and copying the
E 10
warning message there.  If this file exists when a user attempts to
D 10
log in, \fIlogin\fP(1) prints its contents and exits.  The file is
removed just before \fIshutdown\fP exits.
.PP
E 10
I 10
log in,
.Xr login 1
prints its contents and exits.  The file is
removed just before
.Nm shutdown
exits.
.Pp
E 10
At shutdown time a message is written in the system log, containing the
D 10
time of shutdown, who ran shutdown and the reason.  Then a terminate
signal is sent to \fIinit\fP to bring the system down to single-user state.
E 7
Alternatively, if
D 2
.B -r,
.B -h,
E 2
I 2
.B \-r,
.B \-h,
E 2
or
D 2
.B -k
E 2
I 2
.B \-k
E 2
D 7
was used, then
E 7
I 7
is used, then
E 7
.I shutdown
will exec
.IR reboot (8),
.IR halt (8),
or avoid shutting the system down (respectively).
(If it isn't obvious,
.B \-k
is to make people
.I think
the system is going down!)
.PP
I 5
With the
.B \-f
option,
.I shutdown
arranges, in the manner of
.IR fastboot (8),
that when the system is rebooted the file systems will not
be checked.  The
.B \-n
option prevents the normal
.IR sync (2)
before stopping.
.PP
E 10
I 10
time of shutdown, who initiated the shutdown and the reason.
A terminate
signal is then sent to
.Xr init
to bring the system down to single-user state (depending on above
options).
E 10
E 5
The time of the shutdown and the warning message
D 7
are placed in /etc/nologin and should be used to
E 7
I 7
D 10
are placed in \fI/etc/nologin\fP and should be used to
E 10
I 10
are placed in
.Pa /etc/nologin
and should be used to
E 10
E 7
inform the users about when the system will be back up
and why it is going down (or anything else).
D 10
.SH FILES
D 7
.DT
/etc/nologin	tells login not to let anyone log in
E 7
I 7
.TP 15
/etc/nologin
E 10
I 10
.Sh FILES
.Bl -tag -width /etc/nologin -compact
.It Pa /etc/nologin
E 10
tells login not to let anyone log in
D 10
.TP 15
/fastboot
tells /etc/rc not to run fsck when rebooting
E 7
D 4
.br
D 2
/usr/adm/shutdownlog	log file for succesful shutdowns.
E 2
I 2
/usr/adm/shutdownlog	log file for successful shutdowns.
E 4
E 2
.SH "SEE ALSO"
D 5
login(1), reboot(8)
E 5
I 5
D 7
login(1), reboot(8), fastboot(8)
E 5
.SH BUGS
Only allows you to kill the system between now and 23:59 if
you use the absolute time for shutdown.
E 7
I 7
login(1), wall(1), fastboot(8), halt(8), reboot(8)
.SH "BACKWARD COMPATIBILITY"
E 10
I 10
.It Pa /fastboot
tells
.Xr rc 8
not to run fsck when rebooting
.El
.Sh SEE ALSO
.Xr login 1 ,
.Xr wall 1 ,
.Xr fastboot 8 ,
.Xr halt 8 ,
.Xr reboot 8
.Sh BACKWARD COMPATIBILITY
E 10
The hours and minutes in the second time format may be separated by
a colon (``:'') for backward compatibility.
D 10

E 10
I 10
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.0 .
E 10
E 7
D 2
.PP
Times to shutdown are not nice and round, i.e. ``shutdown in 18 seconds''.
E 2
E 1
