sbin/ping/SCCS/s.ping.8
h01680
s 00002/00001/00300
d D 8.3 95/04/28 15:29:29 bostic 10 9
c missing trailng host argument, sort flags
c From: Adam Glass <glass@NetBSD.ORG>
e
s 00001/00002/00300
d D 8.2 93/12/11 23:43:18 mckusick 9 8
c copyediting for Usenix manuals
e
s 00002/00002/00300
d D 8.1 93/06/05 11:09:24 bostic 8 7
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00188/00121/00114
d D 6.7 91/03/16 17:07:59 cael 7 6
c macro and text revision (-mdoc version 3)
e
s 00001/00011/00234
d D 6.6 90/06/24 21:48:02 trent 6 5
c new copyright
e
s 00155/00143/00090
d D 6.5 89/08/16 14:13:19 bostic 5 4
c reformat/cleanup mostly, but a few bugs
e
s 00182/00042/00051
d D 6.4 89/08/16 13:52:50 bostic 4 3
c from Cliff Frost
e
s 00015/00005/00078
d D 6.3 88/09/19 21:41:08 bostic 3 2
c Berkeley specific header
e
s 00049/00013/00034
d D 6.2 86/05/23 16:50:50 karels 2 1
c new options
e
s 00047/00000/00000
d D 6.1 85/10/18 13:49:49 mckusick 1 0
c initial version from Mike Muuss
e
u
U
t
T
I 1
D 3
.\" Copyright (c) 1985 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 3
I 3
D 4
.\" Copyright (c) 1985 The Regents of the University of California.
.\" All rights reserved.
E 3
.\"
I 3
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.
.\"
E 3
.\"	%W% (Berkeley) %G%
.\"
.TH PING 8 "%Q%"
.UC 6
E 4
I 4
D 5
.TH PING 8 "May 25, 1989"
E 5
I 5
D 7
.\" Copyright (c) 1985 The Regents of the University of California.
E 7
I 7
D 8
.\" Copyright (c) 1985, 1991 The Regents of the University of California.
E 7
.\" All rights reserved.
E 8
I 8
.\" Copyright (c) 1985, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 8
.\"
D 6
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 6
I 6
.\" %sccs.include.redist.man%
E 6
.\"
D 7
.\"	%W% (Berkeley) %G%
E 7
I 7
.\"     %W% (Berkeley) %G%
E 7
.\"
D 7
.TH PING 8 "%Q%"
.UC 6
E 5
E 4
.SH NAME
ping \- send ICMP ECHO_REQUEST packets to network hosts
.SH SYNOPSIS
D 5
.B /etc/ping
E 5
I 5
.B ping
E 5
D 2
.B host
E 2
[
D 2
.B packetsize
E 2
I 2
D 4
.B \-r
] [
.B \-v
E 2
]
I 2
.I host
[
.I packetsize
] [
.I count
]
E 4
I 4
.B -dfnqrvR
][
.B -c
count][
.B -i
wait][
.B -l
preload][
.B -p
pattern][
.B -s
packetsize]
D 5
.B [-h]
.B host
E 5
E 4
E 2
.SH DESCRIPTION
D 2
The ARPA InterNet is a large and complex aggregation of
E 2
I 2
D 5
The DARPA Internet is a large and complex aggregation of
E 2
network hardware, connected together by gateways.
Tracking a single-point hardware or software failure
can often be difficult.
E 5
.I Ping
E 7
I 7
.Dd %Q%
.Dt PING 8
.Os BSD 4.3
.Sh NAME
.Nm ping
.Nd send
.Tn ICMP ECHO_REQUEST
packets to network hosts
.Sh SYNOPSIS
.Nm ping
D 10
.Op Fl dfnqrvR
E 10
I 10
.Op Fl Rdfnqrv
E 10
.Op Fl c Ar count
.Op Fl i Ar wait
.Op Fl l Ar preload
.Op Fl p Ar pattern
.Op Fl s Ar packetsize
I 10
.Ar host
E 10
.Sh DESCRIPTION
.Nm Ping
E 7
D 2
utilizes the mandatory
ICMP protocol's ECHO_REQUEST datagram to elicit an
ICMP ECHO_RESPONSE from a distant host or gateway.
E 2
I 2
D 4
utilizes the
E 4
I 4
uses the
E 4
D 7
ICMP protocol's mandatory ECHO_REQUEST datagram to elicit an
ICMP ECHO_RESPONSE from a host or gateway.
E 2
ECHO_REQUEST datagrams (``pings'') have an IP and ICMP header,
E 7
I 7
.Tn ICMP
protocol's mandatory
.Tn ECHO_REQUEST
datagram to elicit an
.Tn ICMP ECHO_RESPONSE
from a host or gateway.
.Tn ECHO_REQUEST
datagrams (``pings'') have an IP and
.Tn ICMP
header,
E 7
D 5
followed by a \fBstruct timeval\fR, and then an arbitrary number
of ``pad'' bytes used to fill out the packet.
Default datagram length is 64 bytes, but this may be changed
D 4
using the command-line option.
E 4
I 4
using the \fI-s\fR option.
E 5
I 5
followed by a
D 7
.I struct timeval
E 7
I 7
.Dq struct timeval
E 7
and then an arbitrary number of ``pad'' bytes used to fill out the
packet.
The options are as follows:
E 5
E 4
I 2
D 9
Other options are:
E 9
D 7
.TP
I 4
D 5
.B \-d
E 5
I 5
.I "-c count"
E 7
I 7
.Bl -tag -width Ds
.It Fl c Ar count
E 7
Stop after sending (and receiving)
D 7
.I count
ECHO_RESPONSE packets.
.TP
.I -d
E 5
Set the SO_DEBUG option on the socket being used.
.TP
D 5
.B \-f
Flood ping.  Outputs packets as fast as they come back or one hundred times
per second, whichever is more.  For every ECHO_REQUEST sent a period '.'
is printed, while for ever ECHO_REPLY received a backspace is printed.
E 5
I 5
.I -f
E 7
I 7
.Ar count
.Tn ECHO_RESPONSE
packets.
.It Fl d
Set the
.Dv SO_DEBUG
option on the socket being used.
.It Fl f
E 7
Flood ping.
Outputs packets as fast as they come back or one hundred times per second,
whichever is more.
D 7
For every ECHO_REQUEST sent a period ``.'' is printed, while for ever
ECHO_REPLY received a backspace is printed.
E 7
I 7
For every
.Tn ECHO_REQUEST
D 9
sent a period ``.'' is printed, while for ever
E 9
I 9
sent a period ``.'' is printed, while for every
E 9
.Tn ECHO_REPLY
received a backspace is printed.
E 7
E 5
This provides a rapid display of how many packets are being dropped.
D 5
\fIThis can be very hard on a network and should be used with caution.\fR
E 5
I 5
Only the super-user may use this option.
D 7
.I "This can be very hard on a network and should be used with caution."
E 5
.TP
D 5
.B \-h
You may use this flag to specify the host, or leave it off if the host
is the last token on the command line.
.TP
.B \-n
Numeric output only.  No attempt will be made to lookup symbolic
names for host addresses.
.TP
.B \-q
Quiet output.  Nothing is displayed except the summary lines at the
beginning and at the end.
.TP
E 4
.B \-r
Bypass the normal routing tables and send directly to a host on an attached
network.
If the host is not on a directly-attached network,
an error is returned.
This option can be used to ping a local host through an interface
that has no route through it (e.g., after the interface was dropped by
D 4
.IR routed (8C)).
E 4
I 4
.I routed(8C)
).
E 4
.TP
.B \-v
D 4
Verbose output.  ICMP packets other than ECHO RESPONSE that are received
E 4
I 4
Verbose output.  ICMP packets other than ECHO_RESPONSE that are received
E 4
are listed.
I 4
.TP
.B \-R
Record Route.  Includes the RECORD_ROUTE option in the ECHO_REQUEST
packet and displays the route buffer on returned packets.  Note that
the IP header is only large enough for nine such routes.  Many hosts
ignore or discard this option.
.TP
.B \-c \fIcount\fR
Stop after receiving \fIcount\fR ECHO_RESPONSE packets.
.TP
.B \-i \fIwait\fR
.br
Wait \fIwait\fR seconds between sending each packet.
E 5
I 5
.I "-i wait"
E 7
I 7
.Bf -emphasis
This can be very hard on a network and should be used with caution.
.Ef
.It Fl i Ar wait
E 7
Wait
D 7
.I wait seconds between sending each packet.
E 7
I 7
.Ar wait
seconds
.Em between sending each packet .
E 7
E 5
The default is to wait for one second between each packet.
D 5
This option is incompatible with the \fB-f\fR option.
E 5
I 5
This option is incompatible with the
D 7
.I -f
E 7
I 7
.Fl f
E 7
option.
E 5
D 7
.TP
D 5
.B \-l \fIpreload\fR
E 5
I 5
.I -l preload
E 7
I 7
.It Fl l Ar preload
E 7
E 5
If
D 7
.I preload
E 7
I 7
.Ar preload
E 7
D 5
is given,
E 5
I 5
is specified,
E 5
D 7
.I ping
E 7
I 7
.Nm ping
E 7
D 5
sends that many packets as fast as possible before
falling into its normal mode of behavior.
E 5
I 5
sends that many packets as fast as possible before falling into its normal
mode of behavior.
E 5
D 7
.TP
D 5
.B \-p \fIpattern\fR
You may specify up to 16 "pad" bytes to fill out the packet you send.
E 5
I 5
.I -n
E 7
I 7
.It Fl n
E 7
Numeric output only.
No attempt will be made to lookup symbolic names for host addresses.
D 7
.TP
.I "-p pattern"
E 7
I 7
.It Fl p Ar pattern
E 7
You may specify up to 16 ``pad'' bytes to fill out the packet you send.
E 5
This is useful for diagnosing data-dependent problems in a network.
D 5
For example, "-p ff" will cause the sent packet to be filled with all ones.
E 5
I 5
D 7
For example, ``-p ff'' will cause the sent packet to be filled with all
E 7
I 7
For example,
.Dq Li \-p ff
will cause the sent packet to be filled with all
E 7
ones.
E 5
D 7
.TP
D 5
.B \-s \fIpacketsize\fR
E 5
I 5
.I -q
E 7
I 7
.It Fl q
E 7
Quiet output.
Nothing is displayed except the summary lines at startup time and
when finished.
D 7
.TP
.B -R
E 7
I 7
.It Fl R
E 7
Record route.
D 7
Includes the RECORD_ROUTE option in the ECHO_REQUEST packet and displays
E 7
I 7
Includes the
.Tn RECORD_ROUTE
option in the
.Tn ECHO_REQUEST
packet and displays
E 7
the route buffer on returned packets.
Note that the IP header is only large enough for nine such routes.
Many hosts ignore or discard this option.
D 7
.TP
.I -r
E 7
I 7
.It Fl r
E 7
Bypass the normal routing tables and send directly to a host on an attached
network.
If the host is not on a directly-attached network, an error is returned.
This option can be used to ping a local host through an interface
that has no route through it (e.g., after the interface was dropped by
D 7
.IR routed (8)).
.TP
.I "-s packetsize"
E 7
I 7
.Xr routed 8 ) .
.It Fl s Ar packetsize
E 7
E 5
Specifies the number of data bytes to be sent.  
D 7
The default is 56, which translates into 64 ICMP data bytes when combined
with the 8 bytes of ICMP header data.
I 5
.TP
.I -v
E 7
I 7
The default is 56, which translates into 64
.Tn ICMP
data bytes when combined
with the 8 bytes of
.Tn ICMP
header data.
.It Fl v
E 7
Verbose output.
D 7
ICMP packets other than ECHO_RESPONSE that are received are listed.
E 5
E 4
E 2
.PP
E 7
I 7
.Tn ICMP
packets other than
.Tn ECHO_RESPONSE
that are received are listed.
.El
.Pp
E 7
D 4
When using \fIping\fR for fault isolation,
it should first be run on the local
host, to verify that the local network interface is up and
D 2
running.  Then, hosts and gateways further and further away
should be ``pinged''.  A lack of output from the \fIping\fR
program indicates no response;  in normal operation,
\fIping\fR sends one datagram per second, and
E 2
I 2
running.
E 4
I 4
D 5
When using \fIping\fR for fault isolation, it should first be run on the local
host, to verify that the local network interface is up and running.
E 4
Then, hosts and gateways further and further away
should be ``pinged''.
D 4
\fIPing\fR sends one datagram per second, and
E 4
I 4
\fIPing\fR sends one datagram per second (or per \fIwait\fR seconds), and
E 4
E 2
prints one line of output for every ECHO_RESPONSE returned.
I 2
D 4
No output is produced if there is no response.
E 4
If an optional
.I count
is given, only that number of requests is sent.
E 5
I 5
When using
D 7
.I ping
E 7
I 7
.Nm ping
E 7
for fault isolation, it should first be run on the local host, to verify
that the local network interface is up and running.
Then, hosts and gateways further and further away should be ``pinged''.
E 5
E 2
Round-trip times and packet loss statistics are computed.
I 4
D 5
If duplicate packets are received, they are not included in the
packet loss calculation, although the
round trip time of these packets is used in calculating the 
minimun/average/maximum round-trip time numbers.
E 4
D 2
If the program is terminated with a SIGINT, a brief
E 2
I 2
When all responses have been received or the program times out (with a
.I count
D 4
specified),
or if the program is terminated with a SIGINT, a brief
E 4
I 4
specified), or if the program is terminated with a SIGINT, a brief
E 4
E 2
summary is displayed.
E 5
I 5
If duplicate packets are received, they are not included in the packet
loss calculation, although the round trip time of these packets is used
in calculating the minimum/average/maximum round-trip time numbers.
When the specified number of packets have been sent (and received) or
D 7
if the program is terminated with a SIGINT, a brief summary is displayed.
E 5
I 2
.PP
E 7
I 7
if the program is terminated with a
.Dv SIGINT ,
a brief summary is displayed.
.Pp
E 7
D 5
This program is intended for use in network testing, measurement
and management.
It should be used primarily for manual fault isolation.
Because of the load it could impose on the network,
it is unwise to use
E 5
I 5
This program is intended for use in network testing, measurement and
management.
Because of the load it can impose on the network, it is unwise to use
E 5
D 7
.I ping
E 7
I 7
.Nm ping
E 7
during normal operations or from automated scripts.
I 4
D 5
.SH ICMP Packet Details
E 5
I 5
D 7
.SH ICMP PACKET DETAILS
E 7
I 7
.Sh ICMP PACKET DETAILS
E 7
E 5
An IP header without options is 20 bytes.
D 7
An ICMP ECHO_REQUEST packet contains an additional 8 bytes worth
D 5
of ICMP header followed by an arbitrary amount of data.  When a
E 5
I 5
of ICMP header followed by an arbitrary amount of data.
E 7
I 7
An
.Tn ICMP
.Tn ECHO_REQUEST
packet contains an additional 8 bytes worth
of
.Tn ICMP
header followed by an arbitrary amount of data.
E 7
When a
E 5
D 7
.I packetsize
E 7
I 7
.Ar packetsize
E 7
D 5
is given, this indicated the size of this extra blob of data (the
default is 56).  Thus the amount of data received inside of an IP
packet of type ICMP ECHO_REPLY will always be 8 bytes more than
the requested data space (the ICMP header).
E 5
I 5
is given, this indicated the size of this extra piece of data (the
default is 56).
D 7
Thus the amount of data received inside of an IP packet of type ICMP
ECHO_REPLY will always be 8 bytes more than the requested data space
(the ICMP header).
E 5
.PP
E 7
I 7
Thus the amount of data received inside of an IP packet of type
.Tn ICMP
.Tn ECHO_REPLY
will always be 8 bytes more than the requested data space
(the
.Tn ICMP
header).
.Pp
E 7
If the data space is at least eight bytes large,
D 7
.I ping
E 7
I 7
.Nm ping
E 7
uses the first eight bytes of this space to include a timestamp which
D 5
it uses in the computation of round trip times.  This explains why if
less than eight bytes of pad are requested, no round trip times are given.
.SH Duplicate and Damaged packets
\fIPing\fR will report duplicate and damaged packets.
E 5
I 5
it uses in the computation of round trip times.
If less than eight bytes of pad are specified, no round trip times are
given.
D 7
.SH DUPLICATE AND DAMAGED PACKETS
.I Ping
E 7
I 7
.Sh DUPLICATE AND DAMAGED PACKETS
.Nm Ping
E 7
will report duplicate and damaged packets.
E 5
Duplicate packets should never occur, and seem to be caused by
inappropriate link-level retransmissions.
D 5
The author has seen duplicates in many situations and has never known them
to be a good thing, although the presence of low levels of
duplicates may not always be cause for alarm.
Network maintainers ignore them at
their own risk as they have been known to be harbingers of severe
network problems.
E 5
I 5
Duplicates may occur in many situations and are rarely (if ever) a
good sign, although the presence of low levels of duplicates may not
always be cause for alarm.
E 5
D 7
.PP
E 7
I 7
.Pp
E 7
D 5
Damaged packets are obviously serious cause for alarm and most likely
indicate broken hardware somewhere in the \fIping\fR packet's path
(in the network or in the hosts).
.SH Trying Different Data Patterns
It should go without saying that the (inter)network layer 
\fIshould\fR never treat packets differently depending on the
data contained in the data portion.
E 5
I 5
Damaged packets are obviously serious cause for alarm and often
indicate broken hardware somewhere in the
D 7
.I ping
E 7
I 7
.Nm ping
E 7
packet's path (in the network or in the hosts).
D 7
.SH TRYING DIFFERENT DATA PATTERNS
E 7
I 7
.Sh TRYING DIFFERENT DATA PATTERNS
E 7
The (inter)network layer should never treat packets differently depending
on the data contained in the data portion.
E 5
Unfortunately, data-dependent problems have been known to sneak into
networks and remain undetected for long periods of time.
In many cases the particular pattern that will have problems is something
D 5
that doesn't have "enough" transitions, such as all ones or all zeros,
or a pattern right at the edge, such as almost all zeros.
E 5
I 5
that doesn't have sufficient ``transitions'', such as all ones or all
zeros, or a pattern right at the edge, such as almost all zeros.
E 5
It isn't necessarily enough to specify a data pattern of all zeros (for
D 5
example) on the command line (as in \fB-p 00\fR), because the pattern
that is of interest is at the data link level, and the relationship
between what you type and what the controllers transmit can be
complicated.
E 5
I 5
example) on the command line because the pattern that is of interest is
at the data link level, and the relationship between what you type and
what the controllers transmit can be complicated.
E 5
D 7
.PP
E 7
I 7
.Pp
E 7
D 5
This means that if you have a data-dependent problem you will have
to be prepared to do a lot of testing to find it. 
E 5
I 5
This means that if you have a data-dependent problem you will probably
have to do a lot of testing to find it.
E 5
If you are lucky, you may manage to find a file that either can't be sent
across your network or that takes much longer to transfer than other
similar length files.
You can then examine this file for repeated patterns that you can test
D 7
using the \fI-p\fR option of \fIping\fR.
D 5
.SH TTL Details
E 5
I 5
.SH TTL DETAILS
E 5
The TTL value of an IP packet represents the maximum number of IP routers
E 7
I 7
using the
.Fl p
option of
.Nm ping .
.Sh TTL DETAILS
The
.Tn TTL
value of an IP packet represents the maximum number of IP routers
E 7
that the packet can go through before being thrown away.
D 5
In current practice you can expect each router in the Internet to decrement the
TTL field by exactly one.
E 5
I 5
In current practice you can expect each router in the Internet to decrement
D 7
the TTL field by exactly one.
E 5
.PP
D 5
The TCP/IP specification says that the TTL field for TCP packets should
E 5
I 5
The TCP/IP specification states that the TTL field for TCP packets should
E 5
be set to 60, but many systems use smaller values (4.3 BSD uses 30, 4.2 used
E 7
I 7
the
.Tn TTL
field by exactly one.
.Pp
The
.Tn TCP/IP
specification states that the
.Tn TTL
field for
.Tn TCP
packets should
be set to 60, but many systems use smaller values (4.3
.Tn BSD
uses 30, 4.2 used
E 7
15).
D 7
.PP
E 7
I 7
.Pp
E 7
The maximum possible value of this field is 255, and most Unix systems set
D 7
the TTL field of ICMP ECHO_REQUEST packets to 255.
E 7
I 7
the
.Tn TTL
field of
.Tn ICMP ECHO_REQUEST
packets to 255.
E 7
D 5
This is why you will find you can "ping" some hosts, but not reach them with
telnet or ftp.
E 5
I 5
This is why you will find you can ``ping'' some hosts, but not reach them
with
D 7
.I telnet
E 7
I 7
.Xr telnet 1
E 7
or
D 7
.IR ftp .
E 5
.PP
E 7
I 7
.Xr ftp 1 .
.Pp
E 7
In normal operation ping prints the ttl value from the packet it receives.
When a remote system receives a ping packet, it can do one of three things
D 7
with the TTL field in its response:
.TP
D 5
.B (1)
Not change it; this is what Berkeley Unix systems did until 4.3 BSD tahoe
level releases.
E 5
I 5
--
Not change it; this is what Berkeley Unix systems did before the 4.3BSD-tahoe
E 7
I 7
with the
.Tn TTL
field in its response:
.Bl -bullet
.It
Not change it; this is what Berkeley Unix systems did before the
.Bx 4.3 tahoe
E 7
release.
E 5
D 7
In this case the TTL value in the received packet will be 255 minus the
E 7
I 7
In this case the
.Tn TTL
value in the received packet will be 255 minus the
E 7
number of routers in the round-trip path.
D 7
.TP
D 5
.B (2)
Set it to 255; this is what Berkeley Unix systems have done since the 4.3
tahoe release.
In this case the TTL value in the received packet will be 255 minus the number
of routers in the path \fIfrom\fR the remote system \fIto\fR the
\fIping\fRing host.
E 5
I 5
--
E 7
I 7
.It
E 7
Set it to 255; this is what current Berkeley Unix systems do.
D 7
In this case the TTL value in the received packet will be 255 minus the
E 7
I 7
In this case the
.Tn TTL
value in the received packet will be 255 minus the
E 7
number of routers in the path
D 7
.I from
E 7
I 7
.Xr from
E 7
the remote system
D 7
.I to
E 7
I 7
.Em to
E 7
the
D 7
.IR ping ing
E 7
I 7
.Nm ping Ns Em ing
E 7
host.
E 5
D 7
.TP
D 5
.B (3)
E 5
I 5
--
E 7
I 7
.It
E 7
E 5
Set it to some other value.
D 7
Some machines use the same value for ICMP packets that they use for
TCP packets, for example either 30 or 60.
E 7
I 7
Some machines use the same value for
.Tn ICMP
packets that they use for
.Tn TCP
packets, for example either 30 or 60.
E 7
Others may use completely wild values.
D 7
.SH BUGS
Many Hosts and Gateways ignore the RECORD_ROUTE option.
.PP
D 5
The maximum IP header length is too small for options like
RECORD_ROUTE to be completely useful.  There's not much that
we can do about that however.
E 5
I 5
The maximum IP header length is too small for options like RECORD_ROUTE to
E 7
I 7
.El
.Sh BUGS
Many Hosts and Gateways ignore the
.Tn RECORD_ROUTE
option.
.Pp
The maximum IP header length is too small for options like
.Tn RECORD_ROUTE
to
E 7
be completely useful.
There's not much that that can be done about this, however.
E 5
D 7
.PP
E 7
I 7
.Pp
E 7
D 5
Flood pinging is not recommended in general, and flood pinging the broadcast
address should only be done under very controlled conditions.
E 4
E 2
.SH AUTHOR
Mike Muuss
E 5
I 5
Flood pinging is not recommended in general, and flood pinging the
broadcast address should only be done under very controlled conditions.
E 5
D 7
.SH SEE ALSO
D 2
netstat(8),
ifconfig(5)
E 2
I 2
D 3
netstat(1),
ifconfig(8C)
E 3
I 3
D 4
netstat(1), ifconfig(8)
E 4
I 4
D 5
netstat(1),
ifconfig(8C)
E 5
I 5
netstat(1), ifconfig(8), routed(8)
E 7
I 7
.Sh SEE ALSO
.Xr netstat 1 ,
.Xr ifconfig 8 ,
.Xr routed 8
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.3 .
E 7
E 5
E 4
E 3
E 2
E 1
