usr.sbin/rwhod/SCCS/s.rwhod.8
h31676
s 00001/00001/00119
d D 8.2 93/12/11 23:44:47 mckusick 8 7
c copyediting for Usenix manuals
e
s 00002/00002/00118
d D 8.1 93/06/06 14:05:23 bostic 7 6
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00052/00042/00068
d D 6.5 91/03/16 18:13:23 cael 6 5
c macro and text revision (-mdoc version 3)
e
s 00004/00014/00106
d D 6.4 90/06/24 22:32:36 trent 5 4
c new copyright & pathnames (rwhod & /var/rwho)
e
s 00016/00006/00104
d D 6.3 88/09/19 22:00:56 bostic 4 3
c Berkeley header
e
s 00013/00012/00097
d D 6.2 86/05/24 22:44:01 karels 3 2
c update
e
s 00001/00001/00108
d D 6.1 85/04/27 15:59:18 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00109/00000/00000
d D 5.1 85/04/27 15:59:10 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
D 4
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 4
I 4
D 6
.\" Copyright (c) 1983 The Regents of the University of California.
E 6
I 6
D 7
.\" Copyright (c) 1983, 1991 The Regents of the University of California.
E 6
.\" All rights reserved.
E 7
I 7
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 7
E 4
.\"
I 4
D 5
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 5
I 5
.\" %sccs.include.redist.man%
E 5
.\"
E 4
D 6
.\"	%W% (Berkeley) %G%
E 6
I 6
.\"     %W% (Berkeley) %G%
E 6
.\"
D 2
.TH RWHOD 8C "4 March 1983"
E 2
I 2
D 4
.TH RWHOD 8C "%Q%"
E 4
I 4
D 6
.TH RWHOD 8 "%Q%"
E 4
E 2
.UC 5
.SH NAME
rwhod \- system status server
.SH SYNOPSIS
D 5
.B /etc/rwhod
E 5
I 5
.B rwhod
E 5
.SH DESCRIPTION
.I Rwhod
E 6
I 6
.Dd %Q%
.Dt RWHOD 8
.Os BSD 4.2
.Sh NAME
.Nm rwhod
.Nd system status server
.Sh SYNOPSIS
.Nm rwhod
.Sh DESCRIPTION
.Nm Rwhod
E 6
is the server which maintains the database used by the
D 6
.IR rwho (1C)
E 6
I 6
.Xr rwho 1
E 6
and
D 6
.IR ruptime (1C)
E 6
I 6
.Xr ruptime 1
E 6
programs.  Its operation is predicated on the ability to
D 6
.I broadcast
E 6
I 6
.Em broadcast
E 6
messages on a network.
D 6
.PP
.I Rwhod
E 6
I 6
.Pp
.Nm Rwhod
E 6
operates as both a producer and consumer of status information.
As a producer of information it periodically
queries the state of the system and constructs
status messages which are broadcast on a network.
As a consumer of information, it listens for other
D 6
.I rwhod
E 6
I 6
.Nm rwhod
E 6
servers' status messages, validating them, then recording
them in a collection of files located in the directory
D 5
.IR /usr/spool/rwho .
E 5
I 5
D 6
.IR /var/rwho .
E 5
.PP
E 6
I 6
.Pa /var/rwho .
.Pp
E 6
D 3
The
.I rwho
server transmits and receives messages at the port indicated
in the ``rwho'' service specification, see 
E 3
I 3
The server transmits and receives messages at the port indicated
in the ``rwho'' service specification; see 
E 3
D 6
.IR services (5).
E 6
I 6
.Xr services 5 .
E 6
The messages sent and received, are of the form:
D 6
.PP
.nf
.ta 0.5i 1.0i 1.5i
E 6
I 6
.Bd -literal -offset indent
E 6
struct	outmp {
	char	out_line[8];		/* tty name */
	char	out_name[8];		/* user id */
	long	out_time;		/* time on */
};
D 6
.sp
E 6
I 6

E 6
struct	whod {
	char	wd_vers;
	char	wd_type;
	char	wd_fill[2];
	int	wd_sendtime;
	int	wd_recvtime;
	char	wd_hostname[32];
	int	wd_loadav[3];
	int	wd_boottime;
	struct	whoent {
		struct	outmp we_utmp;
		int	we_idle;
	} wd_we[1024 / sizeof (struct whoent)];
};
D 6
.fi
.PP
E 6
I 6
.Ed
.Pp
E 6
All fields are converted to network byte order prior to
transmission.  The load averages are as calculated by the
D 6
.IR w (1)
E 6
I 6
.Xr w 1
E 6
program, and represent load averages over the 5, 10, and 15 minute 
D 3
intervals prior to a server's transmission.  The host name
E 3
I 3
intervals prior to a server's transmission; they are multiplied by 100
for representation in an integer.  The host name
E 3
included is that returned by the
D 6
.IR gethostname (2)
E 6
I 6
.Xr gethostname 2
E 6
D 3
system call.
E 3
I 3
system call, with any trailing domain name omitted.
E 3
The array at the end of the message contains information about
the users logged in to the sending machine.  This information 
includes the contents of the 
D 6
.IR utmp (5)
E 6
I 6
.Xr utmp 5
E 6
entry for each non-idle terminal line and a value indicating the
D 3
time since a character was last received on the terminal line.
E 3
I 3
time in seconds since a character was last received on the terminal line.
E 3
D 6
.PP
E 6
I 6
.Pp
E 6
Messages received by the
D 6
.I rwho
E 6
I 6
.Xr rwho
E 6
D 3
server are discarded unless they originated at a
E 3
I 3
server are discarded unless they originated at an
E 3
D 6
.I rwho
E 6
I 6
.Xr rwho
E 6
server's port.  In addition, if the host's name, as specified
D 6
in the message, contains any unprintable ASCII characters, the
E 6
I 6
in the message, contains any unprintable
.Tn ASCII
characters, the
E 6
message is discarded.  Valid messages received by
D 6
.I rwhod
E 6
I 6
.Nm rwhod
E 6
are placed in files named
D 6
.IR whod . hostname
E 6
I 6
.Pa whod.hostname
E 6
in the directory
D 5
.IR /usr/spool/rwho .
E 5
I 5
D 6
.IR /var/rwho .
E 6
I 6
.Pa /var/rwho .
E 6
E 5
These files contain only the most recent message, in the
format described above.
D 6
.PP
E 6
I 6
.Pp
E 6
Status messages are generated approximately once every
D 3
60 seconds.  
E 3
I 3
3 minutes.
E 3
D 6
.I Rwhod
E 6
I 6
.Nm Rwhod
E 6
performs an
D 6
.IR nlist (3)
D 3
on /vmunix every 10 minutes to guard against
E 3
I 3
on /vmunix every 30 minutes to guard against
E 6
I 6
.Xr nlist 3
on
.Pa /vmunix
every 30 minutes to guard against
E 6
E 3
the possibility that this file is not the system
image currently operating.
D 6
.SH "SEE ALSO"
D 4
rwho(1C),
ruptime(1C)
E 4
I 4
rwho(1), ruptime(1)
E 4
.SH BUGS
E 6
I 6
.Sh SEE ALSO
.Xr rwho 1 ,
.Xr ruptime 1
.Sh BUGS
E 6
D 3
Should relay status information between networks. 
People often interpret the server dieing
E 3
I 3
There should be a way to relay status information between networks. 
Status information should be sent only upon request rather than continuously.
People often interpret the server dying
D 8
or network communtication failures
E 8
I 8
or network communication failures
E 8
E 3
as a machine going down.
I 6
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.2 .
E 6
E 1
