usr.sbin/lpr/lpq/SCCS/s.lpq.1
h61561
s 00005/00003/00105
d D 8.2 95/04/28 12:34:10 tef 14 13
c Added -a flag.
e
s 00002/00002/00106
d D 8.1 93/06/06 14:00:24 bostic 13 12
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00029/00030/00079
d D 6.10 91/05/09 16:59:34 cael 12 11
c mdoc version three
e
s 00002/00000/00107
d D 6.9 91/03/14 00:29:40 cael 11 9
c add .Vx so tmac.andoc will call tmac.mdoc-old
e
s 00001/00000/00107
d R 6.9 91/03/13 20:39:15 cael 10 9
c add .Vx so tmac.andoc will call tmac.mdoc-old
e
s 00004/00003/00103
d D 6.8 90/07/24 22:47:49 cael 9 8
c .Xr botch fix
e
s 00074/00045/00032
d D 6.7 90/06/30 01:30:11 cael 8 7
c converted man page
e
s 00004/00014/00073
d D 6.6 90/06/24 19:10:08 cael 7 6
c converted man page
e
s 00014/00003/00073
d D 6.5 88/09/29 09:32:21 bostic 6 5
c add Berkeley copyright notice
e
s 00008/00021/00068
d D 6.4 87/04/30 18:07:26 bostic 5 4
c removed '+' flag documentation
e
s 00004/00006/00085
d D 6.3 87/04/29 15:56:48 bostic 4 3
c mention the + default
e
s 00002/00002/00089
d D 6.2 86/06/05 18:29:59 bloom 3 2
c fix plus because cfo decided to change things
e
s 00001/00001/00090
d D 6.1 85/04/29 21:11:43 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00091/00000/00000
d D 5.1 85/04/29 21:11:34 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
D 6
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 6
I 6
D 7
.\" Copyright (c) 1983 The Regents of the University of California.
E 7
I 7
D 13
.\" Copyright (c) 1983, 1990 The Regents of the University of California.
E 7
.\" All rights reserved.
E 13
I 13
.\" Copyright (c) 1983, 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 13
.\"
D 7
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 7
I 7
D 12
.\" %sccs.include.redist.man%
E 12
I 12
.\" %sccs.include.redist.roff%
E 12
E 7
E 6
.\"
D 7
.\"	%W% (Berkeley) %G%
E 7
I 7
.\"     %W% (Berkeley) %G%
E 7
.\"
I 11
D 12
.Vx
.Vx
E 12
E 11
D 2
.TH LPQ 1 "18 July 1983"
E 2
I 2
D 7
.TH LPQ 1 "%Q%"
E 7
I 7
D 8
.TH LPQ 1 "%Q"
E 7
E 2
.UC 5
.SH NAME
lpq \- spool queue examination program
.SH SYNOPSIS
.B lpq
D 5
[ +[ n ] ] [ -l ] [ \-Pprinter ] [ job # ... ] [ user ... ]
E 5
I 5
[ -l ] [ \-Pprinter ] [ job # ... ] [ user ... ]
E 5
.SH DESCRIPTION
.I lpq
E 8
I 8
.Dd %Q%
.Dt LPQ 1
.Os BSD 4.2
.Sh NAME
.Nm lpq
.Nd spool queue examination program
.Sh SYNOPSIS
.Nm lpq
I 14
.OP Fl a
E 14
.Op Fl l
D 12
.Oo
.Op Fl P Ar printer
.Oo
E 12
I 12
.Op Fl P Ns Ar printer
E 12
.Op  job # ...
.Op  user ...
.Sh DESCRIPTION
D 9
.Nm lpq
E 9
I 9
.Nm Lpq
E 9
E 8
examines the spooling area used by
D 8
.IR lpd (8)
E 8
I 8
.Xr lpd  8
E 8
D 5
for printing
files on the line printer, and reports the status of the specified jobs or
all jobs associated with a user. 
.I lpq
invoked without any arguments
reports on any jobs currently in the queue.  A
E 5
I 5
for printing files on the line printer, and reports the status of the
D 8
specified jobs or all jobs associated with a user.  \fIlpq\fP invoked
without any arguments reports on any jobs currently in the queue.  A
E 5
.B \-P
D 5
flag may be used
to specify a particular printer, otherwise the default line printer
is used (or the value of the PRINTER variable in the environment).
If a
D 3
.B \+
E 3
I 3
.B \(pl
E 3
argument is supplied,
.I lpq
displays the spool queue until it empties.  Supplying a number
immediately after the
D 3
.B \+
E 3
I 3
.B \(pl
E 3
D 4
sign indicates that
.I lpq
should sleep \fIn\fR seconds in between scans of the queue.
All other arguments supplied are
interpreted as user names or job numbers to filter out only those
jobs of interest.
E 4
I 4
sign changes the number of seconds that \fIlpq\fP should sleep inbetween
scans of the queue, from the default, 30, to \fIn\fP.  All other arguments
supplied are interpreted as user names or job numbers to filter out only
those jobs of interest.
E 5
I 5
flag may be used to specify a particular printer, otherwise the default
line printer is used (or the value of the PRINTER variable in the
E 8
I 8
specified jobs or all jobs associated with a user.
D 9
.Nm lpq
E 9
I 9
.Nm Lpq
E 9
invoked
without any arguments reports on any jobs currently in the queue.
.Pp
Options:
.Pp
I 9
D 12
.Tw Ds
E 9
.Tp Fl P
E 12
I 12
.Bl -tag -width indent
.It Fl P
E 12
Specify a particular printer, otherwise the default
line printer is used (or the value of the
.Ev PRINTER
variable in the
E 8
environment). All other arguments supplied are interpreted as user
names or job numbers to filter out only those jobs of interest.
E 5
E 4
D 8
.PP
For each job submitted (i.e. invocation of 
.IR lpr (1))
.I lpq
E 8
I 8
D 12
.Tp Fl l
E 12
I 12
.It Fl l
E 12
Information about each of the files comprising the job entry
is printed.
Normally, only as much information as will fit on one line is displayed.
I 14
.It Fl a
Report on the local queues for all printers,
rather than just the specified printer.
E 14
D 12
.Tp
E 12
I 12
.El
E 12
.Pp
For each job submitted (i.e. invocation of
.Xr lpr  1  )
.Nm lpq
E 8
reports the user's name, current rank in the queue, the
names of files comprising the job, the job identifier (a number which
may be supplied to
D 8
.IR lprm (1)
E 8
I 8
.Xr lprm  1
E 8
for removing a specific job), and the total size in bytes.
D 8
The
.B \-l
option causes information about each of the files comprising the job
to be printed.
Normally, only as much information as will fit on one line is displayed.
E 8
Job ordering is dependent on
the algorithm used to scan the spooling directory and is supposed
D 12
to be FIFO (First in First Out).
E 12
I 12
to be
.Tn FIFO
(First in First Out).
E 12
File names comprising a job may be unavailable
(when
D 8
.IR lpr (1)
E 8
I 8
.Xr lpr  1
E 8
is used as a sink in a pipeline) in which case the file
D 12
is indicated as ``(standard input)".
E 12
I 12
is indicated as ``(standard input)''.
E 12
D 8
.PP
E 8
I 8
.Pp
E 8
If
D 8
.I lpq
E 8
I 8
.Nm lpq
E 8
warns that there is no daemon present (i.e. due to some malfunction),
the
D 8
.IR lpc (8)
E 8
I 8
.Xr lpc  8
E 8
command can be used to restart the printer daemon.
D 8
.SH FILES
.nf
.ta \w'/etc/termcap            'u
/etc/termcap	for manipulating the screen for repeated display
/etc/printcap	to determine printer characteristics
/usr/spool/*	the spooling directory, as determined from printcap
/usr/spool/*/cf*	control files specifying jobs
/usr/spool/*/lock	the lock file to obtain the currently active job 
.fi
.SH "SEE ALSO"
lpr(1),
lprm(1),
lpc(8),
lpd(8)
.SH BUGS
E 8
I 8
.Sh ENVIRONMENT
If the following environment variable exists, it is used by
.Nm lpq :
D 12
.Tw Fl
.Tp Ev PRINTER
E 12
I 12
.Bl -tag -width PRINTER
.It Ev PRINTER
E 12
Specifies an alternate default printer.
D 12
.Tp
E 12
I 12
.El
E 12
.Sh FILES
D 12
.Dw /usr/share/misc/termcap
.Di L
.Dp Pa /usr/share/misc/termcap
for manipulating the screen for repeated display
.Dp Pa /etc/printcap
to determine printer characteristics
.Dp Pa /var/spool/*
the spooling directory, as determined from printcap
.Dp Pa /var/spool/*/cf*
control files specifying jobs
.Dp Pa /var/spool/*/lock
the lock file to obtain the currently active job
.Dp
E 12
I 12
D 14
.Bl -tag -width /usr/share/misc/termcap -compact
E 14
I 14
.Bl -tag -width "/var/spool/*/lock" -compact
E 14
.It Pa /etc/printcap
To determine printer characteristics.
.It Pa /var/spool/*
The spooling directory, as determined from printcap.
.It Pa /var/spool/*/cf*
Control files specifying jobs.
.It Pa /var/spool/*/lock
The lock file to obtain the currently active job.
D 14
.It Pa /usr/share/misc/termcap
For manipulating the screen for repeated display.
E 14
.El
E 12
.Sh SEE ALSO
.Xr lpr 1 ,
.Xr lprm 1 ,
.Xr lpc 8 ,
.Xr lpd 8
.Sh HISTORY
D 9
.Nm
E 9
I 9
.Nm Lpq
E 9
D 12
appeared in 3 BSD.
E 12
I 12
appeared in
.Bx 3 .
E 12
.Sh BUGS
E 8
Due to the dynamic nature of the information in the spooling directory
D 12
lpq may report unreliably.
E 12
I 12
.Nm lpq
may report unreliably.
E 12
Output formatting is sensitive to the line length of the terminal;
this can results in widely spaced columns.
D 8
.SH DIAGNOSTICS
E 8
I 8
.Sh DIAGNOSTICS
E 8
Unable to open various files.  The lock file being malformed.  Garbage
files when there is no daemon active, but files in the spooling directory.
E 1
