share/man/man8/man8.vax/SCCS/s.drtest.8
h11777
s 00002/00002/00086
d D 8.1 93/06/05 13:57:55 bostic 5 4
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00063/00049/00025
d D 6.3 91/03/16 18:10:06 cael 4 3
c macro and text revision (-mdoc version 3)
e
s 00001/00002/00073
d D 6.2 86/05/19 19:03:10 karels 3 2
c 8 => 8V
e
s 00001/00001/00074
d D 6.1 85/04/27 14:54:14 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00075/00000/00000
d D 5.1 85/04/27 14:53:53 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
D 4
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 4
I 4
D 5
.\" Copyright (c) 1983, 1991 Regents of the University of California.
.\" All rights reserved.
E 5
I 5
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 5
E 4
.\"
D 4
.\"	%W% (Berkeley) %G%
E 4
I 4
.\" %sccs.include.redist.man%
E 4
.\"
D 2
.TH DRTEST 8 "26 January 1983"
E 2
I 2
D 4
.TH DRTEST 8 "%Q%"
E 2
.UC 5
.SH NAME
drtest \- standalone disk test program
.SH DESCRIPTION
.PP
.I Drtest
E 4
I 4
.\"     %W% (Berkeley) %G%
.\"
.Dd %Q%
.Dt DRTEST 8
.Os BSD 4.2
.Sh NAME
.Nm drtest
.Nd standalone disk test program
.Sh DESCRIPTION
.Nm Drtest
E 4
is a standalone program used to read a disk 
track by track. 
It was primarily intended as a test program 
for new standalone drivers, but has shown
useful in other contexts as well, such as 
verifying disks and running speed
tests. For example, when a disk has been formatted
D 4
(by format(8)), you can check that
E 4
I 4
(by
.Xr format 8 ) ,
you can check that
E 4
hard errors has been taken care of by running 
D 4
.IR drtest .
E 4
I 4
.Nm drtest .
E 4
No hard errors should be found, but in many cases 
D 4
quite a few soft ECC errors will be reported.
.PP
E 4
I 4
quite a few soft
.Tn ECC
errors will be reported.
.Pp
E 4
While
D 4
.I drtest
E 4
I 4
.Nm drtest
E 4
is running, the cylinder number is printed on
the console for every 10th cylinder read.
D 4
.SH EXAMPLE
E 4
I 4
.Sh EXAMPLE
E 4
A sample run of 
D 4
.I drtest
E 4
I 4
.Xr drtest
E 4
is shown below.  
In this example (using a 750), 
D 4
.I drtest
E 4
I 4
.Nm drtest
E 4
is loaded from the root file system;
usually it
will be loaded from the machine's
console storage device.  Boldface means user input.
As usual, ``#'' and ``@'' may be used to edit input.
D 4
.nf
.in +5
.sp 1
>>>\fBB/3\fR
%%
loading hk(0,0)boot 
Boot
: \fBhk(0,0)drtest\fR
Test program for stand-alone up and hp driver
.sp 1
Debugging level (1=bse, 2=ecc, 3=bse+ecc)?
Enter disk name [type(adapter,unit), e.g. hp(1,3)]? \fBhp(0,0)\fR
Device data: #cylinders=1024, #tracks=16, #sectors=32
Testing hp(0,0), chunk size is 16384 bytes.
\fI(chunk size is the number of bytes read per disk access)\fP
Start ...Make sure hp(0,0) is online
 ...
\fI(errors are reported as they occur)\fP
 ...
\fI(...program restarts to allow checking other disks)\fP
\fI(...to abort halt machine with ^P)\fP
.in -5
.fi
.sp 1
.SH DIAGNOSTICS
E 4
I 4
.Pp
.Bd -unfilled -offset indent -compact
.Li \&>>> Ns Sy B/3
.Li \&%%
.Li \&loading hk(0,0)boot 
.Li \&Boot
.Li \&: Sy \&hk(0,0)drtest
.Li Test program for stand-alone up and hp driver

.Li Debugging level (1=bse, 2=ecc, 3=bse+ecc)?
.Li Enter disk name [type(adapter,unit),\ e.g.\ hp(1,3)]? Sy hp(0,0)
.Li Device data: #cylinders=1024, #tracks=16, #sectors=32
.Li Testing hp(0,0), chunk size is 16384 bytes.
.Em (chunk\ size\ is\ the\ number\ of\ bytes read per disk access)
.Li Start ...Make sure hp(0,0) is online
.Li \ ...
.Em (errors are reported as they occur)
.Li \ ...
.Em (...program restarts to allow checking other disks)
.Em (...to abort halt machine with \&^P)
.Ed
.Sh DIAGNOSTICS
E 4
The diagnostics are intended to be self explanatory. Note, however, that 
the device number
D 4
in the diagnostic messages is identified as  \fItypeX\fR instead of 
\fItype(a,u)\fR where \fIX\fR = a*8+u, e.g., hp(1,3) becomes hp11.
.SH SEE ALSO
D 3
format(8), bad144(8)
E 3
I 3
format(8V), bad144(8)
E 3
.SH AUTHOR
E 4
I 4
in the diagnostic messages is identified as
.Em typeX
instead of 
.Em type(a,u)
where
.Ar X
\&= a*8+u, e.g., hp(1,3) becomes hp11.
.Sh SEE ALSO
.Xr format 8 ,
.Xr bad144 8
.Sh AUTHOR
E 4
Helge Skrivervik
I 4
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.2 .
E 4
D 3

E 3
E 1
