share/man/man8/man8.vax/SCCS/s.installboot.8
h51984
s 00002/00002/00052
d D 8.1 93/06/05 13:58:06 bostic 3 2
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00044/00031/00010
d D 7.2 91/03/16 18:10:10 cael 2 1
c macro and text revision (-mdoc version 3)
e
s 00041/00000/00000
d D 7.1 86/06/19 20:59:40 mckusick 1 0
c from Jay Lepreau
e
u
U
t
T
I 1
D 2
.\" Copyright (c) 1986 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 2
I 2
D 3
.\" Copyright (c) 1986, 1991 Regents of the University of California.
.\" All rights reserved.
E 3
I 3
.\" Copyright (c) 1986, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 3
E 2
.\"
D 2
.\"	%W% (Berkeley) %G%
E 2
I 2
.\" %sccs.include.redist.man%
E 2
.\"
D 2
.TH INSTALLBOOT 8V "%Q%"
.UC 7
.SH NAME
installboot \- installs a boot program in a file system
.SH SYNOPSIS
.B /usr/mdec/installboot
bootblock bootprog special
.SH DESCRIPTION
.I Installboot
E 2
I 2
.\"     %W% (Berkeley) %G%
.\"
.Dd %Q%
.Dt INSTALLBOOT 8
.Os BSD 4.3t
.Sh NAME
.Nm installboot
.Nd installs a boot program in a file system
.Sh SYNOPSIS
.Nm installboot
.Ar bootblock bootprog special
.Sh DESCRIPTION
.Xr Installboot
E 2
concatentates
D 2
.I bootblock
E 2
I 2
.Ar bootblock
E 2
and
D 2
.I bootprog
and writes at most BBSIZE bytes (from <sys/fs.h>)
E 2
I 2
.Ar bootprog
and writes at most
.Dv BBSIZE
bytes (from
.Aq Pa sys/fs.h )
E 2
of them on the first bytes of
D 2
.IR special .
.SH FILES
/usr/mdec/??boot	boot blocks
.br
/usr/mdec/boot??	boot programs
.SH SEE ALSO
newfs(8), dd(1)
.SH EXAMPLES
E 2
I 2
.Ar special .
.Sh FILES
.Bl -tag -width /usr/mdec/bootxxx -compact
.It Pa /usr/mdec/??boot
boot blocks
.It Pa /usr/mdec/boot??
boot programs
.El
.Sh SEE ALSO
.Xr newfs 8 ,
.Xr dd 1
.Sh EXAMPLES
.Bd -literal -offset indent -compact
E 2
cd /usr/mdec
D 2
.br
E 2
installboot raboot bootra /dev/ra0a
D 2
.SH HISTORY
.I Installboot
comes undocumented with 4.2BSD.
This manual page was written by Geoff Collyer.
.SH BUGS
E 2
I 2
.Ed
.Sh BUGS
E 2
There is no convenient way to determine the names of the boot blocks
and boot programs without
D 2
.I "a priori"
E 2
I 2
.Em a priori
E 2
knowledge of one's make of disk.
I 2
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.3 tahoe .
This manual page was written by Geoff Collyer.
E 2
E 1
