usr.bin/netstat/SCCS/s.netstat.1
h64446
s 00001/00001/00262
d D 8.8 94/04/18 21:02:26 bostic 27 26
c spell
e
s 00039/00039/00224
d D 8.7 94/03/28 07:57:53 bostic 26 25
c sort options, use a table for the flags, not a literal
e
s 00028/00004/00235
d D 8.6 94/03/27 22:22:03 sklower 25 24
c yet more flags, document getting ISO specific stats
e
s 00003/00003/00236
d D 8.5 94/03/01 05:45:20 bostic 24 23
c add -d to the synopsis statements
e
s 00007/00006/00232
d D 8.4 94/01/04 11:41:54 bostic 23 22
c use -g for multicast instead of -B (follow BSDI)
e
s 00033/00018/00205
d D 8.3 94/01/02 14:11:25 bostic 22 21
c update of netstat from Mike Karels at BSDI
e
s 00001/00001/00222
d D 8.2 93/12/30 15:39:03 mckusick 21 20
c copyediting for Usenix manuals
e
s 00002/00002/00221
d D 8.1 93/06/12 17:05:17 bostic 20 19
c add 1993 to the copyright notice, yank to 8.1 for 4.4BSD snapshot
e
s 00001/00005/00222
d D 6.16 93/06/12 16:45:18 mckusick 19 17
c delete -h option for printing out IMP host table
e
s 00002/00002/00225
d R 8.1 93/06/06 15:44:04 bostic 18 17
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00012/00006/00215
d D 6.15 92/07/20 11:22:24 sklower 17 16
c multicast changes from deering, LBL
e
s 00030/00035/00191
d D 6.14 91/07/27 17:45:10 cael 16 15
c mdoc version three
e
s 00039/00032/00187
d D 6.13 91/04/23 18:50:26 bostic 15 14
c cleanup and standardization -- add -M, -N, -w
e
s 00002/00000/00217
d D 6.12 91/03/14 00:23:26 cael 14 12
c add .Vx so tmac.andoc will call tmac.mdoc-old
e
s 00001/00000/00217
d R 6.12 91/03/13 20:35:54 cael 13 12
c add .Vx so tmac.andoc will call tmac.mdoc-old
e
s 00004/00004/00213
d D 6.11 90/07/24 22:49:17 cael 12 11
c .Xr botch fix
e
s 00001/00001/00216
d D 6.10 90/06/26 01:00:17 cael 11 10
c converted man page
e
s 00113/00142/00104
d D 6.9 90/06/11 05:57:44 cael 10 9
c converted man page
e
s 00015/00004/00231
d D 6.8 88/09/20 18:31:09 bostic 9 8
c Berkeley specific header
e
s 00008/00002/00227
d D 6.7 88/05/14 10:23:36 karels 8 7
c add -d
e
s 00023/00000/00206
d D 6.6 86/08/11 12:21:59 kupfer 7 6
c -p is now implemented.
e
s 00095/00065/00111
d D 6.5 86/05/08 15:09:09 karels 6 5
c update for 4.3
e
s 00004/00003/00172
d D 6.4 85/12/08 16:55:47 mckusick 5 4
c format glitches
e
s 00016/00000/00159
d D 6.3 85/08/16 23:14:54 sklower 4 3
c document -f flag, limiting reporting of statistics to a single address family;
c suggested by mkm.
e
s 00004/00000/00155
d D 6.2 85/04/30 20:59:54 kupfer 3 2
c Note that -p isn't implemented yet.
e
s 00011/00004/00144
d D 6.1 85/04/29 21:12:39 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00148/00000/00000
d D 5.1 85/04/29 21:12:26 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
D 9
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 9
I 9
D 10
.\" Copyright (c) 1983 The Regents of the University of California.
E 10
I 10
D 17
.\" Copyright (c) 1983, 1990 The Regents of the University of California.
E 17
I 17
D 20
.\" Copyright (c) 1983, 1990, 1992  The Regents of the University of California.
E 17
E 10
.\" All rights reserved.
E 20
I 20
.\" Copyright (c) 1983, 1990, 1992, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 20
E 9
.\"
I 9
D 10
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 10
I 10
D 16
.\" %sccs.include.redist.man%
E 16
I 16
.\" %sccs.include.redist.roff%
E 16
E 10
.\"
E 9
D 10
.\"	%W% (Berkeley) %G%
E 10
I 10
D 16
.\"     %W% (Berkeley) %G%
E 16
I 16
.\"	%W% (Berkeley) %G%
E 16
E 10
.\"
I 14
D 16
.Vx
E 16
D 15
.Vx
E 15
E 14
D 2
.TH NETSTAT 1 "18 October 1982"
E 2
I 2
D 10
.TH NETSTAT 1 "%Q%"
E 2
.UC 5
.SH NAME
netstat \- show network status
.SH SYNOPSIS
.B netstat
[ 
D 6
.B \-Aahimnrs
E 6
I 6
.B \-Aan
E 6
] [
I 4
.B \-f
.I address_family
] [
E 4
I 2
D 6
.B \-I
.I interface
E 6
I 6
.I system
E 6
] [
E 2
D 6
.B \-p
D 2
.I protocol 
E 2
I 2
.I protocol
E 6
I 6
.I core
]
.br
.B netstat
[ 
.B \-himnrs
E 6
E 2
] [
D 2
.B \-a
] [
E 2
D 6
.I interval
E 6
I 6
.B \-f
.I address_family
E 6
] [
.I system
] [
.I core
]
I 6
.br
.B netstat
[ 
.B \-n
] [
.B \-I
.I interface
]
.I interval
[
.I system
] [
.I core
]
I 7
.br
.B netstat
[ 
.B \-p
.I protocol
] [
.I system
] [
.I core
]
E 7
E 6
.SH DESCRIPTION
E 10
I 10
.Dd %Q%
.Dt NETSTAT 1
.Os BSD 4.2
.Sh NAME
.Nm netstat
.Nd show network status
.Sh SYNOPSIS
.Nm netstat
D 17
.Op Fl Aan
E 17
I 17
D 22
.Op Fl ABan
E 22
I 22
.Op Fl Aan
E 22
E 17
D 11
.Op .Fl f Ar address_family
E 11
I 11
.Op Fl f Ar address_family
E 11
D 22
.Op Ar system
.Op Ar core
E 22
I 22
.Op Fl M Ar core
.Op Fl N Ar system
E 22
.Nm netstat
D 17
.Op Fl himnrs
E 17
I 17
D 19
.Op Fl Bhimnrs
E 19
I 19
D 22
.Op Fl Bimnrs
E 22
I 22
D 23
.Op Fl Bhimnrs
E 23
I 23
D 24
.Op Fl ghimnrs
E 24
I 24
.Op Fl dghimnrs
E 24
E 23
E 22
E 19
E 17
.Op Fl f Ar address_family
D 15
.Op Ar system
.Op Ar core
E 15
I 15
.Op Fl M Ar core
.Op Fl N Ar system
E 15
.Nm netstat
D 24
.Op Fl n
.Op Fl I Op Ar interface
E 24
I 24
.Op Fl dn
.Op Fl I Ar interface
E 24
D 15
.Ar interval
.Op Ar system
.Op Ar core
E 15
I 15
.Op Fl M Ar core
.Op Fl N Ar system
.Op Fl w Ar wait
E 15
.Nm netstat
.Op Fl p Ar protocol
D 15
.Op Ar system
.Op Ar core
E 15
I 15
.Op Fl M Ar core
.Op Fl N Ar system
E 15
.Sh DESCRIPTION
E 10
The
D 10
.I netstat 
E 10
I 10
.Nm netstat
E 10
command symbolically displays the contents of various network-related
D 6
data structures.  The options have the following meaning:
E 6
I 6
data structures.
There are a number of output formats,
depending on the options for the information presented.
The first form of the command displays a list of active sockets for
each protocol.
The second form presents the contents of one of the other network
data structures according to the option selected.
D 10
Using the third form, with an 
.I interval
E 10
I 10
D 15
Using the third form, with an
.Ar interval
E 10
specified,
E 15
I 15
Using the third form, with a
.Ar wait
interval specified,
E 15
D 10
.I netstat
E 10
I 10
.Nm netstat
E 10
will continuously display the information regarding packet
traffic on the configured network interfaces.
I 7
The fourth form displays statistics about the named protocol.
E 7
D 10
.PP
E 10
I 10
.Pp
E 10
The options have the following meaning:
E 6
D 10
.TP 
.B \-A
E 10
I 10
D 16
.Tw Fl
.Tp Fl A
E 16
I 16
.Bl -tag -width flag
.It Fl A
E 16
E 10
D 6
show the address of any associated protocol control blocks; used
for debugging
E 6
I 6
With the default display,
show the address of any protocol control blocks associated with sockets; used
for debugging.
I 17
D 22
.It Fl B
With the default display,
show the multicast routing tables.
When
.Fl s
is also present, show multicast routing statistics instead.
E 22
E 17
E 6
D 10
.TP
.B \-a
E 10
I 10
D 16
.Tp Fl a
E 16
I 16
.It Fl a
E 16
E 10
I 6
With the default display,
E 6
show the state of all sockets; normally sockets used by
D 6
server processes are not shown
E 6
I 6
server processes are not shown.
I 22
D 23
.It Fl B
By default, show the IP Multicast virtual-interface and routing tables.
If the
.Fl s
option is also present, show multicast routing statistics.
E 23
E 22
I 8
D 10
.B \-d
E 10
I 10
D 12
.Fl d
E 12
I 12
D 16
.Tp Fl d
E 16
I 16
.It Fl d
E 16
E 12
E 10
With either interface display (option
D 10
.B \-i
E 10
I 10
.Fl i
E 10
or an interval, as described below),
show the number of dropped packets.
I 26
.It Fl f Ar address_family 
Limit statistics or address control block reports to those
of the specified
.Ar address family  .
The following address families
are recognized:
.Ar inet  ,
for
.Dv AF_INET  ,
.Ar ns ,
for
.Dv AF_NS  ,
.Ar iso ,
for
.Dv AF_ISO ,
and
.Ar unix  ,
for
.Dv AF_UNIX  .
E 26
I 23
.It Fl g
Show information related to multicast (group address) routing.
By default, show the IP Multicast virtual-interface and routing tables.
If the
.Fl s
option is also present, show multicast routing statistics.
E 23
I 22
.It Fl h
Show the state of the
.Tn IMP
host table (obsolete).
I 26
.It Fl I Ar interface 
Show information about the specified interface;
used with a
.Ar wait
interval as described below.
E 26
E 22
E 8
E 6
D 10
.TP
.B \-h
E 10
I 10
D 16
.Tp Fl h
E 10
D 6
show the state of the IMP host table
E 6
I 6
Show the state of the IMP host table.
E 6
D 10
.TP
.B \-i
E 10
I 10
.Tp Fl i
E 16
I 16
D 19
.It Fl h
Show the state of the
.Tn IMP
host table.
E 19
.It Fl i
E 16
E 10
D 6
show the state of interfaces which have been auto-configured
E 6
I 6
Show the state of interfaces which have been auto-configured
E 6
(interfaces statically configured into a system, but not
D 6
located at boot time are not shown)
E 6
I 6
located at boot time are not shown).
E 6
I 2
D 10
.TP
.BI \-I " interface"
E 10
I 10
D 16
.Tp Cx Fl I
.Ws
.Ar interface
.Cx
E 16
I 16
D 17
.It Fl I Ar interface 
E 17
I 17
D 22
.It Fl I Ar interface
E 17
E 16
E 10
D 6
show information only about this interface
(see also
E 6
I 6
Show information only about this interface;
E 22
I 22
If the
.Fl a
options is also present, multicast addresses currently in use are shown
for each Ethernet interface and for each IP interface address.
Multicast addresses are shown on separate lines following the interface
address with which they are associated.
D 26
.It Fl I Ar interface 
Show information about the specified interface;
E 22
D 21
used with an
E 21
I 21
used with a
E 21
E 6
D 10
.I interval
E 10
I 10
D 15
.Ar interval
E 10
D 6
below)
E 6
I 6
as described below.
E 15
I 15
.Ar wait
interval as described below.
E 26
D 16
.Tp Fl M
E 16
I 16
.It Fl M
E 16
Extract values associated with the name list from the specified core
instead of the default
.Pa /dev/kmem .
E 15
E 6
E 2
D 10
.TP
.B \-m
E 10
I 10
D 16
.Tp Fl m
E 16
I 16
.It Fl m
E 16
E 10
D 6
show statistics recorded by the memory management routines
(the network manages a ``private share'' of memory)
E 6
I 6
Show statistics recorded by the memory management routines
(the network manages a private pool of memory buffers).
I 15
D 16
.Tp Fl N
E 16
I 16
.It Fl N
E 16
Extract the name list from the specified system instead of the default
.Pa /vmunix .
E 15
E 6
D 10
.TP
.B \-n
D 6
show network addresses as numbers (normally 
E 6
I 6
Show network addresses as numbers (normally 
E 6
.I netstat
E 10
I 10
D 16
.Tp Fl n
E 16
I 16
.It Fl n
E 16
Show network addresses as numbers (normally
.Nm netstat
E 10
interprets addresses and attempts to display them
D 6
symbolically)
E 6
I 6
symbolically).
This option may be used with any of the display formats.
I 7
D 10
.TP
.BI \-p " protocol"
Show statistics about 
.IR protocol ,
E 10
I 10
D 16
.Tp Cx Fl p
.Ws
.Ar protocol
.Cx
E 16
I 16
D 17
.It Fl p Ar protocol 
E 17
I 17
D 22
.It Fl p Ar protocol
E 22
I 22
.It Fl p Ar protocol 
E 22
E 17
E 16
Show statistics about
.Ar protocol  ,
E 10
which is either a well-known name for a protocol or an alias for it.  Some
D 10
protocol names and aliases are listed in the file 
.IR /etc/protocols .
A null response typically means that there are no interesting numbers to 
E 10
I 10
protocol names and aliases are listed in the file
.Pa /etc/protocols .
A null response typically means that there are no interesting numbers to
E 10
report.
The program will complain if
D 10
.I protocol
E 10
I 10
.Ar protocol
E 10
is unknown or if there is no statistics routine for it.
E 7
E 6
D 10
.TP
D 6
.BI \-p " proto"
show the state of sockets utilizing protocol
.IR proto ;
the protocol is specified symbolically, and may be any
protocol listed in the file
.IR /etc/protocols .
.TP
E 6
.B \-s
E 10
I 10
D 16
.Tp Fl s
E 16
I 16
.It Fl s
E 16
E 10
D 6
show per-protocol statistics
E 6
I 6
Show per-protocol statistics.
I 22
If this option is repeated, counters with a value of zero are suppressed.
E 22
E 6
D 10
.TP
.B \-r
E 10
I 10
D 16
.Tp Fl r
E 16
I 16
.It Fl r
E 16
E 10
D 6
show the routing tables
E 6
I 6
Show the routing tables.
When
D 10
.B \-s
E 10
I 10
.Fl s
E 10
is also present, show routing statistics instead.
E 6
I 4
D 10
.TP
.BI \-f " address_family"
E 10
I 10
D 16
.Tp Cx Fl f
.Ws
.Ar address_family
.Cx
E 16
I 16
D 17
.It Fl f Ar address_family 
E 17
I 17
D 22
.It Fl f Ar address_family
E 22
I 22
D 26
.It Fl f Ar address_family 
E 22
E 17
E 16
E 10
D 6
will limit statistics or address control block reports to those
E 6
I 6
Limit statistics or address control block reports to those
E 6
of the specified
D 10
.IR address\ family .
E 10
I 10
.Ar address family  .
E 10
D 6
The two address families
E 6
I 6
The following address families
are recognized:
E 6
D 10
.IR inet ,
E 10
I 10
.Ar inet  ,
E 10
for
D 5
.BR AF_INET and
E 5
I 5
D 6
.B AF_INET
and
E 6
I 6
D 10
.BR AF_INET ,
E 6
E 5
.IR ns ,
E 10
I 10
D 12
.Li AF _INET  ,
E 12
I 12
D 16
.Li AF_INET  ,
E 16
I 16
.Dv AF_INET  ,
E 16
E 12
.Ar ns ,
E 10
for
D 5
.BR AF_NS are
recognized.
E 5
I 5
D 6
.B AF_NS
are recognized.
E 6
I 6
D 10
.BR AF_NS ,
E 10
I 10
D 12
.Li AF _NS  ,
E 12
I 12
D 16
.Li AF_NS  ,
E 16
I 16
.Dv AF_NS  ,
I 25
.Ar iso ,
for
.Dv AF_ISO ,
E 25
E 16
E 12
E 10
and
D 10
.IR unix ,
E 10
I 10
.Ar unix  ,
E 10
for
D 10
.BR AF_UNIX .
E 6
E 5
E 4
.PP
The arguments, 
.I system
E 10
I 10
D 12
.Li AF _UNIX  .
E 12
I 12
D 16
.Li AF_UNIX  .
E 12
.Tp
E 16
I 16
.Dv AF_UNIX  .
E 26
I 22
.It Fl w Ar wait
Show network interface statistics at intervals of
.Ar wait
seconds.
E 22
.El
E 16
.Pp
D 15
The arguments,
.Ar system
E 10
and
D 10
.I core
allow substitutes for the defaults ``/vmunix'' and ``/dev/kmem''.
.PP
E 10
I 10
.Ar core
allow substitutes for the defaults
.Dq Pa vmunix
and
.Dq Pa /dev/kmem .
.Pp
E 15
E 10
D 6
If an 
.I interval
is specified,
.I netstat
will continuously display the information regarding packet
traffic on the configured network interfaces, pausing
.I interval
seconds before refreshing the screen.
.PP
There are a number of display formats, depending on the information
presented.  The default display, for active sockets, shows the local
E 6
I 6
The default display, for active sockets, shows the local
E 6
and remote addresses, send and receive queue sizes (in bytes), protocol,
D 6
and, optionally, the internal state of the protocol.
.PP
E 6
I 6
and the internal state of the protocol.
E 6
Address formats are of the form ``host.port'' or ``network.port''
if a socket's address specifies a network but no specific host address.
When known the host and network addresses are displayed symbolically
according to the data bases
D 10
.I /etc/hosts
E 10
I 10
.Pa /etc/hosts
E 10
and
D 10
.IR /etc/networks ,
E 10
I 10
.Pa /etc/networks ,
E 10
respectively.  If a symbolic name for an address is unknown, or if
D 10
the 
.B \-n
E 10
I 10
the
.Fl n
E 10
D 6
option is specified, the address is printed in the Internet ``dot format'';
E 6
I 6
option is specified, the address is printed numerically, according
to the address family.
D 10
For more information regarding 
E 10
I 10
For more information regarding
E 10
the Internet ``dot format,''
E 6
D 10
refer to 
D 6
.IR inet (3N)
for more information regarding this format.
E 6
I 6
.IR inet (3N).
E 10
I 10
refer to
.Xr inet 3 ) .
E 10
E 6
Unspecified,
D 10
or ``wildcard'', addresses and ports appear as ``*''.  
.PP
E 10
I 10
or ``wildcard'', addresses and ports appear as ``*''.
.Pp
E 10
The interface display provides a table of cumulative
statistics regarding packets transferred, errors, and collisions.
D 6
The network address (currently Internet specific) of the interface
E 6
I 6
The network addresses of the interface
E 6
and the maximum transmission unit (``mtu'') are also displayed.
D 10
.PP
E 10
I 10
.Pp
E 10
The routing table display indicates the available routes and
their status.  Each route consists of a destination host or network
and a gateway to use in forwarding packets.  The flags field shows
D 6
the state of the route (``U'' if ``up''), and whether the route
is to a gateway (``G'').  Direct routes are created for each
interface attached to the local host.  The refcnt field gives the
E 6
I 6
D 25
the state of the route (``U'' if ``up''), whether the route
D 8
is to a gateway (``G''), and whether the route was created dynamically
by a redirect (``D'').  Direct routes are created for each
E 8
I 8
is to a gateway (``G''), whether the route was created dynamically
by a redirect (``D''), and whether the route has been modified
by a redirect (``M'').  Direct routes are created for each
E 25
I 25
a collection of information about the route stored as
binary choices.  The individual flags are discussed in more
detail in the
.Xr route 8
and
.Xr route 4
manual pages.
The mapping between letters and flags is:
D 26
.Bd -literal
U   RTF_UP        Route useable 
G   RTF_GATEWAY   Destination requires forwarding by intermediary
H   RTF_HOST      Host entry (net otherwise) 
R   RTF_REJECT    Host or net unreachable 
D   RTF_DYNAMIC   Created dynamically (by redirect) 
M   RTF_MODIFIED  Modified dynamically (by redirect) 
C   RTF_CLONING   Generate new routes on use 
X   RTF_XRESOLVE  External daemon translates proto to link address
L   RTF_LLINFO    Valid protocol to link address translation.
S   RTF_STATIC    Manually added 
B   RTF_BLACKHOLE Just discard pkts (during updates) 
1   RTF_PROTO2    Protocol specific routing flag #1 
2   RTF_PROTO1    Protocol specific routing flag #2 
.Ed
E 26
I 26
.Bl -column XXXX RTF_BLACKHOLE
1	RTF_PROTO2	Protocol specific routing flag #1 
2	RTF_PROTO1	Protocol specific routing flag #2 
B	RTF_BLACKHOLE	Just discard pkts (during updates) 
C	RTF_CLONING	Generate new routes on use 
D	RTF_DYNAMIC	Created dynamically (by redirect) 
G	RTF_GATEWAY	Destination requires forwarding by intermediary
H	RTF_HOST	Host entry (net otherwise) 
L	RTF_LLINFO	Valid protocol to link address translation.
M	RTF_MODIFIED	Modified dynamically (by redirect) 
R	RTF_REJECT	Host or net unreachable 
S	RTF_STATIC	Manually added 
D 27
U	RTF_UP	Route useable 
E 27
I 27
U	RTF_UP	Route usable 
E 27
X	RTF_XRESOLVE	External daemon translates proto to link address
.El
E 26
.Pp
Direct routes are created for each
E 25
E 8
interface attached to the local host;
the gateway field for such entries shows the address of the outgoing interface.
The refcnt field gives the
E 6
current number of active uses of the route.  Connection oriented
protocols normally hold on to a single route for the duration of
D 6
a connection while connectionless protocols obtain a route then
discard it.  The use field provides a count of the number of packets
E 6
I 6
a connection while connectionless protocols obtain a route while sending
to the same destination.
The use field provides a count of the number of packets
E 6
sent using that route.  The interface entry indicates the network
interface utilized for the route.
D 10
.PP
When 
.I netstat
E 10
I 10
.Pp
When
.Nm netstat
E 10
D 15
is invoked with an
D 10
.I interval
E 10
I 10
.Ar interval
E 10
argument, it displays a running count of statistics related to
D 6
network interfaces.  This display consists of a column summarizing
information for all interfaces, and a column for the interface with
the most traffic since the system was last rebooted.  The first
line of each screen of information contains a summary since the
E 6
I 6
network interfaces.  This display consists of a
column for the primary interface
(the first interface found during autoconfiguration)
and a column summarizing
E 15
I 15
D 22
is invoked with a
E 22
I 22
is invoked with the
.Fl w
option and a
E 22
.Ar wait
interval argument, it displays a running count of statistics related to
network interfaces.
I 22
An obsolescent version of this option used a numeric parameter
with no option, and is currently supported for backward compatibility.
E 22
This display consists of a column for the primary interface (the first
interface found during autoconfiguration) and a column summarizing
E 15
information for all interfaces.
The primary interface may be replaced with another interface with the
D 10
.I \-I
E 10
I 10
.Fl I
E 10
option.
The first line of each screen of information contains a summary since the
E 6
system was last rebooted.  Subsequent lines of output show values
accumulated over the preceding interval.
D 10
.SH SEE ALSO
iostat(1),
vmstat(1),
hosts(5),
networks(5),
protocols(5),
services(5),
D 9
trpt(8C)
E 9
I 9
trpt(8)
E 9
.SH BUGS
E 10
I 10
.Sh SEE ALSO
.Xr iostat 1 ,
I 15
.Xr nfsstat 1 ,
.Xr ps 1 ,
E 15
.Xr vmstat 1 ,
.Xr hosts 5 ,
.Xr networks 5 ,
.Xr protocols 5 ,
.Xr services 5 ,
D 15
.Xr trpt 8
E 15
I 15
.Xr trpt 8 ,
.Xr trsp 8
E 15
.Sh HISTORY
D 16
.Nm Netstat
appeared in 4.2 BSD.
E 16
I 16
The
.Nm netstat
command appeared in
.Bx 4.2 .
E 16
I 15
.\" .Sh FILES
.\" .Bl -tag -width /dev/kmem -compact
.\" .It Pa /vmunix
.\" default kernel namelist
.\" .It Pa /dev/kmem
.\" default memory file
.\" .El
E 15
.Sh BUGS
E 10
D 15
The notion of errors is ill-defined.  Collisions mean
something else for the IMP.
E 15
I 15
The notion of errors is ill-defined.
D 22
.Pp
D 16
Collisions mean something else for the IMP.
E 16
I 16
Collisions mean something else for the
.Tn IMP .
E 22
E 16
E 15
I 3
D 6
.PP
The 
.B \-p 
option is not yet implemented.
E 6
E 3
E 1
