sbin/disklabel/SCCS/s.disklabel.8
h54166
s 00001/00001/00316
d D 8.2 94/04/19 08:25:45 bostic 12 11
c spell
e
s 00002/00002/00315
d D 8.1 93/06/05 10:50:47 bostic 11 10
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00178/00051/00139
d D 6.10 93/03/09 18:50:22 mckusick 10 9
c update for HP300 from Mike Hibler
e
s 00085/00087/00105
d D 6.9 92/07/12 13:05:51 cael 9 8
c mdoc version three
e
s 00001/00011/00191
d D 6.8 90/06/24 21:27:19 trent 8 7
c new copyright notice
e
s 00014/00008/00188
d D 6.7 88/07/09 11:31:53 bostic 7 6
c install approved copyright notice
e
s 00037/00013/00159
d D 6.6 88/06/13 17:59:28 karels 6 5
c update, describe write-protected label and kernel consistency checks
e
s 00017/00004/00154
d D 6.5 88/02/22 12:05:33 bostic 5 4
c change copyright to Berkeley specific; document N and W options
e
s 00028/00017/00130
d D 6.4 88/02/20 11:55:42 karels 4 3
c update to current prog
e
s 00001/00001/00146
d D 6.3 87/09/15 09:20:48 karels 3 2
c missing arg on -R
e
s 00015/00007/00132
d D 6.2 87/06/19 14:10:30 karels 2 1
c disklabel forces required "options"
e
s 00139/00000/00000
d D 6.1 87/06/18 21:15:33 karels 1 0
c from Symmetric, with update
e
u
U
t
T
I 1
D 7
.\" from Symmetric Computer Systems.
D 6
.\" Modifications Copyright (c) 1987 Regents of the University of California.
E 6
I 6
.\" Modifications Copyright (c) 1987,1988
.\" The Regents of the University of California.
E 7
I 7
D 9
.\" Copyright (c) 1987, 1988 Regents of the University of California.
E 9
I 9
D 11
.\" Copyright (c) 1987, 1988, 1991 Regents of the University of California.
E 9
E 7
E 6
D 5
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 5
I 5
.\" All rights reserved.
E 11
I 11
.\" Copyright (c) 1987, 1988, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 11
E 5
.\"
I 7
.\" This code is derived from software contributed to Berkeley by
.\" Symmetric Computer Systems.
.\"
E 7
I 5
D 8
.\" Redistribution and use in source and binary forms are permitted
D 7
.\" provided that this notice is preserved and that due credit is given
.\" to the University of California at Berkeley. The name of the University
.\" may not be used to endorse or promote products derived from this
.\" software without specific prior written permission. This software
.\" is provided ``as is'' without express or implied warranty.
E 7
I 7
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 8
I 8
D 9
.\" %sccs.include.redist.man%
E 9
I 9
.\" %sccs.include.redist.roff%
E 9
E 8
E 7
.\"
E 5
.\"	%W% (Berkeley) %G%
.\"
D 9
.TH DISKLABEL 8 "%Q%"
.UC 5
.SH NAME
disklabel \- read and write disk pack label
.SH SYNOPSIS
.B disklabel
[
.B \-r
]
.I disk
.br
.B disklabel \-w
[
.B \-r
]
.I disk
.I disktype
[
.I packid
[
.I priboot secboot
] ]
.br
.B disklabel \-e
[
.B \-r
]
.I disk
.br
.B disklabel \-R
[
.B \-r
]
D 3
.I disk
E 3
I 3
.I disk protofile
E 3
[
.I priboot secboot
]
I 5
.br
.B disklabel
[
.B \-NW
]
.I disk
E 5
.SH DESCRIPTION
.I Disklabel
E 9
I 9
D 10
.Dd %Q%
E 10
I 10
.Dd "%Q%"
E 10
.Dt DISKLABEL 8
.Os BSD 4.2
.Sh NAME
.Nm disklabel
.Nd read and write disk pack label
.Sh SYNOPSIS
.Nm disklabel
.Op Fl r
.Ar disk
.Nm disklabel
.Fl w
.Op Fl r
.Ar disk Ar disktype
D 10
.Oo Ar packid
.Oo Ar priboot Ar secboot Oc
.Oc
E 10
I 10
.Oo Ar packid Oc
E 10
.Nm disklabel
.Fl e
.Op Fl r
.Ar disk
.Nm disklabel
.Fl R
.Op Fl r
.Ar disk Ar protofile
D 10
.Op Ar priboot Ar secboot
E 10
.Nm disklabel
.Op Fl NW
.Ar disk
I 10
.sp
.Nm disklabel
.Fl B
.Oo
.Fl b Ar boot1
.Op Fl s Ar boot2
.Oc
.Ar disk
.Oo Ar disktype Oc
.Nm disklabel
.Fl w
.Fl B
.Oo
.Fl b Ar boot1
.Op Fl s Ar boot2
.Oc
.Ar disk Ar disktype
.Oo Ar packid Oc
.Nm disklabel
.Fl R
.Fl B
.Oo
.Fl b Ar boot1
.Op Fl s Ar boot2
.Oc
.Ar disk Ar protofile
.Oo Ar disktype Oc
E 10
.Sh DESCRIPTION
.Nm Disklabel
E 9
can be used to install, examine or modify the label on a disk drive or pack.
When writing the label, it can be used
to change the drive identification,
the disk partitions on the drive,
D 10
or to replace a damaged label or bootstrap.
D 2
The disk label and bootstrap are located on block 0 of each disk.
E 2
I 2
The disk label is located on one of the first sectors
of each disk (usually block 0).
D 9
On machines that require a block-0 bootstrap (VAX 11/750),
E 9
I 9
On machines that require a block-0 bootstrap
.Pf ( Tn VAX
11/750),
E 9
the label is inserted into the bootstrap program.
E 2
This information is used by the system disk driver and by the bootstrap
program to determine how to program the drive.
I 2
There are several forms of the command that display, install or modify
E 10
I 10
or to replace a damaged label.
On some systems,
.Nm disklabel
can be used to install bootstrap code as well.
There are several forms of the command that read (display), install or edit
E 10
the label on a disk.
Each form has an additional option,
D 9
.BR \-r ,
E 9
I 9
.Fl r ,
E 9
which causes the label to be read from or written to the disk directly,
rather than going through the system's in-core copy of the label.
D 10
When writing, the in-core copy is also updated if possible.
E 10
I 4
This option may allow a label to be installed on a disk
without kernel support for a label, such as when labels are first installed
D 6
on a system.
E 6
I 6
on a system; it must be used when first installing a label on a disk.
I 10
The specific effect of
.Fl r
is described under each command.
The read and install forms also support the
.Fl B
option to install bootstrap code.
D 12
These varients are described later.
E 12
I 12
These variants are described later.
E 12
E 10
E 6
E 4
E 2
D 9
.PP
E 9
I 9
.Pp
E 9
D 10
The first form of the command is used to examine the label on the named
disk drive (e.g. hp0 or /dev/rhp0c).
E 10
I 10
The first form of the command (read) is used to examine the label on the named
disk drive (e.g. sd0 or /dev/rsd0c).
E 10
It will display all of the parameters associated with the drive
and its partition layout.
D 6
The kernel's in-core label is displayed;
E 6
I 6
Unless the
D 9
.B \-r
E 9
I 9
.Fl r
E 9
flag is given,
the kernel's in-core copy of the label is displayed;
E 6
if the disk has no label, or the partition types on the disk are incorrect,
D 4
the kernel may have modified the label.
E 4
I 4
the kernel may have constructed or modified the label.
E 4
If the
D 9
.B \-r
E 9
I 9
.Fl r
E 9
flag is given, the label from the raw disk will be displayed rather
than the in-core label.
D 9
.PP
E 9
I 9
.Pp
E 9
The second form of the command, with the
D 9
.B \-w
E 9
I 9
.Fl w
E 9
flag, is used to write a standard label on the designated drive.
The required arguments to
D 9
.I disklabel
E 9
I 9
.Nm disklabel
E 9
D 10
are the drive to be labelled (e.g. hp0), and
E 10
I 10
are the drive to be labelled (e.g. sd0), and
E 10
the drive type as described in the
D 9
.IR disktab (5)
E 9
I 9
.Xr disktab 5
E 9
file.
The drive parameters and partitions are taken from that file.
If different disks of the same physical type are to have different
partitions, it will be necessary to have separate disktab entries
D 6
describing each or to edit the label as described below.
The first optional argument is a pack identification, up to 16 characters.
E 6
I 6
describing each, or to edit the label after installation as described below.
D 10
The first optional argument is a pack identification string,
E 10
I 10
The optional argument is a pack identification string,
E 10
up to 16 characters long.
E 6
The pack id must be quoted if it contains blanks.
If the
D 9
.B \-r
E 9
I 9
.Fl r
E 9
flag is given, the disk sectors containing the label and bootstrap
D 10
will be written directly,
D 4
otherwise only the label will be modified.
In either case, the kernel's in-core label is replaced.
D 2
On machines that require a block-0 bootstrap (VAX 11/750),
E 2
I 2
On machines that require a block-0 bootstrap,
E 2
the
E 4
I 4
D 6
otherwise the existing label will be modified in place without modifying
E 6
I 6
otherwise the existing label will be updated in place without modifying
E 6
the bootstrap.
E 10
I 10
will be written directly.
A side-effect of this is that any existing bootstrap code will be overwritten
and the disk rendered unbootable.
If
.Fl r
is not specified,
the existing label will be updated via the in-core copy and any bootstrap
code will be unaffected.
E 10
If the disk does not already have a label, the
E 4
D 9
.B \-r
E 9
I 9
.Fl r
E 9
D 2
flag \fImust\fP be used when installing a label on a disk for the first time
to install the version of the bootstrap that understands disk labels.
E 2
I 2
D 4
flag is assumed with
.BR \-w .
E 2
An alternate version of the bootstrap may be specified
E 4
I 4
flag must be used.
In either case, the kernel's in-core label is replaced.
D 9
.PP
E 9
I 9
.Pp
E 9
D 10
Alternate versions of the bootstrap files may be specified
E 4
after the pack identifier.
If an alternate bootstrap is not specified, the standard bootstrap will be used.
The bootstrap programs are located in
D 4
.IR /usr/mdec ,
with names of the form
E 4
I 4
D 9
.IR /usr/mdec .
E 9
I 9
.Pa /usr/mdec .
E 9
The names of the bootstrap programs may be specified in
D 9
.IR disktab (5);
E 9
I 9
.Xr disktab 5 ;
E 9
D 6
if not specified
with default names of the form
E 4
.IR disktype boot
E 6
I 6
if not specified,
the default names are of the form
D 9
.IR basename boot
E 9
I 9
.Pa basename Ns boot
E 9
E 6
for the primary (block 0) bootstrap, and
D 6
.RI boot disktype
E 6
I 6
D 9
.RI boot basename
E 9
I 9
.No boot Pa basename
E 9
E 6
for the secondary (block 1-15) bootstrap;
D 6
for example, /usr/mdec/hpboot and /usr/mdec/boothp.
E 6
I 6
D 9
for example, /usr/mdec/hpboot and /usr/mdec/boothp
E 9
I 9
for example,
.Pa /usr/mdec/hpboot
and
.Pa /usr/mdec/boothp
E 9
if the disk device is
D 9
.BR hp0 .
E 6
.PP
E 9
I 9
.Em hp0 .
.Pp
E 10
E 9
An existing disk label may be edited by using the
D 9
.B \-e
E 9
I 9
.Fl e
E 9
flag.
The label is read from the in-core kernel copy,
or directly from the disk if the
D 9
.B \-r
E 9
I 9
.Fl r
E 9
flag is also given.
The label is formatted and then supplied to an editor for changes.
D 9
If no editor is specified in an EDITOR environment variable,
.IR vi (1)
E 9
I 9
If no editor is specified in an
.Ev EDITOR
environment variable,
.Xr vi 1
E 9
is used.
When the editor terminates, the formatted label is reread
and used to rewrite the disk label.
I 10
Existing bootstrap code is unchanged regardless of whether
.Fl r
was specified.
E 10
D 2
A bootstrap is also installed if using the
.B \-r
option.
E 2
D 9
.PP
E 9
I 9
.Pp
E 9
D 5
Finally,
I 4
with the 
E 5
I 5
With the
E 5
D 9
.B \-R
E 9
I 9
.Fl R
E 9
flag,
E 4
D 9
.I disklabel
E 9
I 9
.Nm disklabel
E 9
is capable of restoring a disk label that was formatted
D 4
in a prior operation and saved in an ascii file by the use
of the 
.B \-R
flag.
The prototype file used to create the label is exactly that
produced when reading or editing a label.
I 2
A block-0 bootstrap is also installed on machines that use one.
E 4
I 4
in a prior operation and saved in an ascii file.
D 6
The prototype file used to create the label is in exactly the same format
that is produced when reading or editing a label.
E 6
I 6
The prototype file used to create the label should be in the same format
as that produced when reading or editing a label.
Comments are delimited by
D 9
.B #
E 9
I 9
.Ar \&#
E 9
and newline.
E 6
D 10
If the
E 10
I 10
As with
.Fl w ,
any existing bootstrap code will be clobbered if
E 10
D 9
.B \-r
E 9
I 9
.Fl r
E 9
D 10
option is also given,
a block-0 bootstrap is installed on machines that use one;
either the disktype or the names of the bootstrap files must be specified
on such machines.
E 10
I 10
is specified and will be unaffected otherwise.
E 10
I 5
D 9
.PP
Finally, the \fB-NW\fP flags for \fIdisklabel\fP explicitly disallow and
E 9
I 9
.Pp
D 10
Finally, the
E 10
I 10
The
E 10
.Fl NW
flags for
.Nm disklabel
explicitly disallow and
E 9
allow, respectively, writing of the pack label area on the selected disk.
I 10
.Pp
The final three forms of
.Nm disklabel
are used to install boostrap code on machines where the bootstrap is part
of the label.
The bootstrap code is comprised of one or two boot programs depending on
the machine.
The
.Fl B
option is used to denote that bootstrap code is to be installed.
The
.Fl r
flag is implied by
.Fl B
and never needs to be specified.
The name of the boot program(s) to be installed can be selected in a
variety of ways.
First, the names can be specified explicitly via the
.Fl b
and
.Fl s
flags.
On machines with only a single level of boot program,
.Fl b
is the name of that program.
For machines with a two-level bootstrap,
.Fl b
indicates the primary boot program and
.Fl s
the secondary boot program.
If the names are not explicitly given, standard boot programs will be used.
The boot programs are located in
.Pa /usr/mdec .
The names of the programs are taken from the ``b0'' and ``b1'' parameters
of the
.Xr disktab 5
entry for the disk if
.Ar disktype
was given and its disktab entry exists and includes those parameters.
Otherwise, boot program names are derived from the name of the disk.
These names are of the form
.Pa basename Ns boot
for the primary (or only) bootstrap, and
.Pf boot Pa basename
for the secondary bootstrap;
for example,
.Pa /usr/mdec/sdboot
and
.Pa /usr/mdec/bootsd
if the disk device is
.Em sd0 .
.Pp
The first of the three boot-installation forms is used to install
bootstrap code without changing the existing label.
It is essentially a read command with respect to the disk label
itself and all options are related to the specification of the boot
program as described previously.
The final two forms are analogous to the basic write and restore versions
except that they will install bootstrap code in addition to a new label.
E 10
E 5
E 4
E 2
D 9
.SH FILES
/etc/disktab
.br
/usr/mdec/\fIxx\fPboot
.br
/usr/mdec/boot\fIxx\fP
.SH "SEE ALSO"
disktab(5), disklabel(5)
I 6
.SH DIAGNOSTICS
E 9
I 9
.Sh FILES
.Bl -tag -width Pa -compact
.It Pa /etc/disktab
.It Pa /usr/mdec/ Ns Em xx Ns boot
.It Pa /usr/mdec/boot Ns Em xx
.El
I 10
.Sh EXAMPLES
.Dl disklabel sd0
.Pp
Display the in-core label for sd0 as obtained via
.Pa /dev/rsd0c .
.Pp
.Dl disklabel -w -r /dev/rsd0c sd2212 foo
.Pp
Create a label for sd0 based on information for ``sd2212'' found in
.Pa /etc/disktab .
Any existing bootstrap code will be clobbered.
.Pp
.Dl disklabel -e -r sd0
.Pp
Read the on-disk label for sd0, edit it and reinstall in-core as well
as on-disk.
Existing bootstrap code is unaffected.
.Pp
.Dl disklabel -R sd0 mylabel
.Pp
Restore the on-disk and in-core label for sd0 from information in
.Pa mylabel .
Existing bootstrap code is unaffected.
.Pp
.Dl disklabel -B sd0
.Pp
Install a new bootstrap on sd0.
The boot code comes from
.Pa /usr/mdec/sdboot
and possibly
.Pa /usr/mdec/bootsd .
On-disk and in-core labels are unchanged.
.Pp
.Dl disklabel -w -B /dev/rsd0c -b newboot sd2212
.Pp
Install a new label and bootstrap.
The label is derived from disktab information for ``sd2212'' and
installed both in-core and on-disk.
The bootstrap code comes from the file
.Pa /usr/mdec/newboot .
E 10
.Sh SEE ALSO
.Xr disktab 5 ,
.Xr disklabel 5
.Sh DIAGNOSTICS
E 9
The kernel device drivers will not allow the size of a disk partition
to be decreased or the offset of a partition to be changed while it is open.
Some device drivers create a label containing only a single large partition
if a disk is unlabeled; thus, the label must be written to the ``a''
partition of the disk while it is open.
This sometimes requires the desired label to be set in two steps,
the first one creating at least one other partition,
and the second setting the label on the new partition
while shrinking the ``a'' partition.
I 10
.Pp
On some machines the bootstrap code may not fit entirely in the area
allocated for it by some filesystems.
As a result, it may not be possible to have filesystems on some partitions
of a ``bootable'' disk.
When installing bootstrap code,
.Nm disklabel
checks for these cases.
If the installed boot code would overlap a partition of type FS_UNUSED
it is marked as type FS_BOOT.
The
.Xr newfs 8
utility will disallow creation of filesystems on FS_BOOT partitions.
Conversely, if a partition has a type other than FS_UNUSED or FS_BOOT,
.Nm disklabel
will not install bootstrap code that overlaps it.
E 10
D 9
.SH BUGS
E 9
I 9
.Sh BUGS
E 9
When a disk name is given without a full pathname,
D 10
the constructed device name uses the ``c'' partition on the vax
and the ``a'' partition on the tahoe.
E 10
I 10
the constructed device name uses the ``a'' partition on the tahoe,
the ``c'' partition on all others.
E 10
E 6
E 1
