usr.sbin/ac/SCCS/s.ac.8
h53291
s 00001/00001/00080
d D 8.2 94/04/19 08:20:20 bostic 7 6
c spell
e
s 00002/00002/00079
d D 8.1 93/06/06 11:36:29 bostic 6 5
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00078/00062/00003
d D 6.3 91/03/16 18:11:23 cael 5 4
c macro and text revision (-mdoc version 3)
e
s 00004/00004/00061
d D 6.2 90/06/24 22:10:30 trent 4 3
c new pathnames (ac & wtmp)
e
s 00000/00000/00065
d D 6.1 85/04/27 12:33:07 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00000/00000/00065
d D 5.1 85/04/27 12:32:41 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00065/00000/00000
d D 4.1 85/04/27 12:30:33 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
D 5
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 5
I 5
D 6
.\" Copyright (c) 1980, 1991 Regents of the University of California.
.\" All rights reserved.
E 6
I 6
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 6
E 5
.\"
D 5
.\"	%W% (Berkeley) %G%
E 5
I 5
.\" %sccs.include.redist.man%
E 5
.\"
D 5
.TH AC 8 "%Q%"
.UC 4
.SH NAME
ac \- login accounting
.SH SYNOPSIS
D 4
.B /etc/ac
E 4
I 4
.B ac
E 4
[
.B \-w
wtmp ] [
.B \-p
] [
.B \-d
] [ people ] ...
.SH DESCRIPTION
.I Ac
produces a printout giving
connect time
for each user who has logged in
during the life of the current
.I wtmp
file.
A total is also produced.
.B \-w
is used to specify an alternate
.IR wtmp ""
file.
.B \-p
prints individual totals; without this option,
only totals are printed.
.B \-d
causes a printout for each midnight to midnight
period.
Any
.I people
will limit the
printout to only the specified login names.
If no
.IR wtmp ""
file is given,
D 4
.I /usr/adm/wtmp
E 4
I 4
.I /var/log/wtmp
E 4
is used.
.PP
The accounting file
D 4
.I /usr/adm/wtmp
E 4
I 4
.I /var/log/wtmp
E 4
is maintained by
.I init
E 5
I 5
.\"     %W% (Berkeley) %G%
.\"
.Dd %Q%
.Dt AC 8
.Os BSD 4
.Sh NAME
.Nm ac
.Nd display connect time accounting
.Sh SYNOPSIS
.Nm ac
.Op Fl d
.Op Fl p
.Op Fl w Ar file
.Op Ar users ...
.Sh DESCRIPTION
If the file
.Pa /var/log/wtmp
exists,
a record of individual
login and logout times are written to it by
.Xr init 8
E 5
and
D 5
.I login.
Neither of these programs creates the file,
so if it does not exist
no connect-time accounting is done.
To start accounting, it should be created with length 0.
On the other hand if the file is left undisturbed it will
grow without bound, so periodically any information
desired should be collected and the file truncated.
.SH FILES
D 4
/usr/adm/wtmp
E 4
I 4
/var/log/wtmp
E 4
.SH "SEE ALSO"
init(8), sa(8), login(1), utmp(5).
E 5
I 5
.Xr login 8
respectively.
The program
.Nm ac
examines these
records and writes the accumulated connect time for all logins to the
standard output.
.Pp
Options available:
.Bl -tag -width people
.It Fl d
Display the connect times in 24 hour chunks.
.It Fl p
Display individual user totals.
.It Fl w Ar file
Read raw connect time data from
.Ar file
instead of the default file
.Pa /var/log/wtmp .
.It Ar users ...
D 7
Display totals for the given indiviuals
E 7
I 7
Display totals for the given individuals
E 7
only.
.El
.Pp
If no arguments are given,
.Nm
displays the total amount of login time for all active accounts on the
system.
.Pp
The default
.Pa wtmp
file is an infinitely increasing file
unless frequently truncated.  This is normally
done by the daily daemon scripts scheduled by
.Xr cron 8
which rename and rotate the
.Pa wtmp
files before truncating them (and keeping about a weeks worth on hand).
No login times are collected however, if the file does not exist.
.Sh FILES
.Bl -tag -width /var/log/wtmp.[0-7] -compact
.It Pa /var/log/wtmp
.It Pa /var/log/wtmp.[0-7]
rotated files
.El
.Sh SEE ALSO
.Xr init 8 ,
.Xr sa 8 ,
.Xr login 1 ,
.Xr utmp 5 .
.Sh HISTORY
A
.Nm
command appeared in Version 6 AT&T UNIX.
E 5
E 1
