share/man/man4/SCCS/s.drum.4
h18901
s 00002/00002/00031
d D 8.1 93/06/05 13:44:27 bostic 5 4
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00023/00014/00010
d D 6.2 91/03/28 00:45:55 cael 4 3
c macro and text revision (-mdoc version 3)
e
s 00001/00001/00023
d D 6.1 85/05/15 17:19:29 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00001/00001/00023
d D 5.1 85/05/15 17:19:22 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00024/00000/00000
d D 4.1 85/05/15 17:19:15 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
D 4
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 4
I 4
D 5
.\" Copyright (c) 1980, 1991 Regents of the University of California.
.\" All rights reserved.
E 5
I 5
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 5
E 4
.\"
D 4
.\"	%W% (Berkeley) %G%
E 4
I 4
.\" %sccs.include.redist.man%
E 4
.\"
D 2
.TH DRUM 4 5/11/81
E 2
I 2
D 3
.TH DRUM 4 "10 May 1981"
E 3
I 3
D 4
.TH DRUM 4 "%Q%"
E 3
E 2
.UC 4
.SH NAME
drum \- paging device
.SH DESCRIPTION
E 4
I 4
.\"     %W% (Berkeley) %G%
.\"
.Dd %Q%
.Dt DRUM 4
.Os BSD 4
.Sh NAME
.Nm drum
.Nd paging device
.Sh DESCRIPTION
E 4
This file refers to the paging device in use by the system.
This may actually be a subdevice of one of the disk drivers, but in
a system with paging interleaved across multiple disk drives
it provides an indirect driver for the multiple drives.
D 4
.SH FILES
/dev/drum
.SH BUGS
E 4
I 4
.Sh FILES
.Bl -tag -width /dev/drum
.It Pa /dev/drum
.El
.Sh HISTORY
The
.Nm
special file appeared in
.Bx 3.0 .
.Sh BUGS
E 4
Reads from the drum are not allowed across the interleaving boundaries.
D 4
Since these only occur every
.BR . 5Mbytes
E 4
I 4
Since these only occur every .5Mbytes
E 4
or so,
and since the system never allocates blocks across the boundary,
this is usually not a problem.
E 1
