share/man/man4/SCCS/s.icmp.4
h38295
s 00002/00002/00089
d D 8.1 93/06/05 13:45:01 bostic 7 6
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00061/00041/00030
d D 6.6 91/03/28 00:45:58 cael 6 5
c macro and text revision (-mdoc version 3)
e
s 00001/00011/00070
d D 6.5 90/06/23 18:04:57 trent 5 4
c new copyright notice
e
s 00003/00003/00078
d D 6.4 89/02/14 17:18:17 bostic 4 3
c add Berkeley specific copyright notice, remove subsection notation
e
s 00010/00005/00071
d D 6.3 88/07/09 11:38:35 bostic 3 2
c install approved copyright notice
e
s 00008/00002/00068
d D 6.2 87/12/23 14:39:58 bostic 2 1
c add Berkeley header; NASA wants a copy
e
s 00070/00000/00000
d D 6.1 86/05/16 15:53:50 karels 1 0
c first version, for 4.3
e
u
U
t
T
I 1
D 6
.\" Copyright (c) 1986 Regents of the University of California.
E 6
I 6
D 7
.\" Copyright (c) 1986, 1991 Regents of the University of California.
E 6
D 2
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 2
I 2
.\" All rights reserved.
E 7
I 7
.\" Copyright (c) 1986, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 7
.\"
D 5
.\" Redistribution and use in source and binary forms are permitted
D 3
.\" provided that this notice is preserved and that due credit is given
.\" to the University of California at Berkeley. The name of the University
.\" may not be used to endorse or promote products derived from this
.\" software without specific prior written permission. This software
.\" is provided ``as is'' without express or implied warranty.
E 3
I 3
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 5
I 5
.\" %sccs.include.redist.man%
E 5
E 3
E 2
.\"
D 6
.\"	%W% (Berkeley) %G%
E 6
I 6
.\"     %W% (Berkeley) %G%
E 6
.\"
D 4
.TH ICMP 4P "%Q%"
E 4
I 4
D 6
.TH ICMP 4 "%Q%"
E 4
.UC 6
.SH NAME
icmp \- Internet Control Message Protocol
.SH SYNOPSIS
.B #include <sys/socket.h>
.br
.B #include <netinet/in.h>
.PP
.B s = socket(AF_INET, SOCK_RAW, proto);
.SH DESCRIPTION
ICMP is the error and control message protocol used
by IP and the Internet protocol family.  It may be accessed
through a \*(lqraw socket\*(rq for network monitoring
E 6
I 6
.Dd %Q%
.Dt ICMP 4
.Os BSD 4.3
.Sh NAME
.Nm icmp
.Nd Internet Control Message Protocol
.Sh SYNOPSIS
.Fd #include <sys/socket.h>
.Fd #include <netinet/in.h>
.Ft int
.Fn socket AF_INET SOCK_RAW proto
.Sh DESCRIPTION
.Tn ICMP
is the error and control message protocol used
by
.Tn IP
and the Internet protocol family.  It may be accessed
through a
.Dq raw socket
for network monitoring
E 6
and diagnostic functions.
The
D 6
.I proto
parameter to the socket call to create an ICMP socket
E 6
I 6
.Fa proto
parameter to the socket call to create an
.Tn ICMP
socket
E 6
is obtained from
D 4
.IR getprotobyname (3N).
E 4
I 4
D 6
.IR getprotobyname (3).
E 4
ICMP sockets are connectionless,
E 6
I 6
.Xr getprotobyname 3 .
.Tn ICMP
sockets are connectionless,
E 6
and are normally used with the
D 6
.I sendto 
E 6
I 6
.Xr sendto
E 6
and
D 6
.I recvfrom 
E 6
I 6
.Xr recvfrom
E 6
calls, though the
D 6
.IR connect (2)
E 6
I 6
.Xr connect 2
E 6
call may also be used to fix the destination for future
packets (in which case the 
D 6
.IR read (2)
E 6
I 6
.Xr read 2
E 6
or
D 6
.IR recv (2)
E 6
I 6
.Xr recv 2
E 6
and 
D 6
.IR write (2)
E 6
I 6
.Xr write 2
E 6
or
D 6
.IR send (2)
E 6
I 6
.Xr send 2
E 6
system calls may be used).
D 6
.PP
Outgoing packets automatically have an IP header prepended to
E 6
I 6
.Pp
Outgoing packets automatically have an
.Tn IP
header prepended to
E 6
them (based on the destination address).
D 6
Incoming packets are received with the IP header and options intact.
.SH DIAGNOSTICS
E 6
I 6
Incoming packets are received with the
.Tn IP
header and options intact.
.Sh DIAGNOSTICS
E 6
A socket operation may fail with one of the following errors returned:
D 6
.TP 15
[EISCONN]
E 6
I 6
.Bl -tag -width [EADDRNOTAVAIL]
.It Bq Er EISCONN
E 6
when trying to establish a connection on a socket which
already has one, or when trying to send a datagram with the destination
address specified and the socket is already connected;
D 6
.TP 15
[ENOTCONN]
E 6
I 6
.It Bq Er ENOTCONN
E 6
when trying to send a datagram, but
no destination address is specified, and the socket hasn't been
connected;
D 6
.TP 15
[ENOBUFS]
E 6
I 6
.It Bq Er ENOBUFS
E 6
when the system runs out of memory for
an internal data structure;
D 6
.TP 15
[EADDRNOTAVAIL]
E 6
I 6
.It Bq Er EADDRNOTAVAIL
E 6
when an attempt is made to create a 
socket with a network address for which no network interface
exists.
D 6
.SH SEE ALSO
D 4
send(2), recv(2), intro(4N), inet(4F), ip(4P)
E 4
I 4
send(2), recv(2), intro(4), inet(4), ip(4)
E 6
I 6
.El
.Sh SEE ALSO
.Xr send 2 ,
.Xr recv 2 ,
.Xr intro 4 ,
.Xr inet 4 ,
.Xr ip 4
.Sh HISTORY
The
.Nm
protocol appeared in
.Bx 4.3 .
E 6
E 4
E 1
