share/man/man4/SCCS/S.imp.4
h09484
s 00002/00002/00081
d D 8.1 93/06/05 13:45:21 bostic 7 6
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00044/00036/00039
d D 6.5 91/03/28 00:46:00 cael 6 5
c macro and text revision (-mdoc version 3)
e
s 00001/00011/00074
d D 6.4 90/06/23 18:04:48 trent 5 4
c new copyright notice
e
s 00016/00005/00069
d D 6.3 89/02/14 17:18:21 bostic 4 3
c add Berkeley specific copyright notice, remove subsection notation
e
s 00017/00003/00057
d D 6.2 86/05/16 15:54:33 karels 3 2
c corrections, different protos
e
s 00001/00001/00059
d D 6.1 85/05/15 17:44:02 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00060/00000/00000
d D 5.1 85/05/15 17:43:56 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
D 4
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 4
I 4
D 6
.\" Copyright (c) 1983 The Regents of the University of California.
E 6
I 6
D 7
.\" Copyright (c) 1983, 1991 The Regents of the University of California.
E 6
.\" All rights reserved.
E 7
I 7
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 7
E 4
.\"
I 4
D 5
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 5
I 5
.\" %sccs.include.redist.man%
E 5
.\"
E 4
D 6
.\"	%W% (Berkeley) %G%
E 6
I 6
.\"     %W% (Berkeley) %G%
E 6
.\"
D 2
.TH IMP 4P "26 March 1982"
E 2
I 2
D 4
.TH IMP 4P "%Q%"
E 4
I 4
D 6
.TH IMP 4 "%Q%"
E 4
E 2
.UC 5
.SH NAME
imp \- IMP raw socket interface
.SH SYNOPSIS
.B #include <sys/socket.h>
.br
.B #include <netinet/in.h>
.br
.B #include <netimp/if_imp.h>
.PP
D 3
.B s = socket(AF_IMPLINK, SOCK_RAW, IMPLINK_IP);
E 3
I 3
.B s = socket(AF_IMPLINK, SOCK_RAW, proto);
E 3
.SH DESCRIPTION
E 6
I 6
.Dd %Q%
.Dt IMP 4
.Os BSD 4.2
.Sh NAME
.Nm imp
.Nd
.Tn IMP
raw socket interface
.Sh SYNOPSIS
.Fd #include <sys/socket.h>
.Fd #include <netinet/in.h>
.Fd #include <netimp/if_imp.h>
.Ft int
.Fn socket AF_IMPLINK SOCK_RAW proto
.Sh DESCRIPTION
E 6
The raw imp socket provides direct access to the
D 6
.IR imp (4)
E 6
I 6
.Nm imp
E 6
network interface.  Users send packets through
the interface using the 
D 6
.IR send (2)
E 6
I 6
.Xr send 2
E 6
calls, and receive packets with the
D 6
.IR recv (2),
E 6
I 6
.Xr recv 2 ,
E 6
D 3
calls.  All outgoing packets must have space for an 1822 96-bit
E 3
I 3
calls.  All outgoing packets must have an 1822 96-bit
E 3
leader on the front.  Likewise, packets received
by the user will have this leader on the front.  The
1822 leader and the legal values for the various fields
are defined in the include file
D 6
.RI < netimp/if_imp.h >.
E 6
I 6
.Aq Pa netimp/if_imp.h .
E 6
D 3
.PP
E 3
The raw imp interface automatically installs the length
and destination address in the 1822 leader of all
outgoing packets; these need not be filled in by the user.
I 3
D 6
.PP
E 6
I 6
.Pp
E 6
If the protocol selected,
D 6
.IR proto ,
E 6
I 6
.Fa proto ,
E 6
is zero,
the socket will receive
D 6
all IMP messages except RFNM and incompletes
E 6
I 6
all
.Tn IMP
messages except RFNM and incompletes
E 6
which are not input data for a kernel protocol.
If
D 6
.I proto
E 6
I 6
.Fa proto
E 6
is non-zero,
only messages for the specified link type will be received.
E 3
D 6
.SH DIAGNOSTICS
E 6
I 6
.Sh DIAGNOSTICS
E 6
An operation on a socket may fail with one of the following
errors:
D 6
.TP 15
[EISCONN]
E 6
I 6
.Bl -tag -width [EADDRNOTAVAIL]
.It Bq Er EISCONN
E 6
when trying to establish a connection on a socket which
already has one, or when trying to send a datagram with the destination
address specified and the socket is already connected;
D 6
.TP 15
[ENOTCONN]
E 6
I 6
.It Bq Er ENOTCONN
E 6
when trying to send a datagram, but
no destination address is specified, and the socket hasn't been
connected;
D 6
.TP 15
[ENOBUFS]
E 6
I 6
.It Bq Er ENOBUFS
E 6
when the system runs out of memory for
an internal data structure;
I 3
D 6
.TP 15
[ENOBUFS]
E 6
I 6
.It Bq Er ENOBUFS
E 6
eight messages to the destination host are outstanding,
and another eight are already queued for output;
E 3
D 6
.TP 15
[EADDRNOTAVAIL]
E 6
I 6
.It Bq Er EADDRNOTAVAIL
E 6
when an attempt is made to create a 
socket with a network address for which no network interface
exists.
D 6
.SH SEE ALSO
D 4
intro(4N), inet(4F), imp(4)
E 4
I 4
intro(4), inet(4), imp(4)
E 6
I 6
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr inet 4 ,
.Xr imp 4
.Sh HISTORY
The
.Nm
driver appeared in
.Bx 4.2 .
E 6
E 4
E 1
