share/man/man4/SCCS/s.inet.4
h11083
s 00002/00002/00154
d D 8.1 93/06/05 13:45:29 bostic 9 8
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00000/00001/00156
d D 6.7 93/05/11 22:59:32 andrew 8 7
c delete DARPA
e
s 00107/00066/00050
d D 6.6 91/03/28 00:46:01 cael 7 6
c macro and text revision (-mdoc version 3)
e
s 00001/00011/00115
d D 6.5 90/06/23 18:04:44 trent 6 5
c new copyright notice
e
s 00017/00006/00109
d D 6.4 89/02/14 17:18:23 bostic 5 4
c add Berkeley specific copyright notice, remove subsection notation
e
s 00004/00000/00111
d D 6.3 86/06/01 00:45:52 mis 4 3
c added reference to tutorials.
e
s 00042/00003/00069
d D 6.2 86/05/16 15:54:42 karels 3 2
c subnets, netmask
e
s 00001/00001/00071
d D 6.1 85/05/15 17:44:16 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00072/00000/00000
d D 5.1 85/05/15 17:44:10 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
D 5
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 5
I 5
D 7
.\" Copyright (c) 1983 The Regents of the University of California.
E 7
I 7
D 9
.\" Copyright (c) 1983, 1991 The Regents of the University of California.
E 7
.\" All rights reserved.
E 9
I 9
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 9
E 5
.\"
I 5
D 6
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 6
I 6
.\" %sccs.include.redist.man%
E 6
.\"
E 5
D 7
.\"	%W% (Berkeley) %G%
E 7
I 7
.\"     %W% (Berkeley) %G%
E 7
.\"
D 2
.TH INET 4F "19 March 1982"
E 2
I 2
D 5
.TH INET 4F "%Q%"
E 5
I 5
D 7
.TH INET 4 "%Q%"
E 5
E 2
.UC 5
.SH NAME
inet \- Internet protocol family
.SH SYNOPSIS
.B #include <sys/types.h>
.br
.B #include <netinet/in.h>
.SH DESCRIPTION
.de _d
.if t .ta .6i 2.1i 2.6i
.\" 2.94 went to 2.6, 3.64 to 3.30
.if n .ta .84i 2.6i 3.30i
..
.de _f
.if t .ta .5i 1.25i 2.5i
.\" 3.5i went to 3.8i
.if n .ta .7i 1.75i 3.8i
..
E 7
I 7
.Dd %Q%
.Dt INET 4
.Os BSD 4.2
.Sh NAME
.Nm inet
.Nd Internet protocol family
.Sh SYNOPSIS
.Fd #include <sys/types.h>
.Fd #include <netinet/in.h>
.Sh DESCRIPTION
E 7
The Internet protocol family is a collection of protocols
layered atop the
D 7
.I Internet Protocol
(IP) transport layer, and utilizing the Internet address format.
E 7
I 7
.Em Internet  Protocol
.Pq Tn IP
transport layer, and utilizing the Internet address format.
E 7
The Internet family provides protocol support for the
D 7
SOCK_STREAM, SOCK_DGRAM, and SOCK_RAW socket types; the
SOCK_RAW interface provides access to the IP protocol.
.SH ADDRESSING
E 7
I 7
.Dv SOCK_STREAM , SOCK_DGRAM ,
and
.Dv SOCK_RAW
socket types; the
.Dv SOCK_RAW
interface provides access to the
.Tn IP
protocol.
.Sh ADDRESSING
E 7
Internet addresses are four byte quantities, stored in
D 7
network standard format (on the VAX these are word and byte
E 7
I 7
network standard format (on the
.Tn VAX
these are word and byte
E 7
reversed).  The include file
D 7
.RI < netinet/in.h >
E 7
I 7
.Aq Pa netinet/in.h
E 7
defines this address
as a discriminated union.
D 7
.PP
E 7
I 7
.Pp
E 7
Sockets bound to the Internet protocol family utilize
the following addressing structure,
D 7
.sp 1
.nf
._f
E 7
I 7
.Bd -literal -offset indent
E 7
struct sockaddr_in {
	short	sin_family;
	u_short	sin_port;
	struct	in_addr sin_addr;
	char	sin_zero[8];
};
D 7
.sp 1
.fi
D 3
Sockets may be created with the address INADDR_ANY
E 3
I 3
Sockets may be created with the local address INADDR_ANY
E 3
to effect \*(lqwildcard\*(rq matching on incoming messages. 
E 7
I 7
.Ed
.Pp
Sockets may be created with the local address
.Dv INADDR_ANY
to effect
.Dq wildcard
matching on incoming messages. 
E 7
I 3
The address in a
D 7
.IR connect (2)
E 7
I 7
.Xr connect 2
E 7
or
D 7
.IR sendto (2)
call may be given as INADDR_ANY to mean ``this host.''
The distinguished address INADDR_BROADCAST
E 7
I 7
.Xr sendto 2
call may be given as
.Dv INADDR_ANY
to mean
.Dq this host .
The distinguished address
.Dv INADDR_BROADCAST
E 7
is allowed as a shorthand for the broadcast address on the primary
network if the first network configured supports broadcast.
E 3
D 7
.SH PROTOCOLS
E 7
I 7
.Sh PROTOCOLS
E 7
The Internet protocol family is comprised of
D 7
the IP transport protocol, Internet Control
Message Protocol (ICMP), Transmission Control
Protocol (TCP), and User Datagram Protocol (UDP).
TCP is used to support the SOCK_STREAM
abstraction while UDP is used to support the SOCK_DGRAM
abstraction.  A raw interface to IP is available
by creating an Internet socket of type SOCK_RAW.
D 3
The ICMP message protocol is not directly accessible.
E 3
I 3
The ICMP message protocol is accessible from a raw socket.
.PP
E 7
I 7
the
.Tn IP
transport protocol, Internet Control
Message Protocol
.Pq Tn ICMP ,
Transmission Control
Protocol
.Pq Tn TCP ,
and User Datagram Protocol
.Pq Tn UDP .
.Tn TCP
is used to support the
.Dv SOCK_STREAM
abstraction while
.Tn UDP
is used to support the
.Dv SOCK_DGRAM
abstraction.  A raw interface to
.Tn IP
is available
by creating an Internet socket of type
.Dv SOCK_RAW .
The
.Tn ICMP
message protocol is accessible from a raw socket.
.Pp
E 7
The 32-bit Internet address contains both network and host parts.
It is frequency-encoded; the most-significant bit is clear
in Class A addresses, in which the high-order 8 bits are the network
number.
Class B addresses use the high-order 16 bits as the network field,
and Class C addresses have a 24-bit network part.
D 7
Sites with a cluster of local networks and a connection to the DARPA
E 7
I 7
Sites with a cluster of local networks and a connection to the
D 8
.Tn DARPA
E 8
E 7
Internet may chose to use a single network number for the cluster;
this is done by using subnet addressing.
The local (host) portion of the address is further subdivided
into subnet and host parts.
Within a subnet, each subnet appears to be an individual network;
externally, the entire cluster appears to be a single, uniform
network requiring only a single routing entry.
Subnet addressing is enabled and examined by the following
D 7
.IR ioctl (2)
E 7
I 7
.Xr ioctl 2
E 7
commands on a datagram socket in the Internet domain;
they have the same form as the
D 7
SIOCIFADDR command (see
D 5
.IR intro (4N)).
E 5
I 5
.IR intro (4)).
E 5
.PP
.TP 20
SIOCSIFNETMASK
E 7
I 7
.Dv SIOCIFADDR
command (see
.Xr intro 4 ) .
.Pp
.Bl -tag -width SIOCSIFNETMASK
.It Dv SIOCSIFNETMASK
E 7
Set interface network mask.
The network mask defines the network part of the address;
if it contains more of the address than the address type would indicate,
then subnets are in use.
D 7
.TP 20
SIOCGIFNETMASK
E 7
I 7
.It Dv SIOCGIFNETMASK
E 7
Get interface network mask.
E 3
D 7
.SH SEE ALSO
D 3
tcp(4P), udp(4P), ip(4P)
E 3
I 3
D 5
ioctl(2), socket(2), intro(4N), tcp(4P), udp(4P), ip(4P), icmp(4P)
E 5
I 5
ioctl(2), socket(2), intro(4), tcp(4), udp(4), ip(4), icmp(4)
E 5
I 4
.PP
An Introductory 4.3BSD Interprocess Communication Tutorial (PS1:7).
.PP
An Advanced 4.3BSD Interprocess Communication Tutorial (PS1:8).
E 4
E 3
.SH CAVEAT
E 7
I 7
.El
.Sh SEE ALSO
.Xr ioctl 2 ,
.Xr socket 2 ,
.Xr intro 4 ,
.Xr tcp 4 ,
.Xr udp 4 ,
.Xr ip 4 ,
.Xr icmp 4
.Rs
.%T "An Introductory 4.3 BSD Interprocess Communication Tutorial"
.%B PS1
.%N 7
.Re
.Rs
.%T "An Advanced 4.3 BSD Interprocess Communication Tutorial"
.%B PS1
.%N 8
.Re
.Sh CAVEAT
E 7
The Internet protocol support is subject to change as
the Internet protocols develop.  Users should not depend
on details of the current implementation, but rather
the services exported.
I 7
.Sh HISTORY
The
.Nm
protocol interface appeared in
.Bx 4.2 .
E 7
E 1
