share/man/man4/SCCS/s.lo.4
h17826
s 00002/00002/00053
d D 8.1 93/06/05 13:46:07 bostic 8 7
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00034/00017/00021
d D 6.6 91/03/28 00:46:06 cael 7 6
c macro and text revision (-mdoc version 3)
e
s 00001/00011/00037
d D 6.5 90/06/23 18:04:36 trent 6 5
c new copyright notice
e
s 00015/00004/00033
d D 6.4 89/02/14 17:18:26 bostic 5 4
c add Berkeley specific copyright notice, remove subsection notation
e
s 00006/00000/00031
d D 6.3 86/05/21 22:33:31 karels 4 3
c warning about order of configuration
e
s 00008/00007/00023
d D 6.2 86/05/16 15:55:15 karels 3 2
c updates
e
s 00001/00001/00029
d D 6.1 85/05/15 17:45:22 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00030/00000/00000
d D 5.1 85/05/15 17:45:15 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
D 5
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 5
I 5
D 7
.\" Copyright (c) 1983 The Regents of the University of California.
E 7
I 7
D 8
.\" Copyright (c) 1983, 1991 The Regents of the University of California.
E 7
.\" All rights reserved.
E 8
I 8
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 8
E 5
.\"
I 5
D 6
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 6
I 6
.\" %sccs.include.redist.man%
E 6
.\"
E 5
D 7
.\"	%W% (Berkeley) %G%
E 7
I 7
.\"     %W% (Berkeley) %G%
E 7
.\"
D 2
.TH LO 4 "26 March 1982"
E 2
I 2
D 7
.TH LO 4 "%Q%"
E 2
.UC 5
.SH NAME
lo \- software loopback network interface
.SH SYNOPSIS
.B pseudo-device loop
.SH DESCRIPTION
E 7
I 7
.Dd %Q%
.Dt LO 4
.Os BSD 4.2
.Sh NAME
.Nm lo
.Nd software loopback network interface
.Sh SYNOPSIS
.Sy pseudo-device
.Nm loop
.Sh DESCRIPTION
E 7
The
D 7
.I loop
E 7
I 7
.Nm loop
E 7
interface is a software loopback mechanism which may be
used for performance analysis, software testing, and/or local
D 3
communication.   By default, the loopback interface is
accessible at address 127.0.0.1 (non-standard); this address
may be changed with the SIOCSIFADDR ioctl.
E 3
I 3
communication.
As with other network interfaces, the loopback interface must have
network addresses assigned for each address family with which it is to be used.
These addresses
D 7
may be set or changed with the SIOCSIFADDR ioctl.
E 7
I 7
may be set or changed with the
.Dv SIOCSIFADDR
.Xr ioctl 2 .
E 7
I 4
The loopback interface should be the last interface configured,
as protocols may use the order of configuration as an indication of priority.
D 7
The loopback should \fBnever\fP be configured first unless no hardware
E 7
I 7
The loopback should
.Em never
be configured first unless no hardware
E 7
interfaces exist.
E 4
E 3
D 7
.SH DIAGNOSTICS
\fBlo%d: can't handle af%d\fP.  The interface was handed
E 7
I 7
.Sh DIAGNOSTICS
.Bl -diag
.It lo%d: can't handle af%d.
The interface was handed
E 7
a message with addresses formatted in an unsuitable address
family; the packet was dropped.
D 7
.SH SEE ALSO
D 3
intro(4N), inet(4F)
E 3
I 3
D 5
intro(4N), inet(4F), ns(4F)
E 5
I 5
intro(4), inet(4), ns(4)
E 5
E 3
.SH BUGS
E 7
I 7
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr inet 4 ,
.Xr ns 4
.Sh HISTORY
The
.Nm
device appeared in
.Bx 4.2 .
.Sh BUGS
E 7
D 3
It should handle all address and protocol families.
An approved network address should be reserved for this
interface.
E 3
I 3
Previous versions of the system enabled the loopback interface
automatically, using a nonstandard Internet address (127.1).
I 4
Use of that address is now discouraged; a reserved host address
for the local network should be used instead.
E 4
E 3
E 1
