share/man/man4/SCCS/s.netintro.4
h54558
s 00001/00001/00301
d D 8.2 93/11/30 16:48:28 mckusick 16 15
c copy edit changes from Usenix
e
s 00002/00002/00300
d D 8.1 93/07/19 11:25:57 bostic 15 14
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00002/00007/00300
d D 6.12 93/07/19 11:25:32 mckusick 14 12
c delete references to ARPANET IMP
e
s 00002/00002/00305
d R 8.1 93/06/05 13:46:21 bostic 13 12
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00000/00002/00307
d D 6.11 93/05/11 22:59:30 andrew 12 11
c delete DARPA
e
s 00168/00171/00141
d D 6.10 91/03/28 00:46:07 cael 11 10
c macro and text revision (-mdoc version 3)
e
s 00001/00001/00311
d D 6.9 90/06/23 16:34:43 trent 10 9
c changed /usr/adm/messages to /var/log/messages
e
s 00005/00006/00307
d D 6.8 90/05/30 15:17:03 sklower 9 8
c minor cleanups
e
s 00110/00113/00203
d D 6.7 90/05/30 15:01:02 sklower 8 7
c move routing info to separate page; document changed sockaddrs\;
e
s 00015/00015/00301
d D 6.6 89/02/14 17:18:27 bostic 7 6
c add Berkeley specific copyright notice, remove subsection notation
e
s 00005/00002/00311
d D 6.5 87/08/01 11:05:32 bostic 6 5
c ifru_data field missing from ifreq structure; add IFNAMSIZ define
e
s 00002/00006/00311
d D 6.4 87/08/01 10:20:05 bostic 5 4
c mv intro.4 to netintro.4, it hid {vax,tahoe}/intro.4
e
s 00006/00003/00311
d D 6.3 86/06/01 00:45:05 mis 4 3
c added protocols used, fixed spelling error.
e
s 00069/00052/00245
d D 6.2 86/05/16 15:55:25 karels 3 2
c updates
e
s 00001/00001/00296
d D 6.1 85/05/15 17:44:35 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00297/00000/00000
d D 5.1 85/05/15 17:44:26 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
D 7
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 7
I 7
D 8
.\" Copyright (c) 1983 The Regents of the University of California.
E 8
I 8
D 11
.\" Copyright (c) 1983, 1990 The Regents of the University of California.
E 11
I 11
D 15
.\" Copyright (c) 1983, 1990, 1991 The Regents of the University of California.
E 11
E 8
.\" All rights reserved.
E 15
I 15
.\" Copyright (c) 1983, 1990, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 15
E 7
.\"
I 7
D 8
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 8
I 8
.\" %sccs.include.redist.man%
E 8
.\"
E 7
D 11
.\"	%W% (Berkeley) %G%
E 11
I 11
.\"     %W% (Berkeley) %G%
E 11
.\"
D 2
.TH INTRO 4N "7 July 1983"
E 2
I 2
D 5
.TH INTRO 4N "%Q%"
E 5
I 5
D 11
.TH NETINTRO 4 "%Q%"
E 5
E 2
.UC 5
.SH NAME
networking \- introduction to networking facilities
.SH SYNOPSIS
.nf
.ft B
#include <sys/socket.h>
#include <net/route.h>
#include <net/if.h>
.fi R
.fi
.SH DESCRIPTION
.de _d
.if t .ta .6i 2.1i 2.6i
.\" 2.94 went to 2.6, 3.64 to 3.30
.if n .ta .84i 2.6i 3.30i
..
.de _f
.if t .ta .5i 1.25i 2.5i
.\" 3.5i went to 3.8i
.if n .ta .7i 1.75i 3.8i
..
E 11
I 11
.Dd %Q%
.Dt NETINTRO 4
.Os BSD 4.2
.Sh NAME
.Nm networking
.Nd introduction to networking facilities
.Sh SYNOPSIS
.Fd #include <sys/socket.h>
.Fd #include <net/route.h>
.Fd #include <net/if.h>
.Sh DESCRIPTION
E 11
D 8
This section briefly describes the networking facilities
E 8
I 8
This section is a general introduction to the networking facilities
E 8
available in the system.
I 8
Documentation in this part of section
4 is broken up into three areas:
D 11
.I "protocol families
E 11
I 11
.Em protocol families
E 11
(domains),
D 11
.IR protocols ,
E 11
I 11
.Em protocols ,
E 11
and
D 11
.IR "network interfaces" .
D 9
Entries describing a protocol family are marked ``4F,''
while entries describing protocol use are marked ``4P.''
Hardware support for network interfaces are found
among the standard ``4'' entries.
E 9
I 9
.\" Entries describing a protocol family are marked ``4F,''
.\" while entries describing protocol use are marked ``4P.''
.\" Hardware support for network interfaces are found
.\" among the standard ``4'' entries.
E 9
E 8
D 7
Documentation in this part of section
4 is broken up into three areas:
D 3
.IR protocol-families ,
E 3
I 3
.I "protocol families
(domains),
E 3
.IR protocols ,
and
.IR "network interfaces" .
D 3
Entries describing a protocol-family are marked ``4F'',
while entries describing protocol use are marked ``4P''.
E 3
I 3
Entries describing a protocol family are marked ``4F,''
while entries describing protocol use are marked ``4P.''
E 3
Hardware support for network interfaces are found
among the standard ``4'' entries.
E 7
.PP
E 11
I 11
.Em network interfaces .
.Pp
E 11
All network protocols are associated with a specific
D 3
.IR protocol-family .
A protocol-family provides basic services to the protocol
E 3
I 3
D 11
.IR "protocol family" .
E 11
I 11
.Em protocol family .
E 11
A protocol family provides basic services to the protocol
E 3
implementation to allow it to function within a specific
network environment.  These services may include 
packet fragmentation and reassembly, routing, addressing, and 
D 3
basic transport.  A protocol-family may support multiple
E 3
I 3
basic transport.  A protocol family may support multiple
E 3
methods of addressing, though the current protocol implementations
D 3
do not.  A protocol-family is normally comprised of a number
E 3
I 3
do not.  A protocol family is normally comprised of a number
E 3
of protocols, one per
D 11
.IR socket (2)
E 11
I 11
.Xr socket 2
E 11
D 3
type.  It is not required that a protocol-family support
all socket types.  A protocol-family may contain multiple
E 3
I 3
type.  It is not required that a protocol family support
all socket types.  A protocol family may contain multiple
E 3
protocols supporting the same socket abstraction. 
D 11
.PP
E 11
I 11
.Pp
E 11
D 14
A protocol supports one of the socket abstractions detailed
in
E 14
I 14
A protocol supports one of the socket abstractions detailed in
E 14
D 11
.IR socket (2).
E 11
I 11
.Xr socket 2 .
E 11
A specific protocol may be accessed either by creating a
D 3
socket of the appropriate type and protocol-family, or
E 3
I 3
socket of the appropriate type and protocol family, or
E 3
by requesting the protocol explicitly when creating a socket.
Protocols normally accept only one type of address format,
usually determined by the addressing structure inherent in
D 3
the design of the protocol-family/network architecture.
E 3
I 3
the design of the protocol family/network architecture.
E 3
Certain semantics of the basic socket abstractions are
protocol specific.  All protocols are expected to support
the basic model for their particular socket type, but may,
in addition, provide non-standard facilities or extensions
to a mechanism.  For example, a protocol supporting the
D 11
SOCK_STREAM
E 11
I 11
.Dv SOCK_STREAM
E 11
abstraction may allow more than one byte of out-of-band
data to be transmitted per out-of-band message.
D 11
.PP
E 11
I 11
.Pp
E 11
A network interface is similar to a device interface.
Network interfaces comprise the lowest layer of the
networking subsystem, interacting with the actual transport
hardware.  An interface may support one or more protocol
D 3
families, and/or address formats.
E 3
I 3
families and/or address formats.
E 3
The SYNOPSIS section of each network interface
entry gives a sample specification
of the related drivers for use in providing
a system description to the
D 11
.IR config (8)
E 11
I 11
.Xr config 8
E 11
program.
The DIAGNOSTICS section lists messages which may appear on the console
D 3
and in the system error log
E 3
I 3
and/or in the system error log,
E 3
D 10
.I /usr/adm/messages
E 10
I 10
D 11
.I /var/log/messages
E 11
I 11
.Pa /var/log/messages
E 11
E 10
I 3
(see
D 11
.IR syslogd (8)),
E 11
I 11
.Xr syslogd 8 ) ,
E 11
E 3
due to errors in device operation.
D 11
.SH PROTOCOLS
D 3
The system currently supports only the DARPA Internet
protocols fully.  Raw socket interfaces are provided to IP protocol
E 3
I 3
The system currently supports the DARPA Internet
E 11
I 11
.Sh PROTOCOLS
The system currently supports the
D 12
.Tn DARPA
E 12
Internet
E 11
D 8
protocols and the Xerox Network Systems(tm) protocols.
E 8
I 8
protocols, the Xerox Network Systems(tm) protocols,
D 11
and some of the ISO OSI protocols.
E 8
Raw socket interfaces are provided to the IP protocol
E 3
layer of the DARPA Internet, to the IMP link layer (1822), and to
D 3
Xerox PUP-1 layer operating on top of 3Mb/s Ethernet interfaces.
E 3
I 3
the IDP protocol of Xerox NS.
E 11
I 11
and some of the
.Tn ISO OSI
protocols.
Raw socket interfaces are provided to the
.Tn IP
protocol
layer of the
D 12
.Tn DARPA
E 12
D 14
Internet, to the
.Tn IMP
link layer (1822), and to
the
E 14
I 14
Internet, and to the
E 14
.Tn IDP
protocol of Xerox
.Tn NS .
E 11
E 3
Consult the appropriate manual pages in this section for more
information regarding the support for each protocol family.
D 11
.SH ADDRESSING
E 11
I 11
.Sh ADDRESSING
E 11
Associated with each protocol family is an address
D 4
format.  The following address formats are used by the system:
E 4
I 4
D 8
format.  The following address formats are used by the system (and additional
formats are defined for possible future implementation):
E 8
I 8
format.  All network address adhere to a general structure,
called a sockaddr, described below. However, each protocol
imposes finer and more specific structure, generally renaming
the variant, which is discussed in the protocol family manual
page alluded to above.
D 11
.nf
._f
struct sockaddr {
E 11
I 11
.Bd -literal -offset indent
    struct sockaddr {
E 11
	u_char	sa_len;
D 11
	u_char	sa_family;
	char	sa_data[14];
E 11
I 11
    	u_char	sa_family;
    	char	sa_data[14];
E 11
};
E 8
E 4
D 11
.sp 1
I 8
.fi
The field sa_len contains the total length of the of the structure,
E 11
I 11
.Ed
.Pp
The field
.Ar sa_len
contains the total length of the of the structure,
E 11
which may exceed 16 bytes.
The following address values for
D 9
The following address values for
E 9
D 11
.I sa_family
E 11
I 11
.Ar sa_family
E 11
are known to the system
(and additional formats are defined for possible future implementation):
D 11
.sp 1
E 8
.nf
._d
#define	AF_UNIX	1	/* local to host (pipes, portals) */
#define	AF_INET	2	/* internetwork: UDP, TCP, etc. */
#define	AF_IMPLINK	3	/* arpanet imp addresses */
D 9
#define	AF_PUP	4	/* pup protocols: e.g. BSP */
E 9
I 4
#define	AF_NS	6	/* Xerox NS protocols */
I 9
#define	AF_CCITT	10	/* CCITT protocols, X.25 etc */
E 9
#define	AF_HYLINK	15	/* NSC Hyperchannel */
I 8
#define	AF_ISO	18	/* ISO protocols */
E 8
E 4
.fi
.SH ROUTING
D 8
The network facilities provided limited packet routing.
A simple set of data structures comprise a ``routing table''
used in selecting the appropriate network interface when
transmitting packets.  This table contains a single entry for
each route to a specific network or host.  A user process,
the routing daemon, maintains this data base with the aid
D 4
of two socket specific 
E 4
I 4
of two socket-specific 
E 4
.IR ioctl (2)
commands, SIOCADDRT and SIOCDELRT.  The commands allow
the addition and deletion of a single routing
table entry, respectively.  Routing table manipulations may
only be carried out by super-user.
E 8
.PP
D 8
A routing table entry has the following form, as defined
in
.RI < net/route.h >;
.sp 1
._f
.nf
struct rtentry {
	u_long	rt_hash;
	struct	sockaddr rt_dst;
	struct	sockaddr rt_gateway;
	short	rt_flags;
	short	rt_refcnt;
	u_long	rt_use;
	struct	ifnet *rt_ifp;
};
.sp 1
.fi
with
.I rt_flags
defined from,
.sp 1
.nf
._d
#define	RTF_UP	0x1		/* route usable */
#define	RTF_GATEWAY	0x2		/* destination is a gateway */
#define	RTF_HOST	0x4		/* host entry (net otherwise) */
I 3
#define	RTF_DYNAMIC	0x10		/* created dynamically (by redirect) */
E 3
.fi
E 8
I 8
.UX
E 11
I 11
.Bd -literal
#define    AF_UNIX      1    /* local to host (pipes, portals) */
#define    AF_INET      2    /* internetwork: UDP, TCP, etc. */
D 14
#define    AF_IMPLINK   3    /* arpanet imp addresses */
E 14
#define    AF_NS        6    /* Xerox NS protocols */
#define    AF_CCITT     10   /* CCITT protocols, X.25 etc */
#define    AF_HYLINK    15   /* NSC Hyperchannel */
#define    AF_ISO       18   /* ISO protocols */
.Ed
.Sh ROUTING
.Tn UNIX
E 11
provides some packet routing facilities.
The kernel maintains a routing information database, which
is used in selecting the appropriate network interface when
transmitting packets.
E 8
D 11
.PP
E 11
I 11
.Pp
E 11
D 8
Routing table entries come in three flavors: for a specific
host, for all hosts on a specific network, for any destination
not matched by entries of the first two types (a wildcard route). 
D 3
When the system
is booted, each network interface autoconfigured 
installs a routing table entry when it wishes to have packets
sent through it.  Normally the interface specifies the route
through it is a ``direct'' connection to the destination host
E 3
I 3
When the system is booted and addresses are assigned
to the network interfaces, each protocol family
installs a routing table entry for each interface when it is ready for traffic.
Normally the protocol specifies the route
through each interface as a ``direct'' connection to the destination host
E 3
or network.  If the route is direct, the transport layer of
a protocol family usually requests the packet be sent to the
same host specified in the packet.  Otherwise, the interface
D 3
may be requested to address the packet to an entity different
from the eventual recipient (i.e. the packet is forwarded).
E 3
I 3
is requested to address the packet to the gateway listed in the routing entry
(i.e. the packet is forwarded).
E 8
I 8
A user process (or possibly multiple co-operating processes)
maintains this database by sending messages over a special kind
of socket.
This supplants fixed size
D 11
.IR ioctl 's
E 11
I 11
.Xr ioctl 2
E 11
used in earlier releases.
E 8
E 3
D 11
.PP
E 11
I 11
.Pp
E 11
D 8
Routing table entries installed by a user process may not specify
the hash, reference count, use, or interface fields; these are filled
in by the routing routines.  If
a route is in use when it is deleted
.RI ( rt_refcnt
is non-zero),
D 3
the resources associated with it will not
be reclaimed until further references to it are released. 
.PP
E 3
I 3
the routing entry will be marked down and removed from the routing table,
but the resources associated with it will not
be reclaimed until all references to it are released. 
E 3
The routing code returns EEXIST if
requested to duplicate an existing entry, ESRCH if
D 4
requested to delete a non-existant entry,
E 4
I 4
requested to delete a non-existent entry,
E 4
or ENOBUFS if insufficient resources were available
to install a new route.
D 3
.PP
E 3
User processes read the routing tables through the
.I /dev/kmem 
device.
D 3
.PP
E 3
The
.I rt_use
field contains the number of packets sent along the route.
D 3
This value is used to select among multiple
routes to the same destination.  When multiple routes to
the same destination exist, the least used route is selected.
E 3
.PP
I 3
When routing a packet,
the kernel will first attempt to find a route to the destination host.
Failing that, a search is made for a route to the network of the destination.
Finally, any route to a default (``wildcard'') gateway is chosen.
If multiple routes are present in the table,
the first route found will be used.
If no entry is found, the destination is declared to be unreachable.
.PP
E 3
A wildcard routing entry is specified with a zero
destination address value.  Wildcard routes are used
only when the system fails to find a route to the
destination host and network.  The combination of wildcard
routes and routing redirects can provide an economical
mechanism for routing traffic.
E 8
I 8
This facility is described in
D 11
.IR route (4).
E 8
.SH INTERFACES
E 11
I 11
.Xr route 4 .
.Sh INTERFACES
E 11
Each network interface in a system corresponds to a
path through which messages may be sent and received.  A network
interface usually has a hardware device associated with it, though
certain interfaces such as the loopback interface,
D 11
.IR lo (4),
E 11
I 11
.Xr lo 4 ,
E 11
do not.
D 11
.PP
E 11
I 11
.Pp
E 11
D 3
At boot time each interface which has underlying hardware support
makes itself known to the system during the autoconfiguration
process.  Once the interface has acquired its address it is
expected to install a routing table entry so that messages may
be routed through it.  Most interfaces require some part of
their address specified with an SIOCSIFADDR ioctl before they
will allow traffic to flow through them.  On interfaces where
the network-link layer address mapping is static, only the
network number is taken from the ioctl; the remainder is found
in a hardware specific manner.  On interfaces which provide
dynamic network-link layer address mapping facilities (e.g.
10Mb/s Ethernets), the entire address specified in the ioctl
is used.
.PP
E 3
The following 
D 11
.I ioctl
E 11
I 11
.Xr ioctl
E 11
D 3
calls may be used to manipulate network interfaces.  Unless
specified otherwise, the request takes an
E 3
I 3
calls may be used to manipulate network interfaces.
The
D 11
.I ioctl
is made on a socket (typically of type SOCK_DGRAM)
E 11
I 11
.Xr ioctl
is made on a socket (typically of type
.Dv SOCK_DGRAM )
E 11
in the desired domain.
D 8
Unless specified otherwise, the request takes an
E 3
.I ifrequest
E 8
I 8
Most of the requests supported in earlier releases 
take an
D 11
.I ifreq
E 11
I 11
.Ar ifreq
E 11
E 8
structure as its parameter.  This structure has the form
D 11
.PP
.nf
I 8
._d
E 8
.DT
E 11
I 11
.Bd -literal
E 11
struct	ifreq {
D 6
	char	ifr_name[16];		/* name of interface (e.g. "ec0") */
E 6
I 6
D 11
#define	IFNAMSIZ	16
	char	ifr_name[IFNAMSIZE];		/* if name, e.g. "en0" */
E 6
	union {
		struct	sockaddr ifru_addr;
		struct	sockaddr ifru_dstaddr;
I 3
		struct	sockaddr ifru_broadaddr;
E 3
		short	ifru_flags;
I 3
		int	ifru_metric;
I 6
		caddr_t	ifru_data;
E 6
E 3
	} ifr_ifru;
#define	ifr_addr	ifr_ifru.ifru_addr	/* address */
#define	ifr_dstaddr	ifr_ifru.ifru_dstaddr	/* other end of p-to-p link */
I 3
#define	ifr_broadaddr	ifr_ifru.ifru_broadaddr	/* broadcast address */
E 3
#define	ifr_flags	ifr_ifru.ifru_flags	/* flags */
I 3
D 6
#define	ifr_metric	ifr_ifru.ifru_metric	/* routing metric */
E 6
I 6
#define	ifr_metric	ifr_ifru.ifru_metric	/* metric */
#define	ifr_data	ifr_ifru.ifru_data	/* for use by interface */
E 11
I 11
#define    IFNAMSIZ    16
    char    ifr_name[IFNAMSIZE];        /* if name, e.g. "en0" */
    union {
        struct    sockaddr ifru_addr;
        struct    sockaddr ifru_dstaddr;
        struct    sockaddr ifru_broadaddr;
        short     ifru_flags;
        int       ifru_metric;
        caddr_t   ifru_data;
    } ifr_ifru;
#define ifr_addr      ifr_ifru.ifru_addr    /* address */
#define ifr_dstaddr   ifr_ifru.ifru_dstaddr /* other end of p-to-p link */
#define ifr_broadaddr ifr_ifru.ifru_broadaddr /* broadcast address */
#define ifr_flags     ifr_ifru.ifru_flags   /* flags */
#define ifr_metric    ifr_ifru.ifru_metric  /* metric */
#define ifr_data      ifr_ifru.ifru_data    /* for use by interface */
E 11
E 6
E 3
};
D 11
.fi
E 11
I 11
.Ed
.Pp
E 11
I 8
Calls which are now deprecated are:
E 8
D 11
.TP
SIOCSIFADDR
E 11
I 11
.Bl -tag -width SIOCGIFBRDADDR
.It Dv SIOCSIFADDR
E 11
D 3
Set interface address.  Following the address
E 3
I 3
Set interface address for protocol family.  Following the address
E 3
assignment, the ``initialization'' routine for
the interface is called.
D 11
.TP
D 8
SIOCGIFADDR
D 3
Get interface address.
E 3
I 3
Get interface address for protocol family.
E 3
.TP
E 8
SIOCSIFDSTADDR
E 11
I 11
.It Dv SIOCSIFDSTADDR
E 11
D 3
Set point to point address for interface.
E 3
I 3
Set point to point address for protocol family and interface.
E 3
D 11
.TP
D 8
SIOCGIFDSTADDR
D 3
Get point to point address for interface.
E 3
I 3
Get point to point address for protocol family and interface.
E 3
.TP
E 8
I 3
SIOCSIFBRDADDR
E 11
I 11
.It Dv SIOCSIFBRDADDR
E 11
Set broadcast address for protocol family and interface.
I 8
D 11
.LP
.I Ioctls
E 11
I 11
.El
.Pp
.Xr Ioctl
E 11
requests to obtain addresses and requests both to set and
D 16
retreive other data are still fully supported
E 16
I 16
retrieve other data are still fully supported
E 16
and use the
D 11
.I ifreq
E 11
I 11
.Ar ifreq
E 11
structure:
E 8
D 11
.TP
I 8
SIOCGIFADDR
E 11
I 11
.Bl -tag -width SIOCGIFBRDADDR
.It Dv SIOCGIFADDR
E 11
Get interface address for protocol family.
D 11
.TP
SIOCGIFDSTADDR
E 11
I 11
.It Dv SIOCGIFDSTADDR
E 11
Get point to point address for protocol family and interface.
D 11
.TP
E 8
SIOCGIFBRDADDR
E 11
I 11
.It Dv SIOCGIFBRDADDR
E 11
Get broadcast address for protocol family and interface.
D 11
.TP
E 3
SIOCSIFFLAGS
E 11
I 11
.It Dv SIOCSIFFLAGS
E 11
Set interface flags field.  If the interface is marked down,
any processes currently routing packets through the interface
D 3
are notified.
E 3
I 3
are notified;
some interfaces may be reset so that incoming packets are no longer received.
When marked up again, the interface is reinitialized.
E 3
D 11
.TP
SIOCGIFFLAGS
E 11
I 11
.It Dv SIOCGIFFLAGS
E 11
Get interface flags.
I 3
D 11
.TP
SIOCSIFMETRIC
E 11
I 11
.It Dv SIOCSIFMETRIC
E 11
Set interface routing metric.
The metric is used only by user-level routers.
D 11
.TP
SIOCGIFMETRIC
E 11
I 11
.It Dv SIOCGIFMETRIC
E 11
Get interface metric.
I 8
D 11
.LP
E 11
I 11
.El
.Pp
E 11
There are two requests that make use of a new structure:
E 8
E 3
D 11
.TP
I 8
SIOCAIFADDR
E 11
I 11
.Bl -tag -width SIOCGIFBRDADDR
.It Dv SIOCAIFADDR
E 11
An interface may have more than one address associated with it
in some protocols.  This request provides a means to
add additional addresses (or modify characteristics of the
primary address if the default address for the address family
is specified).  Rather than making separate calls to
set destination or broadcast addresses, or network masks
(now an integral feature of multiple protocols)
D 11
a separate structure is used to specify all three facets simultaneously:
.nf

.ta \w'struct  'u +\w'struct  'u +\w'sockaddr  'u +\w'ifra_broaddadr   'u
struct ifaliasreq {
	char	ifra_name[IFNAMSIZ];		/* if name, e.g. "en0" */
	struct	sockaddr	ifra_addr;
	struct	sockaddr	ifra_broadaddr;
	struct	sockaddr	ifra_mask;
};
.fi
E 11
I 11
a separate structure is used to specify all three facets simultaneously
(see below).
E 11
One would use a slightly tailored version of this struct specific
to each family (replacing each sockaddr by one
of the family-specific type).
Where the sockaddr itself is larger than the
default size, one needs to modify the
D 11
.I ioctl
E 11
I 11
.Xr ioctl
E 11
identifier itself to include the total size, as described in
D 11
.IR ioctl (2).
.TP
SIOCDIFADDR
E 11
I 11
.Xr ioctl .
.It Dv SIOCDIFADDR
E 11
This requests deletes the specified address from the list
D 11
associated with an interface.  It also uses the if_aliasreq
E 11
I 11
associated with an interface.  It also uses the
.Ar if_aliasreq
E 11
structure to allow for the possibility of protocols allowing
multiple masks or destination addresses, and also adopts the
convention that specification of the default address means
to delete the first address for the interface belonging to
the address family in which the original socket was opened.
D 11
.TP
E 8
SIOCGIFCONF
E 11
I 11
.It Dv SIOCGIFCONF
E 11
Get interface configuration list.  This request takes an
D 11
.I ifconf
E 11
I 11
.Ar ifconf
E 11
structure (see below) as a value-result parameter.  The 
D 11
.I ifc_len
E 11
I 11
.Ar ifc_len
E 11
field should be initially set to the size of the buffer
pointed to by 
D 11
.IR ifc_buf .
E 11
I 11
.Ar ifc_buf .
E 11
On return it will contain the length, in bytes, of the
configuration list.
D 11
.PP
I 8
._d
E 8
.nf
.DT
E 11
I 11
.El
.Bd -literal
E 11
/*
D 11
 * Structure used in SIOCGIFCONF request.
 * Used to retrieve interface configuration
 * for machine (useful for programs which
 * must know all networks accessible).
 */
struct	ifconf {
	int	ifc_len;		/* size of associated buffer */
	union {
		caddr_t	ifcu_buf;
		struct	ifreq *ifcu_req;
	} ifc_ifcu;
#define	ifc_buf	ifc_ifcu.ifcu_buf	/* buffer address */
#define	ifc_req	ifc_ifcu.ifcu_req	/* array of structures returned */
E 11
I 11
* Structure used in SIOCAIFCONF request.
*/
struct ifaliasreq {
        char    ifra_name[IFNAMSIZ];   /* if name, e.g. "en0" */
        struct  sockaddr        ifra_addr;
        struct  sockaddr        ifra_broadaddr;
        struct  sockaddr        ifra_mask;
E 11
};
D 11
.fi
.SH SEE ALSO
D 5
socket(2),
ioctl(2),
intro(4),
config(8),
routed(8C)
E 5
I 5
D 7
socket(2), ioctl(2), intro(4), config(8), routed(8C)
E 7
I 7
D 8
socket(2), ioctl(2), intro(4), config(8), routed(8)
E 8
I 8
socket(2), ioctl(2), intro(4), config(8), routed(8C)
E 11
I 11
.Ed
.Pp
.Bd -literal
/*
* Structure used in SIOCGIFCONF request.
* Used to retrieve interface configuration
* for machine (useful for programs which
* must know all networks accessible).
*/
struct ifconf {
    int   ifc_len;		/* size of associated buffer */
    union {
        caddr_t    ifcu_buf;
        struct     ifreq *ifcu_req;
    } ifc_ifcu;
#define ifc_buf ifc_ifcu.ifcu_buf /* buffer address */
#define ifc_req ifc_ifcu.ifcu_req /* array of structures returned */
};
.Ed
.Sh SEE ALSO
.Xr socket 2 ,
.Xr ioctl 2 ,
.Xr intro 4 ,
.Xr config 8 ,
.Xr routed 8
.Sh HISTORY
The
.Nm netintro
manual appeared in
.Bx 4.3 tahoe .
E 11
E 8
E 7
E 5
E 1
