share/man/man4/SCCS/s.nsip.4
h46219
s 00001/00001/00101
d D 8.2 93/11/30 16:48:30 mckusick 6 5
c copy edit changes from Usenix
e
s 00002/00002/00100
d D 8.1 93/06/05 13:46:34 bostic 5 4
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00077/00036/00025
d D 1.4 91/03/28 00:46:09 cael 4 3
c macro and text revision (-mdoc version 3)
e
s 00001/00011/00060
d D 1.3 90/06/23 18:04:28 trent 3 2
c new copyright notice
e
s 00016/00005/00055
d D 1.2 89/02/14 17:18:32 bostic 2 1
c add Berkeley specific copyright notice, remove subsection notation
e
s 00060/00000/00000
d D 1.1 85/07/30 21:55:24 sklower 1 0
c date and time created 85/07/30 21:55:24 by sklower
e
u
U
t
T
I 1
D 2
.\" Copyright (c) 1985 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 2
I 2
D 4
.\" Copyright (c) 1985 The Regents of the University of California.
E 4
I 4
D 5
.\" Copyright (c) 1985, 1991 The Regents of the University of California.
E 4
.\" All rights reserved.
E 5
I 5
.\" Copyright (c) 1985, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 5
E 2
.\"
I 2
D 3
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 3
I 3
.\" %sccs.include.redist.man%
E 3
.\"
E 2
D 4
.\"	%W% (Berkeley) %G%
E 4
I 4
.\"     %W% (Berkeley) %G%
E 4
.\"
D 2
.TH NSIP 4 "July 30, 1985"
E 2
I 2
D 4
.TH NSIP 4 "%Q%"
E 2
.UC 6
.SH NAME
nsip \- software network interface encapsulating ns packets in ip packets.
.SH SYNOPSIS
.B options NSIP
.br
.B #include <netns/ns_if.h>
.SH DESCRIPTION
E 4
I 4
.Dd %Q%
.Dt NSIP 4
.Os BSD 4.3
.Sh NAME
.Nm nsip
.Nd software network interface encapsulating NS packets in IP packets
.Sh SYNOPSIS
.Cd options NSIP
.Fd #include <netns/ns_if.h>
.Sh DESCRIPTION
E 4
The
D 4
.I nsip
E 4
I 4
.Nm nsip
E 4
interface is a software mechanism which may be
D 4
used to transmit Xerox NS(tm) packets through otherwise uncooperative
E 4
I 4
used to transmit Xerox
.Tn NS Ns (tm)
packets through otherwise uncooperative
E 4
networks.
D 4
It functions by prepending an IP header, and resubmitting the packet
through the unix IP machinery.
.LP
E 4
I 4
It functions by prepending an
.Tn IP
header, and resubmitting the packet
through the
.Tn UNIX
.Tn IP
machinery.
.Pp
E 4
The super-user can advise the operating system of a willing partner
D 4
by naming an IP address to be associated with an NS address.
E 4
I 4
by naming an
.Tn IP
address to be associated with an
.Tn NS
address.
E 4
Presently, only specific hosts pairs are allowed, and for each host
pair, an artificial point-to-point interface is constructed.
D 4
At some future date, IP broadcast addresses or hosts may be paired
with NS networks or hosts.
.LP
Specifically, a socket option of SO_NSIP_ROUTE is set on a socket
of family AF_NS, type SOCK_DGRAM, passing the following structure:
.nf

E 4
I 4
At some future date,
.Tn IP
broadcast addresses or hosts may be paired
with
.Tn NS
networks or hosts.
.Pp
Specifically, a socket option of
.Dv SO_NSIP_ROUTE
is set on a socket
of family
.Dv AF_NS ,
type
.Dv SOCK_DGRAM ,
passing the following structure:
.Bd -literal
E 4
struct nsip_req {
	struct sockaddr rq_ns;	/* must be ns format destination */
	struct sockaddr rq_ip;	/* must be ip format gateway */
	short rq_flags;
};
D 4

.SH DIAGNOSTICS
\fBnsip%d: can't handle af%d\fP.  The interface was handed
E 4
I 4
.Ed
.Sh DIAGNOSTICS
.Bl -diag
.It nsip%d: can't handle af%d.
The interface was handed
E 4
a message with addresses formatted in an unsuitable address
family; the packet was dropped.
D 4
.SH SEE ALSO
D 2
intro(4N), ns(4F)
E 2
I 2
intro(4), ns(4)
E 2
.SH BUGS
E 4
I 4
.El
.Sh SEE ALSO
.Xr intro 4 ,
.Xr ns 4
.Sh HISTORY
The
.Nm
interface appeared in
.Bx 4.3 .
.Sh BUGS
E 4
It is absurd to have a separate pseudo-device for each pt-to-pt
link.
D 4
There is no way to change the IP address for an NS host once the
E 4
I 4
There is no way to change the
.Tn IP
address for an
.Tn NS
host once the
E 4
D 6
the encapsulation interface is set up.
E 6
I 6
encapsulation interface is set up.
E 6
D 4
The request should honor flags of RTF_GATEWAY to indicate
remote networks, and the absence of RTF_UP should be a clue
E 4
I 4
The request should honor flags of
.Dv RTF_GATEWAY
to indicate
remote networks, and the absence of
.Dv RTF_UP
should be a clue
E 4
to remove that partner.
D 4
This was intended to postpone the necessity of rewriting reverse ARP
E 4
I 4
This was intended to postpone the necessity of rewriting reverse
.Tn ARP
E 4
for the 
D 4
.B en
device, and to allow passing XNS packets through an
E 4
I 4
.Xr en 4
device, and to allow passing
.Tn XNS
packets through an
E 4
Arpanet-Milnet gateway, to facilitate testing between some co-operating
universities.
E 1
