share/man/man4/SCCS/s.pty.4
h37993
s 00003/00000/00186
d D 8.3 94/12/08 23:16:27 mckusick 7 6
c add description of TIOCSIG
e
s 00001/00001/00185
d D 8.2 93/11/30 16:48:30 mckusick 6 5
c copy edit changes from Usenix
e
s 00002/00002/00184
d D 8.1 93/06/05 13:46:51 bostic 5 4
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00118/00082/00068
d D 6.3 91/03/28 00:46:11 cael 4 3
c macro and text revision (-mdoc version 3)
e
s 00037/00005/00113
d D 6.2 86/05/19 16:37:19 karels 3 2
c UCNTL crap, default units, rm fixed bugs
e
s 00001/00001/00117
d D 6.1 85/05/15 17:46:19 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00118/00000/00000
d D 5.1 85/05/15 17:46:13 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
D 4
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 4
I 4
D 5
.\" Copyright (c) 1983, 1991 Regents of the University of California.
.\" All rights reserved.
E 5
I 5
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 5
E 4
.\"
D 4
.\"	%W% (Berkeley) %G%
E 4
I 4
.\" %sccs.include.redist.man%
E 4
.\"
D 2
.TH PTY 4 "7 July 1983"
E 2
I 2
D 4
.TH PTY 4 "%Q%"
E 2
.UC 5
.SH NAME
pty \- pseudo terminal driver
.SH SYNOPSIS
D 3
.B pseudo-device pty
E 3
I 3
.B pseudo-device pty [ count ]
E 3
.SH DESCRIPTION
E 4
I 4
.\"     %W% (Berkeley) %G%
.\"
.Dd %Q%
.Dt PTY 4
.Os BSD 4.2
.Sh NAME
.Nm pty
.Nd pseudo terminal driver
.Sh SYNOPSIS
.Nm pseudo-device pty
.Op Ar count
.Sh DESCRIPTION
E 4
The
D 4
.I pty
E 4
I 4
.Xr pty
E 4
driver provides support for a device-pair termed a
D 4
.IR "pseudo terminal" .
E 4
I 4
.Em pseudo terminal .
E 4
A pseudo terminal is a pair of character devices, a
D 4
.I master
E 4
I 4
.Em master
E 4
device and a
D 4
.I slave
E 4
I 4
.Em slave
E 4
D 6
device.  The slave device provides processes
E 6
I 6
device.  The slave device provides to a process
E 6
an interface identical
to that described in
D 4
.IR tty (4).
E 4
I 4
.Xr tty 4 .
E 4
However, whereas all other devices which provide the 
interface described in
D 4
.IR tty (4)
E 4
I 4
.Xr tty 4
E 4
have a hardware device of some sort behind them, the slave
device has, instead, another process manipulating
it through the master half of the pseudo terminal.
That is, anything written on the master device is
given to the slave device as input and anything written
on the slave device is presented as input on the master
device.
D 4
.PP
D 3
In configuring, if no optional ``count'' is given in
the specification, 16 pseudo terminal pairs are configured.
E 3
I 3
In configuring, if an optional ``count'' is given in
E 4
I 4
.Pp
In configuring, if an optional
.Ar count
is given in
E 4
the specification, that number of pseudo terminal pairs are configured;
the default count is 32.
E 3
D 4
.PP
E 4
I 4
.Pp
E 4
The following 
D 4
.I ioctl
E 4
I 4
.Xr ioctl 2
E 4
calls apply only to pseudo terminals:
D 4
.TP
TIOCSTOP
Stops output to a terminal (e.g. like typing ^S).  Takes
E 4
I 4
.Bl -tag -width TIOCREMOTE
.It Dv TIOCSTOP
Stops output to a terminal (e.g. like typing
.Ql ^S ) .
Takes
E 4
no parameter.
D 4
.TP
TIOCSTART
Restarts output (stopped by TIOCSTOP or by typing ^S).
E 4
I 4
.It Dv TIOCSTART
Restarts output (stopped by
.Dv TIOCSTOP
or by typing
.Ql ^S ) .
E 4
Takes no parameter.
I 7
.Dv TIOCSIG
Sends the specified signal to the process group members of the 
pseudo terminal that have it as their controlling terminal.
E 7
D 4
.TP
TIOCPKT
E 4
I 4
.It Dv TIOCPKT
E 4
Enable/disable 
D 4
.I packet
E 4
I 4
.Em packet
E 4
mode.  Packet mode is enabled by specifying (by reference)
a nonzero parameter and disabled by specifying (by reference)
a zero parameter.  When applied to the master side of a pseudo
terminal, each subsequent 
D 4
.I read 
E 4
I 4
.Xr read
E 4
from the terminal will return data written on the slave part of
the pseudo terminal preceded by a zero byte (symbolically
D 4
defined as TIOCPKT_DATA), or a single byte reflecting control
E 4
I 4
defined as
.Dv TIOCPKT_DATA ) ,
or a single byte reflecting control
E 4
status information.  In the latter case, the byte is an inclusive-or
of zero or more of the bits:
D 4
.RS
.TP
TIOCPKT_FLUSHREAD
E 4
I 4
.Bl -tag -width TIOCPKT_FLUSHWRITE
.It Dv TIOCPKT_FLUSHREAD
E 4
whenever the read queue for the terminal is flushed.
D 4
.TP
TIOCPKT_FLUSHWRITE
E 4
I 4
.It Dv TIOCPKT_FLUSHWRITE
E 4
whenever the write queue for the terminal is flushed.
D 4
.TP
TIOCPKT_STOP
whenever output to the terminal is stopped a la ^S.
.TP
TIOCPKT_START
E 4
I 4
.It Dv TIOCPKT_STOP
whenever output to the terminal is stopped a la
.Ql ^S .
.It Dv TIOCPKT_START
E 4
whenever output to the terminal is restarted.
D 4
.TP
TIOCPKT_DOSTOP
E 4
I 4
.It Dv TIOCPKT_DOSTOP
E 4
whenever 
D 4
.I t_stopc
is ^S
E 4
I 4
.Em t_stopc
is
.Ql ^S
E 4
and 
D 4
.I t_startc
is ^Q.
.TP
TIOCPKT_NOSTOP
whenever the start and stop characters are not ^S/^Q.
.RE
.IP
E 4
I 4
.Em t_startc
is
.Ql ^Q .
.It Dv TIOCPKT_NOSTOP
whenever the start and stop characters are not
.Ql ^S/^Q .
.Pp
E 4
I 3
While this mode is in use, the presence of control status information
to be read from the master side may be detected by a
D 4
.I select
E 4
I 4
.Xr select 2
E 4
for exceptional conditions.
D 4
.IP
E 4
I 4
.Pp
E 4
E 3
This mode is used by
D 4
.IR rlogin (1C)
E 4
I 4
.Xr rlogin 1
E 4
and
D 4
.IR rlogind (8C)
to implement a remote-echoed, locally ^S/^Q flow-controlled
E 4
I 4
.Xr rlogind 8
to implement a remote-echoed, locally
.Ql ^S/^Q
flow-controlled
E 4
remote login with proper back-flushing of output; it can be
used by other similar programs.
D 4
.TP
I 3
TIOCUCNTL
E 4
I 4
.El
.It Dv TIOCUCNTL
E 4
Enable/disable a mode that allows a small number of simple user
D 4
.I ioctl
E 4
I 4
.Xr ioctl
E 4
commands to be passed through the pseudo-terminal,
D 4
using a protocol similar to that of TIOCPKT.
The TIOCUCNTL and TIOCPKT modes are mutually exclusive.
E 4
I 4
using a protocol similar to that of
.Dv TIOCPKT .
The
.Dv TIOCUCNTL
and
.Dv TIOCPKT
modes are mutually exclusive.
E 4
This mode is enabled from the master side of a pseudo terminal
by specifying (by reference)
a nonzero parameter and disabled by specifying (by reference)
a zero parameter.
Each subsequent 
D 4
.I read 
E 4
I 4
.Xr read
E 4
from the master side will return data written on the slave part of
the pseudo terminal preceded by a zero byte,
or a single byte reflecting a user control operation on the slave side.
A user control command consists of a special
D 4
.I ioctl
operation with no data; the command is given as UIOCCMD(\fIn\fP),
where \fIn\fP is a number in the range 1-255.
The operation value \fIn\fP will be received as a single byte on the next
.I read
E 4
I 4
.Xr ioctl
operation with no data; the command is given as
.Dv UIOCCMD Ns (n) ,
where
.Ar n
is a number in the range 1-255.
The operation value
.Ar n
will be received as a single byte on the next
.Xr read
E 4
from the master side.
D 4
The \fIioctl\fP UIOCCMD(0) is a no-op that may be used to probe for
E 4
I 4
The
.Xr ioctl
.Dv UIOCCMD Ns (0)
is a no-op that may be used to probe for
E 4
the existence of this facility.
D 4
As with TIOCPKT mode, command operations may be detected with a
.I select
E 4
I 4
As with
.Dv TIOCPKT
mode, command operations may be detected with a
.Xr select
E 4
for exceptional conditions.
D 4
.TP
E 3
TIOCREMOTE
E 4
I 4
.It Dv TIOCREMOTE
E 4
A mode for the master half of a pseudo terminal, independent
D 4
of TIOCPKT.  This mode causes input to the pseudo terminal
E 4
I 4
of
.Dv TIOCPKT .
This mode causes input to the pseudo terminal
E 4
to be flow controlled and not input edited (regardless of the
terminal mode).  Each write to the control terminal produces
a record boundary for the process reading the terminal.  In
normal usage, a write of data is like the data typed as a line
on the terminal; a write of 0 bytes is like typing an end-of-file
D 4
character.  TIOCREMOTE can be used when doing remote line
E 4
I 4
character.
.Dv TIOCREMOTE
can be used when doing remote line
E 4
editing in a window manager, or whenever flow controlled input
is required.
D 4
.SH FILES
.DT
/dev/pty[p-r][0-9a-f]	master pseudo terminals
.br
/dev/tty[p-r][0-9a-f]	slave pseudo terminals
.SH DIAGNOSTICS
E 4
I 4
.El
.Sh FILES
.Bl -tag -width /dev/tty[p-r][0-9a-f]x -compact
.It Pa /dev/pty[p-r][0-9a-f]
master pseudo terminals
.It Pa /dev/tty[p-r][0-9a-f]
slave pseudo terminals
.El
.Sh DIAGNOSTICS
E 4
None.
I 4
.Sh HISTORY
The
.Nm
driver appeared in
.Bx 4.2 .
E 4
D 3
.SH BUGS
It is not possible to send an EOT.
E 3
E 1
