share/man/man4/SCCS/s.udp.4
h02867
s 00002/00002/00109
d D 8.1 93/06/05 13:47:59 bostic 7 6
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00080/00046/00031
d D 6.5 91/03/28 00:46:17 cael 6 5
c macro and text revision (-mdoc version 3)
e
s 00001/00011/00076
d D 6.4 90/06/23 18:04:15 trent 5 4
c new copyright notice
e
s 00017/00006/00070
d D 6.3 89/02/14 17:18:37 bostic 4 3
c add Berkeley specific copyright notice, remove subsection notation
e
s 00004/00004/00072
d D 6.2 86/05/16 15:53:15 karels 3 2
c options, updates
e
s 00001/00001/00075
d D 6.1 85/05/15 17:51:15 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00076/00000/00000
d D 5.1 85/05/15 17:51:06 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
D 4
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 4
I 4
D 6
.\" Copyright (c) 1983 The Regents of the University of California.
E 6
I 6
D 7
.\" Copyright (c) 1983, 1991 The Regents of the University of California.
E 6
.\" All rights reserved.
E 7
I 7
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 7
E 4
.\"
I 4
D 5
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 5
I 5
.\" %sccs.include.redist.man%
E 5
.\"
E 4
D 6
.\"	%W% (Berkeley) %G%
E 6
I 6
.\"     %W% (Berkeley) %G%
E 6
.\"
D 2
.TH UDP 4P "25 March 1982"
E 2
I 2
D 4
.TH UDP 4P "%Q%"
E 4
I 4
D 6
.TH UDP 4 "%Q%"
E 4
E 2
.UC 5
.SH NAME
udp \- Internet User Datagram Protocol
.SH SYNOPSIS
.B #include <sys/socket.h>
.br
.B #include <netinet/in.h>
.PP
.B s = socket(AF_INET, SOCK_DGRAM, 0);
.SH DESCRIPTION
UDP is a simple, unreliable datagram protocol which is used
to support the SOCK_DGRAM abstraction for the Internet
protocol family.  UDP sockets are connectionless, and are
E 6
I 6
.Dd %Q%
.Dt UDP 4
.Os BSD 4.2
.Sh NAME
.Nm udp
.Nd Internet User Datagram Protocol
.Sh SYNOPSIS
.Fd #include <sys/socket.h>
.Fd #include <netinet/in.h>
.Ft int
.Fn socket AF_INET SOCK_DGRAM 0
.Sh DESCRIPTION
.Tn UDP
is a simple, unreliable datagram protocol which is used
to support the
.Dv SOCK_DGRAM
abstraction for the Internet
protocol family.
.Tn UDP
sockets are connectionless, and are
E 6
normally used with the
D 6
.I sendto 
E 6
I 6
.Xr sendto
E 6
and
D 6
.IR recvfrom 
E 6
I 6
.Xr recvfrom
E 6
calls, though the
D 6
.IR connect (2)
E 6
I 6
.Xr connect 2
E 6
call may also be used to fix the destination for future
packets (in which case the 
D 6
.IR recv (2)
E 6
I 6
.Xr recv 2
E 6
or
D 6
.IR read (2)
E 6
I 6
.Xr read 2
E 6
and 
D 6
.IR send (2)
E 6
I 6
.Xr send 2
E 6
or
D 6
.IR write(2)
E 6
I 6
.Xr write 2
E 6
system calls may be used).
D 6
.PP
UDP address formats are identical to those used by
TCP. In particular UDP provides a port identifier in addition
to the normal Internet address format.  Note that the UDP port
space is separate from the TCP port space (i.e. a UDP port
may not be \*(lqconnected\*(rq to a TCP port).  In addition broadcast
E 6
I 6
.Pp
.Tn UDP
address formats are identical to those used by
.Tn TCP .
In particular
.Tn UDP
provides a port identifier in addition
to the normal Internet address format.  Note that the
.Tn UDP
port
space is separate from the
.Tn TCP
port space (i.e. a
.Tn UDP
port
may not be
.Dq connected
to a
.Tn TCP
port).  In addition broadcast
E 6
packets may be sent (assuming the underlying network supports
D 6
this) by using a reserved \*(lqbroadcast address\*(rq; this address
E 6
I 6
this) by using a reserved
.Dq broadcast address ;
this address
E 6
is network interface dependent.
I 3
D 6
.PP
Options at the IP transport level may be used with UDP; see
D 4
.IR ip (4P).
E 4
I 4
.IR ip (4).
E 4
E 3
.SH DIAGNOSTICS
E 6
I 6
.Pp
Options at the
.Tn IP
transport level may be used with
.Tn UDP ;
see
.Xr ip 4 .
.Sh DIAGNOSTICS
E 6
A socket operation may fail with one of the following errors returned:
D 6
.TP 15
[EISCONN]
E 6
I 6
.Bl -tag -width [EADDRNOTAVAIL]
.It Bq Er EISCONN
E 6
when trying to establish a connection on a socket which
already has one, or when trying to send a datagram with the destination
address specified and the socket is already connected;
D 6
.TP 15
[ENOTCONN]
E 6
I 6
.It Bq Er ENOTCONN
E 6
when trying to send a datagram, but
no destination address is specified, and the socket hasn't been
connected;
D 6
.TP 15
[ENOBUFS]
E 6
I 6
.It Bq Er ENOBUFS
E 6
when the system runs out of memory for
an internal data structure;
D 6
.TP 15
[EADDRINUSE]
E 6
I 6
.It Bq Er EADDRINUSE
E 6
when an attempt
is made to create a socket with a port which has already been
allocated;
D 6
.TP 15
[EADDRNOTAVAIL]
E 6
I 6
.It Bq Er EADDRNOTAVAIL
E 6
when an attempt is made to create a 
socket with a network address for which no network interface
exists.
D 6
.SH SEE ALSO
D 3
send(2),
recv(2),
intro(4N),
inet(4F)
E 3
I 3
D 4
getsockopt(2), recv(2), send(2), socket(2), intro(4N), inet(4F), ip(4P)
E 4
I 4
getsockopt(2), recv(2), send(2), socket(2), intro(4), inet(4), ip(4)
E 6
I 6
.El
.Sh SEE ALSO
.Xr getsockopt 2 ,
.Xr recv 2 ,
.Xr send 2 ,
.Xr socket 2 ,
.Xr intro 4 ,
.Xr inet 4 ,
.Xr ip 4
.Sh HISTORY
The
.Nm
protocol appeared in
.Bx 4.2 .
E 6
E 4
E 3
E 1
