usr.bin/ul/SCCS/s.ul.1
h41264
s 00002/00002/00079
d D 8.1 93/06/06 16:39:40 bostic 7 6
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00061/00040/00020
d D 6.3 91/04/23 16:40:24 bostic 6 4
c mdoc version three/bsd copyright
e
s 00001/00003/00057
d R 6.3 91/04/18 18:30:22 bostic 5 4
c new copyright; att/bsd/shared
e
s 00000/00010/00060
d D 6.2 86/05/07 13:28:34 mckusick 4 3
c delete author history
e
s 00001/00001/00069
d D 6.1 85/04/29 15:06:01 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00002/00002/00068
d D 5.1 85/04/29 15:05:47 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00070/00000/00000
d D 4.1 85/04/29 15:05:35 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
D 6
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 6
I 6
D 7
.\" Copyright (c) 1980, 1991 Regents of the University of California.
.\" All rights reserved.
E 7
I 7
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 7
E 6
.\"
D 6
.\"	%W% (Berkeley) %G%
E 6
I 6
.\" %sccs.include.redist.man%
E 6
.\"
D 2
.TH UL 1
E 2
I 2
D 3
.TH UL 1 "18 January 1983"
E 3
I 3
D 6
.TH UL 1 "%Q%"
E 3
E 2
.UC 4
.SH NAME
ul \- do underlining
.SH SYNOPSIS
.B ul
[
.B \-i
] [
.B \-t
.I terminal
]
[
.I name
\&...
]
.SH DESCRIPTION
.I Ul
E 6
I 6
.\"     %W% (Berkeley) %G%
.\"
.Dd %Q%
.Dt UL 1
.Os BSD 4
.Sh NAME
.Nm ul
.Nd do underlining
.Sh SYNOPSIS
.Nm ul
.Op Fl i
.Op Fl t Ar terminal
.Op Ar name Ar ...
.Sh DESCRIPTION
.Nm Ul
E 6
reads the named files (or standard input if none are given)
D 2
and translates occurances of underscores to the sequence
E 2
I 2
and translates occurrences of underscores to the sequence
E 2
which indicates underlining for the terminal in use, as specified
by the environment variable
D 6
TERM.
The
.B \-t
option overrides the terminal kind specified in the environment.
E 6
I 6
.Ev TERM .
E 6
The file
D 6
.I /etc/termcap
E 6
I 6
.Pa /etc/termcap
E 6
is read to determine the appropriate sequences for underlining.
If the terminal is incapable of underlining, but is capable of
a standout mode then that is used instead.
If the terminal can overstrike,
or handles underlining automatically,
D 6
.I ul
E 6
I 6
.Nm ul
E 6
degenerates to
D 6
.IR cat (1).
E 6
I 6
.Xr cat 1 .
E 6
If the terminal cannot underline, underlining is ignored.
D 6
.PP
The
.B \-i
option causes
.I ul
to indicate underlining onto by a separate line containing appropriate
E 6
I 6
.Pp
The following options are available:
.Bl -tag -width Ds
.It Fl i
Underlining is indicated by a separate line containing appropriate
E 6
dashes `\-'; this is useful when you want to look at the underlining
which is present in an
D 6
.I nroff
E 6
I 6
.Xr nroff
E 6
output stream on a crt-terminal.
D 6
.SH "SEE ALSO"
man(1), nroff(1), colcrt(1)
D 4
.SH AUTHOR
Mark Horton wrote
.IR ul .
The
.B \-i
option was originally a option of the editor
.IR ex (1),
then an
.I iul
command.
E 4
.SH BUGS
.I Nroff
E 6
I 6
.It Fl t Ar terminal
Overrides the terminal type specified in the environment with
.Ar terminal .
.El
.Sh ENVIRONMENT
The following environment variable is used:
.Bl -tag -width TERM
.It Ev TERM
The
.Ev TERM
variable is used to relate a tty device
with its device capability description (see
.Xr termcap 5 ) .
.Ev TERM
is set at login time, either by the default terminal type
specified in
.Pa /etc/ttys
or as set during the login process by the user in their
.Pa login
file (see
.Xr setenv 1 ) . 
.El
.Sh SEE ALSO
.Xr man 1 ,
.Xr nroff 1 ,
.Xr colcrt 1
.Sh BUGS
.Xr Nroff
E 6
usually outputs a series of backspaces and underlines intermixed
with the text to indicate underlining.  No attempt is made to optimize
the backward motion.
I 6
.Sh HISTORY
The
.Nm
command appeared in
.Bx 3.0 .
E 6
E 1
