sbin/mount_lfs/SCCS/s.mount_lfs.8
h36504
s 00007/00006/00092
d D 8.5 94/03/30 06:44:48 bostic 6 5
c prettiness police
e
s 00032/00000/00066
d D 8.4 94/03/30 06:18:04 bostic 5 4
c add LFS references
e
s 00035/00029/00031
d D 8.3 94/03/27 09:06:31 bostic 4 3
c Jan-Simon Pendry's and my new mount code
e
s 00002/00002/00058
d D 8.2 93/12/11 23:43:12 mckusick 3 2
c copyediting for Usenix manuals
e
s 00002/00002/00058
d D 8.1 93/06/08 19:13:34 bostic 2 1
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00060/00000/00000
d D 5.1 93/06/08 18:48:13 bostic 1 0
c date and time created 93/06/08 18:48:13 by bostic
e
u
U
t
T
I 1
D 2
.\" Copyright (c) 1993 The Regents of the University of California.
.\" All rights reserved.
E 2
I 2
D 4
.\" Copyright (c) 1993
E 4
I 4
.\" Copyright (c) 1993, 1994
E 4
.\"	The Regents of the University of California.  All rights reserved.
E 2
.\"
.\" %sccs.include.redist.roff%
.\"
.\"	%W% (Berkeley) %G%
.\"
.Dd "%Q%"
.Dt MOUNT_LFS 8
.Os BSD 4.4
.Sh NAME
.Nm mount_lfs
.Nd mount a log-structured file system
.Sh SYNOPSIS
.Nm mount_lfs
.Op Fl dns
D 4
.Op Fl F fsoptions
.Pa device
.Pa mount_point
E 4
I 4
.Op Fl o Ar options
.Ar special
.Ar node
E 4
.Sh DESCRIPTION
The
.Nm mount_lfs
D 3
command attaches the log-structed file system
E 3
I 3
D 4
command attaches the log-structured file system
E 3
residing on the device named by
.Ar device
to the global file system namespace.
The file system is attached at the point
specified by
.Ar mount_point .
E 4
I 4
command attaches a log-structured file system
.Ar special
device on to the file system tree at the point
.Ar node .
In addition, the
.Xr lfs_cleanerd 8
utility is invoked to clean the file system periodically.
.Pp
E 4
This command is normally executed by
.Xr mount 8
at boot time.
.Pp
D 4
After the file system is mounted, if the
.Fl n
flag is not specified then the
E 4
I 4
The options are as follows:
.Bl -tag -width Ds
.It Fl d
Run
E 4
.Xr lfs_cleanerd 8
D 4
program is invoked to clean the file system periodically.
If the
.Fl d
or
.Fl s
flags are given to
.Nm mount_lfs ,
they are passed to the cleaner.
E 4
I 4
in debug mode.
.It Fl o
Options are specified with a
.Fl o
flag followed by a comma separated string of options.
See the
.Xr mount 8
man page for possible options and their meanings.
.It Fl n
Don't start
.Xr lfs_cleanerd 8
on the file system.
.It Fl s
Cause
.Xr lfs_cleanerd 8
to read data in small chunks when cleaning the file system.
.El
E 4
.Sh SEE ALSO
.Xr mount 2 ,
.Xr unmount 2 ,
.Xr fstab 5 ,
D 4
.Xr lfs_cleanerd 8
.Sh CAVEATS
.Nm Mount_lfs
can be run by hand if you wish to use
the flags, and since the flags are useful
mainly for debugging this doesn't make much
of a difference in normal operation.
E 4
I 4
.Xr lfs_cleanerd 8 ,
.Xr mount 8
I 5
.sp
.Rs
.%A Ousterhout and Douglis
.%D 1989
.%T "Beating the I/O Bottleneck: A Case for Log-structured File Systems"
.%J "Operating Systems Review"
.%V Vol. 23
.%N No. 1
.%P pp. 11-27
.%O "also available as Technical Report UCB/CSD 88/467"
.Re
.Rs
.%A Rosenblum and Ousterhout
.%D 1991
.%T "The Design and Implementation of a Log-Structured File System"
.%J "ACM SIGOPS Operating Systems Review"
.%V Vol. 25
.%N No. 5
.Re
.Rs
I 6
.%A Seltzer
.%D 1992
.%T "File System Performance and Transaction Support"
.%B "PhD Thesis, University of California, Berkeley"
.%O "also available as Technical Report UCB/ERL M92"
.Re
.Rs
E 6
.%A Seltzer, Bostic, McKusick and Staelin
.%D 1993
.%T "An Implementation of a Log-Structured File System for UNIX"
.%J "Proc. of the Winter 1993 USENIX Conf."
.%P pp. 315-331
D 6
.Re
.Rs
.%A Seltzer
.%D 1993
.%T "File System Performance and Transaction Support"
.%O "PhD Thesis, University of California, Berkeley"
E 6
.Re
E 5
E 4
.Sh HISTORY
The
D 3
.Nm sysconf
E 3
I 3
.Nm mount_lfs
E 3
function first appeared in 4.4BSD.
E 1
