usr.sbin/arp/SCCS/s.arp.8
h61161
s 00000/00005/00096
d D 8.2 95/04/27 16:27:12 bostic 8 7
c arp(8) no longer supports trailers.  No point in claiming to...
c From: Charles Hannum <mycroft@NetBSD.ORG>
e
s 00002/00002/00099
d D 8.1 93/06/06 13:50:27 bostic 7 6
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00001/00009/00100
d D 6.6 93/02/25 15:37:31 torek 6 5
c no longer works on crash dumps; rm obsolete man page allusions
e
s 00085/00078/00024
d D 6.5 91/03/16 18:11:40 cael 5 4
c macro and text revision (-mdoc version 3)
e
s 00001/00011/00101
d D 6.4 90/06/24 22:11:20 trent 4 3
c new copyright notice
e
s 00016/00005/00096
d D 6.3 88/09/19 21:08:32 bostic 3 2
c Berkeley copyright
e
s 00016/00006/00085
d D 6.2 86/05/20 16:39:51 karels 2 1
c updates, trailers
e
s 00091/00000/00000
d D 6.1 85/04/27 16:14:37 mckusick 1 0
c manual page first distributed with 4.3BSD
e
u
U
t
T
I 1
D 3
.\" Copyright (c) 1985 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 3
I 3
D 5
.\" Copyright (c) 1985 The Regents of the University of California.
E 5
I 5
D 7
.\" Copyright (c) 1985, 1991 The Regents of the University of California.
E 5
.\" All rights reserved.
E 7
I 7
.\" Copyright (c) 1985, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 7
E 3
.\"
I 3
D 4
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 4
I 4
.\" %sccs.include.redist.man%
E 4
.\"
E 3
D 5
.\"	%W% (Berkeley) %G%
E 5
I 5
.\"     %W% (Berkeley) %G%
E 5
.\"
D 3
.TH ARP 8C "%Q%"
E 3
I 3
D 5
.TH ARP 8 "%Q%"
E 3
.UC 6
.SH NAME
arp \- address resolution display and control
.SH SYNOPSIS
.B arp
.I hostname
.br
.B arp -a
[
.I vmunix
] [
.I kmem
]
.br
.B arp -d
.I hostname
.br
.B arp -s
.I hostname ether_addr
[
.B temp
] [
.B pub
I 2
] [
.B trail
E 2
]
.br
.B arp -f
.I filename
.SH DESCRIPTION
E 5
I 5
.Dd %Q%
.Dt ARP 8
.Os BSD 4.3
.Sh NAME
.Nm arp
.Nd address resolution display and control
.Sh SYNOPSIS
.Nm arp
.Ar hostname
.Nm arp
.Fl a
D 6
.Op Ar vmunix
.Op Ar kmem
E 6
.Nm arp
.Fl d Ar hostname
.Nm arp
.Fl s Ar hostname ether_addr
.Op Ar temp
.Op Ar pub
D 8
.Op Ar trail
E 8
.Nm arp
.Fl f Ar filename
.Sh DESCRIPTION
E 5
The
D 5
.I arp
E 5
I 5
.Nm arp
E 5
program displays and modifies the Internet-to-Ethernet address translation
D 2
tables used by the address resolution protocol (
.IR arp (4p)).
E 2
I 2
tables used by the address resolution protocol
D 5
.RI ( arp (4p)).
E 2
.LP
With no flags, the program displays the current ARP entry for
.I hostname.
E 5
I 5
.Pq Xr arp 4 .
With no flags, the program displays the current
.Tn ARP
entry for
.Ar hostname .
E 5
I 2
The host may be specified by name or by number,
using Internet dot notation.
E 2
D 5
With the
.B -a
flag, the program displays all of the current ARP entries by reading the table
E 5
I 5
.Pp
Available options:
.Bl -tag -width Ds
.It Fl a
The program displays all of the current
.Tn ARP
D 6
entries by reading the table
E 5
from the file
D 5
.I kmem
E 5
I 5
.Ar kmem
E 5
(default /dev/kmem) based on the kernel file 
D 5
.I vmunix 
(default /vmunix).
.LP
With the
.B -d
flag, a super-user may delete an entry for the host called
.I hostname.
.LP
The
.B -s
flag is given to create an ARP entry for the host called
.I hostname
E 5
I 5
.Ar vmunix
(default
.Pa /vmunix ) .
E 6
I 6
entries.
E 6
.It Fl d
A super-user may delete an entry for the host called
.Ar hostname
with the
.Fl d
flag.
.It Fl s Ar hostname ether_addr
Create an
.Tn ARP
entry for the host called
.Ar hostname
E 5
with the Ethernet address 
D 5
.I ether_addr.
E 5
I 5
.Ar ether_addr .
E 5
The Ethernet address is given as six hex bytes separated by colons.
The entry will be permanent unless the word
D 5
.B temp
E 5
I 5
.Ar temp
E 5
is given in the command. 
If the word
D 5
.B pub
E 5
I 5
.Ar pub
E 5
D 2
is given, the entry will be "published", e.g., this system will
respond to ARP requests for 
E 2
I 2
is given, the entry will be "published"; i.e., this system will
D 5
act as an ARP server,
E 5
I 5
act as an
.Tn ARP
server,
E 5
responding to requests for 
E 2
D 5
.I hostname
E 5
I 5
.Ar hostname
E 5
D 2
even though the hostname is not its own.
E 2
I 2
even though the host address is not its own.
D 8
The word
D 5
.B trail
E 5
I 5
.Ar trail
E 5
indicates that trailer encapsulations may be sent to this host.
E 8
E 2
D 5
.LP
The 
.B -f
flag causes the file
.I filename
to be read and multiple entries to be set in the ARP tables.  Entries
E 5
I 5
.It Fl f
Causes the file
.Ar filename
to be read and multiple entries to be set in the
.Tn ARP
tables.  Entries
E 5
in the file should be of the form
D 5
.IP
.I hostname ether_addr
[
.B temp
] [
.B pub
I 2
] [
.B trail
E 2
]
.LP
E 5
I 5
.Pp
.Bd -filled -offset indent -compact
.Ar hostname ether_addr
.Op Ar temp
.Op Ar pub
D 8
.Op Ar trail
E 8
.Ed
.Pp
E 5
with argument meanings as given above.
D 5
.SH "SEE ALSO"
D 2
arp(4p), ifconfig(8c)
E 2
I 2
D 3
inet(3N), arp(4P), ifconfig(8C)
E 3
I 3
inet(3), arp(4), ifconfig(8)
E 5
I 5
.El
.Sh SEE ALSO
.Xr inet 3 ,
.Xr arp 4 ,
.Xr ifconfig 8
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.3 .
E 5
E 3
E 2
E 1
