sbin/nologin/SCCS/s.nologin.8
h57023
s 00000/00000/00028
d D 8.1 93/06/19 09:16:33 bostic 2 1
c 4.4BSD snapshot (revision 8.1)
e
s 00028/00000/00000
d D 5.1 93/06/19 09:16:30 bostic 1 0
c date and time created 93/06/19 09:16:30 by bostic
e
u
U
t
T
I 1
.\" Copyright (c) 1993
.\"	The Regents of the University of California.  All rights reserved.
.\"
.\" %sccs.include.redist.man%
.\"
.\"     %W% (Berkeley) %G%
.\"
.Dd %Q%
.Dt NOLOGIN 8
.Os BSD 4.4
.Sh NAME
.Nm nologin
.Nd politely refuse a login 
.Sh SYNOPSIS
.Nm nologin
.Sh DESCRIPTION
.Nm Nologin
displays a message that an account is not available and
exits non-zero.
It is intended as a replacement shell field for accounts that
have been disabled.
.Sh SEE ALSO
.Xr login 1
.Sh HISTORY
The
.Nm nologin
command appeared in
.Bx 4.4 .
E 1
