sbin/ifconfig/SCCS/s.ifconfig.8
h05762
s 00002/00000/00249
d D 8.4 94/06/01 20:38:01 ah 20 19
c page breaks for 4.4BSD manuals
e
s 00001/00001/00248
d D 8.3 94/01/05 12:08:31 mckusick 19 18
c grammer
e
s 00003/00003/00246
d D 8.2 93/12/11 23:43:09 mckusick 18 17
c copyediting for Usenix manuals
e
s 00002/00002/00247
d D 8.1 93/06/05 10:59:10 bostic 17 16
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00002/00002/00247
d D 6.15 92/02/12 13:02:36 sklower 16 15
c change -llc flags to -link flags
e
s 00007/00000/00242
d D 6.14 91/10/16 16:31:04 william 15 14
c added description of new LLC options.
e
s 00179/00147/00063
d D 6.13 91/03/16 17:07:36 cael 14 13
c macro and text revision (-mdoc version 3)
e
s 00003/00013/00207
d D 6.12 90/06/24 21:38:46 trent 13 12
c new copyright & pathname (ifconfig)
e
s 00003/00003/00217
d D 6.11 90/06/12 17:29:38 sklower 12 11
c changed my mind.  Ifconfig should set NSAP not NET
e
s 00001/00001/00219
d D 6.10 90/06/07 16:18:37 sklower 11 10
c minor typo
e
s 00019/00009/00201
d D 6.9 90/06/07 16:14:52 sklower 10 9
c mostly remove ISO references from ``ipdst'' option;
c (refer to eon(5) instead); explain nsellength and NET.
e
s 00001/00001/00209
d D 6.8 90/02/13 09:39:18 karels 9 8
c typo
e
s 00026/00005/00184
d D 6.7 89/04/22 13:13:07 sklower 8 7
c document aliasing; ISO/IP encapsulation
e
s 00016/00005/00173
d D 6.6 88/09/19 21:27:58 bostic 7 6
c Berkeley copyright
e
s 00001/00001/00177
d D 6.5 87/09/30 08:06:02 bostic 6 5
c dstaddr to dest_address; bug report 4.3BSD/man/21
e
s 00030/00015/00148
d D 6.4 86/05/22 20:35:14 karels 5 4
c 
e
s 00041/00008/00122
d D 6.3 86/02/06 16:55:12 karels 4 3
c add metric, update netmask
e
s 00045/00002/00085
d D 6.2 85/09/16 17:54:20 sklower 3 2
c more xns support
e
s 00012/00003/00075
d D 6.1 85/04/27 14:59:07 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00078/00000/00000
d D 5.1 85/04/27 14:58:46 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
D 7
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 7
I 7
D 14
.\" Copyright (c) 1983 The Regents of the University of California.
E 14
I 14
D 17
.\" Copyright (c) 1983, 1991 The Regents of the University of California.
E 14
.\" All rights reserved.
E 17
I 17
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 17
E 7
.\"
I 7
D 13
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 13
I 13
.\" %sccs.include.redist.man%
E 13
.\"
E 7
D 14
.\"	%W% (Berkeley) %G%
E 14
I 14
.\"     %W% (Berkeley) %G%
E 14
.\"
D 2
.TH IFCONFIG 8C "28 August 1983"
E 2
I 2
D 7
.TH IFCONFIG 8C "%Q%"
E 7
I 7
D 14
.TH IFCONFIG 8 "%Q%"
E 7
E 2
.UC 5
.SH NAME
ifconfig \- configure network interface parameters
D 9
.SH SYOPNSIS
E 9
I 9
.SH SYNOPSIS
E 9
D 13
.B /etc/ifconfig
E 13
I 13
.B ifconfig
E 13
D 3
interface
E 3
I 3
interface address_family
E 3
[
.I address
D 2
] [
E 2
I 2
[
.I dest_address
] ] [
E 2
.I parameters
]
I 3
.br
D 13
.B /etc/ifconfig
E 13
I 13
.B ifconfig
E 13
interface
[
protocol_family
]
E 3
.SH DESCRIPTION
.I Ifconfig
E 14
I 14
.Dd %Q%
.Dt IFCONFIG 8
.Os BSD 4.2
.Sh NAME
.Nm ifconfig
.Nd configure network interface parameters
.Sh SYNOPSIS
.Nm ifconfig
.Ar interface address_family
.Oo
.Ar address
.Op Ar dest_address
.Oc
.Op Ar parameters
.Nm ifconfig
.Ar interface
.Op Ar protocol_family
.Sh DESCRIPTION
.Nm Ifconfig
E 14
is used to assign an address
to a network interface and/or configure
network interface parameters.
D 14
.I Ifconfig
E 14
I 14
.Nm Ifconfig
E 14
must be used at boot time to define the network address
of each interface present on a machine; it may also be used at
D 5
a later time to redefine an interface's address.  The
E 5
I 5
a later time to redefine an interface's address
D 14
or other operating parameters.  The
E 5
.I interface
D 3
parameter is a string of the form ``name unit'', e.g. ``en0'', while
E 3
I 3
parameter is a string of the form ``name unit'', e.g. ``en0''.
.LP
Since an interface may receive transmissions in differing protocols,
D 5
each of which may required separate naming schemes, it is necessary
E 5
I 5
each of which may require separate naming schemes, it is necessary
E 5
to specify the
D 5
.IR protocol_family ,
E 5
I 5
.IR address_family ,
E 5
which may change the interpretation of the remaining parameters.
D 5
The address protocols current supported are ``inet'' and ``ns''.
E 5
I 5
D 8
The address families currently supported are ``inet'' and ``ns''.
E 8
I 8
The address families currently supported are ``inet'', ``iso'', and ``ns''.
E 8
E 5
.LP
For the DARPA-Internet family,
E 14
I 14
or other operating parameters.
.Pp
Available operands for
.Nm ifconfig:
.Bl -tag -width Ds
.It Ar Address
For the
.Tn DARPA-Internet
family,
E 14
E 3
the address is either a host name present in the host name data
base, 
D 14
.IR hosts (5),
or a DARPA Internet address expressed in the Internet standard
``dot notation''.
E 14
I 14
.Xr hosts 5 ,
or a
.Tn DARPA
Internet address expressed in the Internet standard
.Dq dot notation .
E 14
I 3
For the Xerox Network Systems(tm) family,
addresses are 
D 14
.IR net:a.b.c.d.e.f ,
E 14
I 14
.Ar net:a.b.c.d.e.f ,
E 14
where
D 14
.I net
E 14
I 14
.Ar net
E 14
is the assigned network number (in decimal),
D 5
and each of the six bytes are specified in hexadecimal.
E 5
I 5
and each of the six bytes of the host number,
D 14
.I a
E 14
I 14
.Ar a
E 14
through
D 14
.IR f ,
E 14
I 14
.Ar f ,
E 14
are specified in hexadecimal.
The host number may be omitted on 10Mb/s Ethernet interfaces,
which use the hardware physical address,
and on interfaces other than the first.
I 8
D 14
For the ISO family, addresses are specified as a long hexadecimal string,
E 14
I 14
For the
.Tn ISO
family, addresses are specified as a long hexadecimal string,
E 14
as in the Xerox family.  However, two consecutive dots imply a zero
byte, and the dots are optional, if the user wishes to (carefully)
count out long strings of digits in network byte order.
E 8
E 5
E 3
D 14
.PP
E 14
I 14
.It Ar address_family
Specifies the
.Ar address family
which affects interpretation of the remaining parameters.
Since an interface can receive transmissions in differing protocols
with different naming schemes, specifying the address family is recommeded.
The address or protocol families currently
supported are
.Dq inet ,
.Dq iso ,
and
.Dq ns .
.It Ar Interface
The
.Ar interface
parameter is a string of the form
.Dq name unit ,
for example,
.Dq en0 
.El
.Pp
E 14
The following parameters may be set with 
D 14
.IR ifconfig :
.TP 15
.B up
Mark an interface ``up''. 
I 4
This may be used to enable an interface after an ``ifconfig down.''
It happens automatically when setting the first address on an interface.
If the interface was reset when previously marked down,
the hardware will be re-initialized.
E 4
.TP 15
.B down
E 14
I 14
.Nm ifconfig :
.Bl -tag -width dest_addressxx
.It Cm alias
Establish an additional network address for this interface.
This is sometimes useful when changing network numbers, and
one wishes to accept packets addressed to the old interface.
.It Cm arp
Enable the use of the Address Resolution Protocol in mapping
between network level addresses and link level addresses (default).
This is currently implemented for mapping between
.Tn DARPA
Internet
addresses and 10Mb/s Ethernet addresses.
.It Fl arp
Disable the use of the Address Resolution Protocol.
.It Cm broadcast
(Inet only)
Specify the address to use to represent broadcasts to the
network.
The default broadcast address is the address with a host part of all 1's.
.It Cm debug
Enable driver dependent debugging code; usually, this turns on
extra console error logging.
.It Fl debug
Disable driver dependent debugging code.
I 20
.ne 1i
E 20
.It Cm delete
Remove the network address specified.
This would be used if you incorrectly specified an alias, or it
was no longer needed.
If you have incorrectly set an NS address having the side effect
of specifying the host portion, removing all NS addresses will
allow you to respecify the host portion.
.It Cm dest_address
Specify the address of the correspondent on the other end
of a point to point link.
.It Cm down
E 14
Mark an interface ``down''.  When an interface is
marked ``down'', the system will not attempt to
transmit messages through that interface. 
I 4
If possible, the interface will be reset to disable reception as well.
I 5
This action does not automatically disable routes using the interface.
E 5
E 4
D 14
.TP 15
.B trailers
D 4
Enable the use of a ``trailer'' link level encapsulation when
E 4
I 4
Request the use of a ``trailer'' link level encapsulation when
E 4
sending (default).
If a network interface supports
.IR trailers ,
the system will, when possible, encapsulate outgoing
messages in a manner which minimizes the number of
memory to memory copy operations performed by the receiver.
I 4
On networks that support the Address Resolution Protocol (see
.IR arp (4P);
currently, only 10 Mb/s Ethernet),
this flag indicates that the system should request that other
systems use trailers when sending to this host.
Similarly, trailer encapsulations will be sent to other
hosts that have made such requests.
I 5
Currently used by Internet protocols only.
E 5
E 4
.TP 15
.B \-trailers
Disable the use of a ``trailer'' link level encapsulation.
.TP 15
.B arp
Enable the use of the Address Resolution Protocol in mapping
between network level addresses and link level addresses (default). 
This is currently implemented for mapping between DARPA Internet
D 2
addreses and 10Mb/s Ethernet addresses.
E 2
I 2
addresses and 10Mb/s Ethernet addresses.
E 2
.TP 15
.B \-arp
Disable the use of the Address Resolution Protocol.
I 2
.TP 15
I 4
.BI metric " n"
E 14
I 14
.It Cm ipdst
This is used to specify an Internet host who is willing to receive
ip packets encapsulating NS packets bound for a remote network.
An apparent point to point link is constructed, and
the address specified will be taken as the NS address and network
of the destination.
IP encapsulation of
.Tn CLNP
packets is done differently.
.It Cm metric Ar n
E 14
Set the routing metric of the interface to
D 14
.IR n ,
E 14
I 14
.Ar n ,
E 14
default 0.
The routing metric is used by the routing protocol
D 14
.RI ( routed (8c)).
E 14
I 14
.Pq Xr routed 8 .
E 14
Higher metrics have the effect of making a route
less favorable; metrics are counted as addition hops
to the destination network or host.
D 14
.TP 15
E 4
.B debug
Enable driver dependent debugging code; usually, this turns on
extra console error logging.
.TP 15
.B \-debug
Disable driver dependent debugging code.
I 3
.TP 15
D 4
.B netmask
Specify how much of the address you wish to reserve for subdiving
Class A and B networks into sub-networks.
(Inet only).
E 4
I 4
.BI netmask " mask"
E 14
I 14
.It Cm netmask Ar mask
E 14
D 8
(Inet only)
E 8
I 8
D 18
(Inet and Iso)
E 18
I 18
(Inet and ISO)
E 18
E 8
D 5
Specify how much of the address you wish to reserve for subdividing
E 5
I 5
Specify how much of the address to reserve for subdividing
E 5
networks into sub-networks.
I 5
The mask includes the network part of the local address
and the subnet part, which is taken from the host field of the address.
E 5
The mask can be specified as a single hexadecimal number
D 5
with a leading 0x, in the style of a dot-notation Internet address,
or as a pseudo-network name.
The mask contains 1's for the positions in the 32-bit address
E 5
I 5
with a leading 0x, with a dot-notation Internet address,
or with a pseudo-network name listed in the network table
D 14
.IR networks (5).
E 14
I 14
.Xr networks 5 .
E 14
The mask contains 1's for the bit positions in the 32-bit address
E 5
which are to be used for the network and subnet parts,
and 0's for the host part.
The mask should contain at least the standard network portion,
D 5
and the subnet field should normally be contiguous with the network
E 5
I 5
and the subnet field should be contiguous with the network
E 5
portion.
E 4
D 14
.TP 15
D 6
.B dstaddr
E 6
I 6
.B dest_address
E 6
D 4
Specify the correspondent on the other end of a point to point link
E 4
I 4
Specify the address of the correspondent on the other end
of a point to point link.
E 4
.TP 15
.B broadcast
I 4
(Inet only)
E 4
D 5
Specify the address you wish to use to represent broadcasts to the
E 5
I 5
Specify the address to use to represent broadcasts to the
E 5
network.
I 5
The default broadcast address is the address with a host part of all 1's.
E 5
.TP 15
.B ipdst
D 5
This is used to specify an internet host who is willing to receive
E 5
I 5
D 8
(NS only)
E 8
I 8
D 10
(NS and ISO)
E 10
E 8
This is used to specify an Internet host who is willing to receive
E 5
D 4
ip packets encapsulating ns packets bound for a remote network.
E 4
I 4
D 8
ip packets encapsulating NS packets bound for a remote network.
E 4
In this case, an apparent point to point link is constructed, and
E 8
I 8
D 10
ip packets encapsulating packets bound for a remote network.
For the NS  case, an apparent point to point link is constructed, and
E 10
I 10
ip packets encapsulating NS packets bound for a remote network.
An apparent point to point link is constructed, and
E 10
E 8
D 4
the address you specify will be taken as the ns address and network
E 4
I 4
D 5
the address you specify will be taken as the NS address and network
E 5
I 5
the address specified will be taken as the NS address and network
E 5
E 4
D 10
of the destinee.
I 8
For the ISO case, the eon
.IR eon (5)
interface must be specified, the supplied iso address must
conform to RFC1070, IP address will indicate the status bits.
E 10
I 10
of the destination.
IP encapsulation of CLNP packets is done differently, see 
.IR eon (5).
E 10
.TP 15
.B alias
Establish an additional network address for this interface.
This is sometimes useful when changing network numbers, and
one wishes to accept packets addressed to the old interface.
.TP 15
.B delete
Remove the network address specified.
This would be used if you incorrectly specified an alias, or it
was no longer needed.
If you have incorrectly set an NS address having the side effect
of specifying the host portion, removing all NS addresses will
allow you to respecify the host portion.
I 10
D 11
.tp 15
E 11
I 11
.TP 15
E 11
.BI nsellength " n"
(ISO only)
This specifies a trailing number of bytes for a received NSAP
E 14
I 14
.\" see 
.\" Xr eon 5 .
.It Cm nsellength Ar n
.Pf ( Tn ISO
only)
This specifies a trailing number of bytes for a received
.Tn NSAP
E 14
used for local identification, the remaining leading part of which is
D 14
taken to be the NET (Network Entity Title).
The default value is 1, which is conformant to US GOSIP.
E 14
I 14
taken to be the
.Tn NET
(Network Entity Title).
The default value is 1, which is conformant to US
.Tn GOSIP .
E 14
D 18
When an iso address is set in an ifconfig command,
E 18
I 18
When an ISO address is set in an ifconfig command,
E 18
D 12
it is really the NET which is being specified.
For example, in US GOSIP, 19 hex digits should be
specified in the ISO NET to be assigned to the interface.
E 12
I 12
D 14
it is really the NSAP which is being specified.
For example, in US GOSIP, 20 hex digits should be
specified in the ISO NSAP to be assigned to the interface.
E 14
I 14
it is really the
.Tn NSAP
which is being specified.
For example, in
.Tn US GOSIP ,
20 hex digits should be
specified in the
.Tn ISO NSAP
to be assigned to the interface.
E 14
E 12
D 18
There is some evidence that a number different 1 may be useful
E 18
I 18
There is some evidence that a number different from 1 may be useful
E 18
D 14
for AFI 37 type addresses.
E 10
E 8
E 3
E 2
.PP
.I Ifconfig
E 14
I 14
for
.Tn AFI
37 type addresses.
.It Cm trailers
Request the use of a ``trailer'' link level encapsulation when
sending (default).
If a network interface supports
.Cm trailers ,
the system will, when possible, encapsulate outgoing
messages in a manner which minimizes the number of
memory to memory copy operations performed by the receiver.
On networks that support the Address Resolution Protocol (see
.Xr arp 4 ;
currently, only 10 Mb/s Ethernet),
this flag indicates that the system should request that other
systems use trailers when sending to this host.
Similarly, trailer encapsulations will be sent to other
hosts that have made such requests.
Currently used by Internet protocols only.
.It Fl trailers
Disable the use of a ``trailer'' link level encapsulation.
I 15
D 16
.It Cm llc[0-3]
E 16
I 16
.It Cm link[0-2]
E 16
Enable special processing of the link level of the interface.
These three options are interface specific in actual effect, however,
they are in general used to select special modes of operation. An example
of this is to enable SLIP compression. Currently, only used by SLIP.
I 20
.ne 1i
E 20
D 16
.It Fl llc[0-3]
E 16
I 16
.It Fl link[0-2]
E 16
D 19
Disables special processing at the link level with the specified interface.
E 19
I 19
Disable special processing at the link level with the specified interface.
E 19
E 15
.It Cm up
Mark an interface ``up''. 
This may be used to enable an interface after an ``ifconfig down.''
It happens automatically when setting the first address on an interface.
If the interface was reset when previously marked down,
the hardware will be re-initialized.
.El
.Pp
.Pp
.Nm Ifconfig
E 14
displays the current configuration for a network interface
when no optional parameters are supplied.
I 3
If a protocol family is specified,
Ifconfig will report only the details specific to that protocol family.
E 3
D 14
.PP
E 14
I 14
.Pp
E 14
Only the super-user may modify the configuration of a network interface.
D 14
.SH DIAGNOSTICS
E 14
I 14
.Sh DIAGNOSTICS
E 14
Messages indicating the specified interface does not exit, the
D 5
requested address is unknown, the user is not privileged and
E 5
I 5
requested address is unknown, or the user is not privileged and
E 5
tried to alter an interface's configuration.
D 14
.SH "SEE ALSO"
D 5
rc(8), intro(4N), netstat(1)
E 5
I 5
D 7
netstat(1), intro(4N), rc(8)
E 7
I 7
D 10
netstat(1), netintro(4), rc(8)
E 10
I 10
netstat(1), netintro(4), rc(8), routed(8), eon(5) 
E 14
I 14
.Sh SEE ALSO
.Xr netstat 1 ,
.Xr netintro 4 ,
.Xr rc 8 ,
.Xr routed 8 ,
.\" .Xr eon 5
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.2 .
E 14
E 10
E 7
E 5
E 1
