sbin/mknod/SCCS/s.mknod.8
h30198
s 00001/00001/00072
d D 8.2 93/12/11 23:43:11 mckusick 8 7
c copyediting for Usenix manuals
e
s 00002/00002/00071
d D 8.1 93/06/05 11:01:11 bostic 7 6
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00071/00043/00002
d D 6.4 91/03/16 17:07:42 cael 6 5
c macro and text revision (-mdoc version 3)
e
s 00001/00001/00044
d D 6.3 90/06/24 21:40:59 trent 5 4
c new pathname (mknod)
e
s 00001/00001/00044
d D 6.2 86/05/19 19:48:47 karels 4 3
c see also ...
e
s 00001/00001/00044
d D 6.1 85/04/27 13:35:03 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00001/00001/00044
d D 5.1 85/04/27 13:34:32 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00045/00000/00000
d D 4.1 85/04/27 13:34:15 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
D 6
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 6
I 6
D 7
.\" Copyright (c) 1980, 1991 Regents of the University of California.
.\" All rights reserved.
E 7
I 7
.\" Copyright (c) 1980, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 7
E 6
.\"
D 6
.\"	%W% (Berkeley) %G%
E 6
I 6
.\" %sccs.include.redist.man%
E 6
.\"
D 2
.TH MKNOD 8 "4/1/81"
E 2
I 2
D 3
.TH MKNOD 8  "4 February 1983"
E 3
I 3
D 6
.TH MKNOD 8 "%Q%"
E 3
E 2
.UC 4
.SH NAME
mknod \- build special file
.SH SYNOPSIS
D 5
.B /etc/mknod
E 5
I 5
.B mknod
E 5
name
[
.B c
] [
.B b
]
major
minor
.SH DESCRIPTION
.I Mknod
makes a special file.
The first argument is the
.I name
of the entry.
The second is
.B b
if the special file is block-type (disks, tape) or
.B c
if it is character-type (other devices).
The last two arguments are
numbers specifying the
.I major
device type
and the
.I minor
device (e.g. unit, drive, or line number).
.PP
The assignment of major device numbers is specific to each system.
They have to be dug out of the
system source file
.I conf.c.
.SH "SEE ALSO"
D 4
mknod(2)
E 4
I 4
mknod(2), makedev(8)
E 6
I 6
.\"     %W% (Berkeley) %G%
.\"
.Dd %Q%
.Dt MKNOD 8
.Os BSD 4
.Sh NAME
.Nm mknod
.Nd build special file
.Sh SYNOPSIS
.Nm mknod
.Ar name
.Op Cm c | Cm b
.Ar major minor
.Sh DESCRIPTION
The
.Nm mknod
command creates device special files.
Normally the shell script
.Pa /dev/MAKEDEV
is used to create special files for commonly known devices; it executes
.Nm mknod
with the appropriate arguments and can make all the files required for the
device.
.Pp
To make nodes manually, the four required arguments are:
.Pp
.Bl -tag -width majorx
.It Ar name
Device name, for example
.Dq sd
for a SCSI disk on an HP300 or a
.Dq pty
for pseudo-devices.
.It Cm b | Cm c
Type of device. If the
device is a block type device such as a tape or disk drive which needs
both cooked and raw special files,
the type is
.Cm b .
All other devices are character type devices, such as terminal
D 8
and psuedo devices, and are type
E 8
I 8
and pseudo devices, and are type
E 8
.Cm c .
.It Ar major
The major device number is an integer number which tells the kernel
which device driver entry point to use.  To learn what
major device number to use for a particular device, check the file
.Pa /dev/MAKEDEV
to see if the device is known, or check
the system dependent device configuration file:
.Bd -filled -offset indent
.Dq Pa /usr/src/sys/conf/device. Ns Em architecture
.Ed
.Pp
(for example
.Pa device.hp300 ) .
.It Ar minor
The minor device number tells the kernel which subunit
the node corresponds to on the device; for example,
a subunit may be a filesystem partition
or a tty line.
.El
.Sh SEE ALSO
.Xr mknod 2 ,
.Xr makedev 8
.Sh HISTORY
A
.Nm
command appeared in Version 6 AT&T UNIX.
E 6
E 4
E 1
