bin/hostname/SCCS/s.hostname.1
h48198
s 00003/00002/00037
d D 8.2 95/04/28 09:47:20 bostic 13 12
c prettiness police
c From: Charles Hannum <mycroft@NetBSD.ORG>
e
s 00002/00002/00037
d D 8.1 93/05/31 14:37:20 bostic 12 11
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00009/00009/00030
d D 6.8 91/07/27 22:07:14 cael 11 10
c mdoc version three
e
s 00002/00000/00037
d D 6.7 91/03/13 23:57:26 cael 10 7
c add .Vx so tmac.andoc will call tmac.mdoc-old
e
s 00001/00000/00038
d R 6.8 91/03/13 23:50:34 cael 9 8
c add .Vx so tmac.andoc will call tmac.mdoc-old
e
s 00001/00000/00037
d R 6.7 91/03/13 20:29:11 cael 8 7
c add .Vx so tmac.andoc will call tmac.mdoc-old
e
s 00002/00001/00035
d D 6.6 90/07/24 22:46:15 cael 7 6
c .Xr botch fix
e
s 00029/00014/00007
d D 6.5 90/06/24 19:05:34 cael 6 5
c converted man page
e
s 00001/00011/00020
d D 6.4 90/05/31 20:31:01 bostic 5 4
c new copyright notice
e
s 00010/00005/00021
d D 6.3 88/07/09 11:44:57 bostic 4 3
c install approved copyright notice
e
s 00016/00012/00010
d D 6.2 88/06/06 15:28:03 bostic 3 2
c add -s flag, Berkeley header, hostname now run from /etc/netstart
e
s 00001/00001/00021
d D 6.1 85/04/29 21:09:54 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00022/00000/00000
d D 5.1 85/04/29 21:09:47 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
D 3
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 3
I 3
D 6
.\" Copyright (c) 1983, 1988 Regents of the University of California.
E 6
I 6
D 12
.\" Copyright (c) 1983, 1988, 1990 The Regents of the University of California.
E 6
.\" All rights reserved.
E 12
I 12
.\" Copyright (c) 1983, 1988, 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 12
E 3
.\"
I 3
D 5
.\" Redistribution and use in source and binary forms are permitted
D 4
.\" provided that this notice is preserved and that due credit is given
.\" to the University of California at Berkeley. The name of the University
.\" may not be used to endorse or promote products derived from this
.\" software without specific prior written permission. This software
.\" is provided ``as is'' without express or implied warranty.
E 4
I 4
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 5
I 5
D 11
.\" %sccs.include.redist.man%
E 11
I 11
.\" %sccs.include.redist.roff%
E 11
E 5
E 4
.\"
E 3
D 6
.\"	%W% (Berkeley) %G%
E 6
I 6
D 11
.\"     %W% (Berkeley) %G%
E 11
I 11
.\"	%W% (Berkeley) %G%
E 11
E 6
.\"
I 10
D 11
.Vx
.Vx
E 11
E 10
D 2
.TH HOSTNAME 1 "13 March 1982"
E 2
I 2
D 6
.TH HOSTNAME 1 "%Q%"
E 2
.UC 5
.SH NAME
D 3
hostname \- set or print name of current host system
E 3
I 3
\fBhostname\fP \- set or print name of current host system
E 3
.SH SYNOPSIS
D 3
.B hostname
[ nameofhost ]
E 3
I 3
\fBhostname\fP [-s] [nameofhost]
E 3
.SH DESCRIPTION
D 3
The
.I hostname
command prints the name of the current host, as given before the
``login'' prompt.
The super-user can set the hostname by giving an argument; this
is usually done in the startup script /etc/rc.local.
E 3
I 3
\fIHostname\fP prints the name of the current host.  The super-user can
E 6
I 6
.Dd %Q%
.Dt HOSTNAME 1
.Os BSD 4.2
.Sh NAME
.Nm hostname
.Nd set or print name of current host system
.Sh SYNOPSIS
.Nm hostname
.Op Fl s
D 13
.Op Ar nameofhost
E 13
I 13
.Op Ar name-of-host
E 13
.Sh DESCRIPTION
.Nm Hostname
prints the name of the current host.  The super-user can
E 6
set the hostname by supplying an argument; this is usually done in the
D 6
network initialization script \fI/etc/netstart\fP, normally run at boot
time.  The \fI-s\fP option trims any domain information from the printed
E 6
I 6
network initialization script
.Pa /etc/netstart ,
normally run at boot
time.
.Pp
Options:
I 7
D 11
.Tw Ds
E 7
.Tp Fl s
E 11
I 11
.Bl -tag -width flag
.It Fl s
E 11
Trims off any domain information from the printed
E 6
name.
E 3
D 6
.SH SEE ALSO
gethostname(2), sethostname(2)
E 6
I 6
D 11
.Tp
E 11
I 11
.El
E 11
.Sh SEE ALSO
D 7
.Xr gethostname 2 ,
E 7
I 7
D 13
.Xr gethostname 2
E 13
I 13
.Xr gethostname 2 ,
.Xr sethostname 2
E 13
E 7
.Sh HISTORY
D 11
.Nm Hostname
appeared in 4.2 BSD.
E 11
I 11
The
.Nm hostname
command appeared in
.Bx 4.2 .
E 11
E 6
E 1
