usr.sbin/chown/SCCS/s.chown.8
h22860
s 00001/00001/00122
d D 8.3 94/03/31 16:55:37 bostic 17 16
c better wording than no-op
e
s 00043/00011/00080
d D 8.2 94/03/31 16:04:06 bostic 16 15
c POSIX 1003.2b/D9 symbolic links
e
s 00002/00002/00089
d D 8.1 93/06/29 18:17:25 bostic 15 14
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00002/00002/00089
d D 6.11 93/06/29 18:17:00 mckusick 14 12
c grammer nits
e
s 00002/00002/00089
d R 8.1 93/06/06 13:51:48 bostic 13 12
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00002/00002/00089
d D 6.10 92/07/27 13:47:21 bostic 12 11
c on second thought, make it symlink(7)
e
s 00001/00000/00090
d D 6.9 92/07/27 13:38:52 bostic 11 10
c add symlin(1)
e
s 00004/00009/00086
d D 6.8 92/06/01 12:14:55 elan 10 9
c Added -Hh flags
e
s 00018/00002/00077
d D 6.7 92/05/28 12:09:43 elan 9 8
c Added -Hh documentation.
e
s 00009/00005/00070
d D 6.6 91/06/17 14:22:07 bostic 8 7
c clarify owner/group operand parsing, minor wordsmithing
e
s 00045/00036/00030
d D 6.5 91/03/16 18:11:49 cael 7 6
c macro and text revision (-mdoc version 3)
e
s 00053/00031/00013
d D 6.4 90/10/26 14:52:05 bostic 6 5
c change group character, dot, to colon (dot still permitted)
c change the -f flag to ONLY mask errors in changing owner/group
c new manual page, started from the POSIX.2 manual page
c use FTS to walk the tree
e
s 00004/00009/00040
d D 6.3 88/04/21 11:15:19 bostic 5 4
c minor cleanups, clarify meaning of -f 
e
s 00002/00000/00047
d D 6.2 86/05/22 10:42:47 mckusick 4 3
c clarify that -R does not follow symbolic links
e
s 00013/00002/00034
d D 6.1 85/04/27 13:06:10 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00011/00017/00025
d D 5.1 85/04/27 13:05:46 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00042/00000/00000
d D 4.1 85/04/27 13:05:27 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
D 6
.\" Copyright (c) 1980 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 6
I 6
D 7
.\" Copyright (c) 1990 The Regents of the University of California.
E 7
I 7
D 15
.\" Copyright (c) 1990, 1991 The Regents of the University of California.
E 7
.\" All rights reserved.
E 15
I 15
D 16
.\" Copyright (c) 1990, 1991, 1993
E 16
I 16
.\" Copyright (c) 1990, 1991, 1993, 1994
E 16
.\"	The Regents of the University of California.  All rights reserved.
E 15
E 6
.\"
I 6
.\" %sccs.include.redist.man%
.\"
E 6
D 7
.\"	%W% (Berkeley) %G%
E 7
I 7
.\"     %W% (Berkeley) %G%
E 7
.\"
D 2
.TH CHOWN 8 "4/3/81"
E 2
I 2
D 3
.TH CHOWN 8 "18 July 1983"
E 3
I 3
D 7
.TH CHOWN 8 "%Q%"
E 3
E 2
.UC 4
.SH NAME
D 2
chown, chgrp \- change owner or group
E 2
I 2
D 6
chown \- change owner
E 6
I 6
chown \- change file owner and group
E 6
E 2
.SH SYNOPSIS
D 5
.B /etc/chown
E 5
I 5
D 6
.B chown
E 5
I 2
[
D 5
.B \-f
I 3
.B \-R
E 5
I 5
.B \-Rf
E 5
E 3
]
E 2
D 3
owner file ...
E 3
I 3
owner[.group] file ...
E 6
I 6
.nf
.ft B
chown [-Rf] [owner][:group] file ...
E 6
E 3
D 2
.PP
.B /etc/chgrp
group file ...
E 2
.SH DESCRIPTION
.I Chown
E 7
I 7
.Dd %Q%
.Dt CHOWN 8
.Os BSD 4
.Sh NAME
.Nm chown
.Nd change file owner and group
.Sh SYNOPSIS
.Nm chown
D 10
.Op Fl Rf
E 10
I 10
D 16
.Op Fl HRfh
E 16
I 16
.Oo
.Fl R
.Op Fl H | Fl L | Fl P
.Oc
.Op Fl f
E 16
E 10
D 8
.Op Ar owner
.Op Ar group
E 8
I 8
.Ar owner Op Ar :group
E 8
.Ar file ...
I 8
.Nm chown
D 9
.Op Fl Rf
E 9
I 9
D 16
.Op Fl HRfh
E 16
I 16
.Oo
.Fl R
.Op Fl H | Fl L | Fl P
.Oc
.Op Fl f
E 16
E 9
.Ar :group
.Ar file ...
E 8
.Sh DESCRIPTION
.Nm Chown
E 7
D 6
changes the owner of the
.I files
to
.IR owner .
The owner may be either a decimal UID or
a login name found in the password file.
I 3
An optional group may also be specified.
The group may be either a decimal GID or
a group name found in the group-ID file.
E 6
I 6
sets the user ID and/or the group ID of the specified files.
E 6
E 3
D 7
.PP
E 7
I 7
.Pp
E 7
D 2
.I Chgrp
changes the group-ID of the
.I files
to
.IR group .
The group may be either a decimal GID or
a group name found in the group-ID file.
.PP
Only the super-user can change owner or group,
in order to simplify as yet unimplemented accounting procedures.
E 2
I 2
D 6
Only the super-user can change owner,
in order to simplify accounting procedures.
D 5
No errors are reported when the
E 5
I 5
No errors, except for usage errors, are reported when the
E 5
.B \-f
(force) option is given.
E 6
I 6
The options are as follows:
D 7
.TP
-R
E 7
I 7
.Bl -tag -width Ds
I 9
.It Fl H
D 16
When encountering a symbolic link on the command line, follow it.  All other
symbolic links encountered in the traversal are not followed.
E 16
I 16
If the
.Fl R
option is specified, symbolic links on the command line are followed.
(Symbolic links encountered in the tree traversal are not followed.)
.It Fl L
If the
.Fl R
option is specified, all symbolic links are followed.
.It Fl P
If the
.Fl R
option is specified, no symbolic links are followed.
E 16
E 9
.It Fl R
E 7
Change the user ID and/or the group ID for the file hierarchies rooted
in the files instead of just the files themselves.
D 7
.TP
-f
E 7
I 7
.It Fl f
E 7
Don't report any failure to change file owner or group, nor modify
the exit status to reflect such failures.
I 9
D 16
.It Fl h
D 10
When encountering a symbolic link, change the ownership of the object the link
points to rather than the link itself.
E 10
I 10
When encountering a symbolic link anywhere in the traversal, follow it.
E 16
E 10
E 9
E 6
I 3
D 7
.PP
E 7
I 7
.El
.Pp
I 9
D 10
With respect to symbolic links, unless the
E 10
I 10
D 14
The ownership of a symbolic link is immutable, so that unless the
E 14
I 14
D 16
The ownership of a symbolic link is immutable, so unless the
E 14
E 10
.Fl h
E 16
I 16
Symbolic links don't have owners, so unless the
.Fl H
E 16
or 
D 16
.Fl H 
D 14
flags are set,
E 14
I 14
flag is set,
E 16
I 16
.Fl L 
option is set,
E 16
E 14
.Nm chown
D 10
changes the ownership of the link itself rather than the object it 
points to.
E 10
I 10
D 17
on a symbolic link is a no-op.
E 17
I 17
on a symbolic link always succeeds and has no effect.
E 17
I 16
The
.Fl H ,
.Fl L
and
.Fl P
options are ignored unless the
.Fl R
option is specified.
In addition, these options override each other and the
command's actions are determined by the last one specified.
E 16
E 10
.Pp
E 9
E 7
D 6
When the
.B \-R
option is given, 
E 6
I 6
The
D 7
.I owner
E 7
I 7
.Ar owner
E 7
and
D 7
.I group
E 7
I 7
.Ar group
E 7
D 8
operands are both optional, but at least one must be specified; if
the group operand is specified, it must be preceded by a colon (``:'')
character.
E 8
I 8
operands are both optional, however, one must be specified.
If the
.Ar group
operand is specified, it must be preceded by a colon (``:'') character.
E 8
D 7
.PP
E 7
I 7
.Pp
E 7
The
D 7
.I owner
should be either a numeric user ID or a user name.
E 7
I 7
.Ar owner
may be either a numeric user ID or a user name.
E 7
If a user name is also a numeric user ID, the operand is used as a
user name.
The
D 7
.I group
should be either a numeric group ID or a group name.
E 7
I 7
.Ar group
may be either a numeric group ID or a group name.
E 7
If a group name is also a numeric group ID, the operand is used as a
group name.
D 7
.PP
Only the super-user may change the owner of a file in order to
simplify accounting procedures and to prevent the circumvention
of system security.
.PP
E 7
I 7
.Pp
The ownership of a file may only be altered by a super-user for
obvious security reasons.
D 10
.Pp
E 7
The owner and group of symbolic links are themselves changed instead
of the file to which the link points.
E 10
D 7
.PP
E 7
I 7
.Pp
E 7
The
E 6
D 7
.I chown
E 7
I 7
.Nm chown
E 7
D 6
recursively descends its directory arguments
setting the specified owner.
I 4
When symbolic links are encountered, their ownership is changed,
but they are not traversed.
E 6
I 6
utility exits 0 on success, and >0 if an error occurs.
D 7
.SH COMPATIBILITY
E 7
I 7
.Sh COMPATIBILITY
E 7
Previous versions of the
D 7
.I chown
E 7
I 7
.Nm chown
E 7
utility used the dot (``.'') character to distinguish the group name.
This has been changed to be a colon (``:'') character so that user and
group names may contain the dot character.
I 16
.Pp
Previous versions of the
.Nm chown
utility changed the owner of symbolic links specified on the command
line.
In this system, symbolic links do not have owners.
E 16
E 6
E 4
E 3
E 2
D 5
.SH FILES
/etc/passwd
E 5
D 2
.br
/etc/group
E 2
D 7
.SH "SEE ALSO"
I 2
D 5
chgrp(1),
E 2
chown(2),
passwd(5), group(5)
E 5
I 5
D 6
chgrp(1), chown(2)
E 6
I 6
chgrp(1), find(1), chown(2)
E 7
I 7
.Sh SEE ALSO
.Xr chgrp 1 ,
.Xr find 1 ,
I 11
D 12
.Xr symlink 1 ,
E 12
E 11
D 9
.Xr chown 2
E 9
I 9
.Xr chown 2 ,
D 12
.Xr fts 3
E 12
I 12
.Xr fts 3 ,
.Xr symlink 7
E 12
E 9
.Sh STANDARDS
The
.Nm chown
command is expected to be POSIX 1003.2 compliant.
E 7
E 6
E 5
E 1
