usr.bin/mail/SCCS/s.mail.1
h41575
s 00002/00002/01030
d D 8.8 95/04/28 12:46:48 bostic 31 30
c the default path is /var/mail, not /var/spool/mail...
c From: Chris Torek <torek@BSDI.COM>
e
s 00005/00001/01027
d D 8.7 95/04/21 08:34:57 dab 30 29
c Make the check for "/to:" be case sensitive, so that
c "/To:" can be use to limit the search to just the "To:" field.
c Also make "/:y" and abbreviation for "/subject:y".
e
s 00003/00000/01025
d D 8.6 95/04/20 10:39:26 dab 29 28
c Add support for the special case of searchheaders,
c so that ``/To:y'' will search for the field ``y'' in not
c just the ``To'' field, but also in the ``Cc'' and ``Bcc'' fields.
e
s 00016/00000/01009
d D 8.5 95/04/20 09:59:19 dab 28 27
c Add support for "inc" command and "autoinc" variable.
c Recognize timestamps in From lines created by SysV/Solaris
c Recognize MAILRC env variable for .mailrc location
c Change tty handling from sgtty to termios
c Turn off EXTPROC when editing headers so that it works
c correctly with Linemode telnet.
e
s 00005/00000/01004
d D 8.4 94/06/01 21:14:34 ah 27 26
c page breaks for 4.4BSD manuals
e
s 00003/00003/01001
d D 8.3 94/05/05 09:14:56 bostic 26 25
c system initialization file is in /etc/, not /usr/share/misc
e
s 00004/00004/01000
d D 8.2 93/12/30 15:38:55 mckusick 25 24
c copyediting for Usenix manuals
e
s 00002/00002/01002
d D 8.1 93/06/06 15:08:09 bostic 24 23
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00004/00000/01000
d D 6.20 92/11/17 21:40:51 edward 23 22
c searchheaders
e
s 00324/00402/00676
d D 6.19 91/07/27 18:25:57 cael 22 21
c mdoc version three
e
s 00000/00006/01078
d D 6.18 91/06/19 15:01:17 bostic 21 20
c binmail(1) is gone
e
s 00002/00000/01082
d D 6.17 91/03/14 00:21:49 cael 20 18
c add .Vx so tmac.andoc will call tmac.mdoc-old
e
s 00001/00000/01082
d R 6.17 91/03/13 20:35:11 cael 19 18
c add .Vx so tmac.andoc will call tmac.mdoc-old
e
s 00017/00011/01065
d D 6.16 90/07/24 22:48:16 cael 18 17
c .Xr botch fix
e
s 00001/00001/01075
d D 6.15 90/06/24 19:12:08 cael 17 16
c converted man page
e
s 00742/00569/00334
d D 6.14 90/06/11 05:56:52 cael 16 15
c converted man page
e
s 00006/00006/00897
d D 6.13 89/09/15 18:54:40 edward 15 14
c tabstr changed to indentprefix to be Sun compatible
e
s 00001/00005/00902
d D 6.12 89/06/22 16:38:01 bostic 14 13
c reference vacation
e
s 00001/00001/00906
d D 6.11 89/02/13 23:53:01 edward 13 12
c variable mbox changed to MBOX to be compatible with Sun
e
s 00053/00015/00854
d D 6.10 88/08/04 20:55:36 edward 12 11
c added some more options and tilde escapes and other weird things
e
s 00013/00002/00856
d D 6.9 88/08/04 14:02:01 bostic 11 10
c add Berkeley specific copyright
e
s 00035/00029/00823
d D 6.8 88/07/24 10:25:33 edward 10 9
c -b, -c options and others, from Tom Newcomb (newcomb@vangogh)
e
s 00011/00000/00841
d D 6.7 88/05/28 16:00:41 edward 9 8
c added saveignore and saveretain
e
s 00005/00004/00836
d D 6.6 86/05/09 08:27:46 anne 8 7
c grammar
e
s 00002/00002/00838
d D 6.5 86/01/20 09:36:37 bloom 7 6
c calls to nonexistant fonts (from gbergman@cartan)
e
s 00004/00000/00836
d D 6.4 85/10/18 16:13:18 mckusick 6 5
c add ~b documentation
e
s 00022/00002/00814
d D 6.3 85/09/15 17:32:52 serge 5 4
c added Replyall and PAGER variables, and unread/Unread command
e
s 00007/00002/00809
d D 6.2 85/09/10 21:01:14 serge 4 3
c corrected documentation for "write" command
e
s 00026/00003/00785
d D 6.1 85/04/29 14:34:26 mckusick 3 2
c 4.3BSD beta release manual page
e
s 00305/00067/00483
d D 5.1 85/04/29 14:33:56 mckusick 2 1
c manual page distributed with 4.2BSD
e
s 00550/00000/00000
d D 4.1 85/04/29 14:33:39 mckusick 1 0
c manual page distributed with 4.1BSD
e
u
U
t
T
I 1
D 16
.\" Copyright (c) 1980 Regents of the University of California.
E 16
I 16
D 24
.\" Copyright (c) 1980, 1990 The Regents of the University of California.
E 16
D 11
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 11
I 11
.\" All rights reserved.
E 24
I 24
.\" Copyright (c) 1980, 1990, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 24
.\"
D 16
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 16
I 16
D 22
.\" %sccs.include.redist.man%
E 22
I 22
.\" %sccs.include.redist.roff%
E 22
E 16
E 11
.\"
D 16
.\"	%W% (Berkeley) %G%
E 16
I 16
D 22
.\"     %W% (Berkeley) %G%
E 22
I 22
.\"	%W% (Berkeley) %G%
E 22
E 16
.\"
I 20
D 22
.Vx
.Vx
E 22
E 20
D 2
.TH MAIL 1
E 2
I 2
D 3
.TH MAIL 1 "1 April 1983"
E 3
I 3
D 16
.TH MAIL 1 "%Q%"
E 3
E 2
.UC 4
.SH NAME
mail \- send and receive mail
.SH SYNOPSIS
.B mail
[
I 2
D 10
.B \-v
E 10
I 10
D 12
.B \-inv
E 12
I 12
.B \-iInv
E 12
E 10
]
[
D 10
.B \-i
]
[
.B \-n
]
[
E 10
.B \-s
subject
]
[
D 10
user ...
E 10
I 10
.B \-c
cc-addr
E 10
]
I 10
[
.B \-b
bcc-addr
]
to-addr...
E 16
I 16
.Dd %Q%
.Dt MAIL 1
.Os BSD 4
.Sh NAME
.Nm mail
.Nd send and receive mail
.Sh SYNOPSIS
.Nm mail
.Op Fl iInv
.Op Fl s Ar subject
.Op Fl c Ar cc-addr
.Op Fl b Ar bcc-addr
.Ar to-addr...
E 16
E 10
D 22
.br
E 22
D 16
.B mail
[
D 10
.B \-v
E 10
I 10
D 12
.B \-inv
E 12
I 12
.B \-iInNv
E 12
E 10
]
D 10
[
.B \-i
]
[
.B \-n
]
E 10
E 2
.B \-f
[
name
]
E 16
I 16
.Nm mail
.Op Fl iInNv
.Fl f
.Op Ar name
E 16
I 2
D 22
.br
E 22
D 16
.B mail
[
D 10
.B \-v
E 10
I 10
D 12
.B \-inv
E 12
I 12
.B \-iInNv
E 12
E 10
E 2
]
[
D 2
people ...
E 2
I 2
D 10
.B \-i
E 2
]
I 2
[
.B \-n
]
E 10
.B \-u
user
I 10
]
E 10
E 2
.SH INTRODUCTION
.I Mail
E 16
I 16
.Nm mail
.Op Fl iInNv
.Op Fl u Ar user
.Sh INTRODUCTION
.Nm Mail
E 16
D 25
is a intelligent mail processing system, which has
E 25
I 25
is an intelligent mail processing system, which has
E 25
a command syntax reminiscent of
D 16
.I ed
E 16
I 16
D 22
.Xr ed 1
E 22
I 22
.Xr \&ed 1
E 22
E 16
with lines replaced by messages.
D 16
.PP
I 2
The
.B \-v
flag puts mail into verbose mode; the details of
E 16
I 16
.Pp
I 18
D 22
.Tw Ds
E 18
.Tp Fl v
Verbose mode. The details of
E 22
I 22
.Bl -tag -width flag
.It Fl v
Verbose mode.
The details of
E 22
E 16
D 25
delivery are displayed on the users terminal.
E 25
I 25
delivery are displayed on the user's terminal.
E 25
D 16
The
.B \-i
flag causes tty interrupt signals to be ignored. This is
E 16
I 16
D 22
.Tp Fl i
Ignore tty interrupt signals. This is
E 22
I 22
.It Fl i
Ignore tty interrupt signals.
This is
E 22
E 16
particularly useful when using
D 16
.I mail
E 16
I 16
.Nm mail
E 16
on noisy phone lines.
D 16
The
I 12
.B \-I
flag forces mail to run in interactive mode even when
input isn't a terminal.  In particular, the `~' special
E 16
I 16
D 22
.Tp Fl I
E 22
I 22
.It Fl I
E 22
Forces mail to run in interactive mode even when
D 22
input isn't a terminal.  In particular, the
E 22
I 22
input isn't a terminal.
In particular, the
E 22
.Sq Ic \&~
special
E 16
character when sending mail is only active in interactive mode.
D 16
The
E 12
.B \-n
flag inhibits the reading of /usr/lib/Mail.rc.
I 12
The
.B \-N
flag inhibits the initial display of message headers
E 16
I 16
D 22
.Tp Fl n
E 22
I 22
.It Fl n
E 22
D 18
Inhibits reading /usr/share/misc/Mail.rc upon startup.
E 18
I 18
Inhibits reading
D 26
.Pa /usr/share/misc/Mail.rc
E 26
I 26
.Pa /etc/mail.rc
E 26
upon startup.
E 18
D 22
.Tp Fl N
E 22
I 22
.It Fl N
E 22
Inhibits the initial display of message headers
E 16
when reading mail or editing a mail folder.
E 12
D 16
.PP
E 2
.I "Sending mail.\ "
E 16
I 16
D 22
.Tp Fl s
E 22
I 22
.It Fl s
E 22
Specify subject on command line
(only the first argument after the
D 18
Fl s
E 18
I 18
.Fl s
E 18
flag is used as a subject; be careful to quote subjects
containing spaces.)
D 22
.Tp Fl c
E 22
I 22
.It Fl c
E 22
Send carbon copies to
.Ar list
of users.
D 22
.Tp Fl b
E 22
I 22
.It Fl b
E 22
Send blind carbon copies to
.Ar list .
List should be a comma-separated list of names.
D 22
.Tp Fl f
E 22
I 22
.It Fl f
E 22
Read in the contents of your
.Ar mbox
(or the specified file)
for processing; when you
.Ar quit  ,
.Nm mail
writes undeleted messages back to this file.
D 22
.Tp Fl u
E 22
I 22
.It Fl u
E 22
Is equivalent to:
I 22
.Pp
E 22
D 17
.Dl mail -f /usr/spool/mail/user
E 17
I 17
D 31
.Dl mail -f /var/spool/mail/user
E 31
I 31
.Dl mail -f /var/mail/user
E 31
E 17
D 22
.Tp
E 22
I 22
.El
E 22
.Ss Sending mail
E 16
D 8
To send a message to one or more other people,
E 8
I 8
To send a message to one or more people,
E 8
D 16
.I mail
D 8
can be invoked with arguments which are the names of people to
send to.  You are then expected to type in your message, followed
E 8
I 8
can be invoked with arguments which are the names of people to 
whom the mail will be sent.  You are then expected to type in 
E 16
I 16
.Nm mail
can be invoked with arguments which are the names of people to
D 22
whom the mail will be sent.  You are then expected to type in
E 22
I 22
whom the mail will be sent.
You are then expected to type in
E 22
E 16
your message, followed
E 8
D 16
by an \s-2EOT\s0 (control\-D) at the beginning of a line.
I 2
A subject may be specified on the command line by using the
.B \-s
flag. (Only the first argument after the
.B \-s
flag is used as a subject; be careful to quote subjects
D 10
containing spaces.)
E 10
I 10
containing spaces.)  Lists of users to send carbon copies and
blind carbon copies to may be specified using the
.B \-c
and
.B \-b
options, respectively.  The single argument following the
flag is taken to be a comma-separated list of names.
E 10
E 2
The section below, labeled
.I "Replying to or originating mail,"
E 16
I 16
by an
.Sq Li control\-D
at the beginning of a line.
The section below
.Ar Replying to or originating mail ,
E 16
describes some features of
D 16
.I mail
E 16
I 16
.Nm mail
E 16
available to help you compose your letter.
D 16
.PP
.I "Reading mail.\ "
E 16
I 16
.Pp
.Ss Reading mail
E 16
D 2
In normal usage,
E 2
I 2
In normal usage
E 2
D 16
.I mail
E 16
I 16
.Nm mail
E 16
is given no arguments and checks your mail out of the
post office, then
D 2
printing out a one line header of each message there.
E 2
I 2
D 18
prints out a one line header of each message there.
E 18
I 18
prints out a one line header of each message found.
E 18
E 2
The current message is initially the first message (numbered 1)
and can be printed using the
D 16
.B print
command (which can be abbreviated \fBp\fR).
E 16
I 16
.Ic print
command (which can be abbreviated
D 22
.Cx \&(
.Ic p
.Cx \&)).
.Cx
E 22
I 22
.Ql Ic p ) .
E 22
E 16
You can move among the messages much as you move between lines in
D 2
.I ed,
E 2
I 2
D 16
.IR ed ,
E 2
with the commands `+' and `\-' moving backwards and forwards, and
E 16
I 16
D 22
.Xr ed 1 ,
E 22
I 22
.Xr \&ed 1 ,
E 22
with the commands
D 22
.Sq Ic \&+
E 22
I 22
.Ql Ic \&+
E 22
and
D 22
.Sq Ic \&\-
E 22
I 22
.Ql Ic \&\-
E 22
moving backwards and forwards, and
E 16
D 2
simple numbers typing the addressed message.
E 2
I 2
simple numbers.
E 2
D 16
.PP
.I "Disposing of mail.\ "
E 16
I 16
.Pp
.Ss Disposing of mail.
E 16
After examining a message you can
D 16
.B delete
(\fBd\fR)
E 16
I 16
.Ic delete
D 22
.Cx \&(
.Ic d
.Cx \&)
.Cx
E 22
I 22
.Ql Ic d )
E 22
E 16
the message or
D 16
.B reply
(\fBr\fR)
E 16
I 16
.Ic reply
D 22
.Cx \&(
.Ic r
.Cx \&)
.Cx
E 22
I 22
.Ql Ic r )
E 22
E 16
to it.
Deletion causes the
D 16
.I mail
E 16
I 16
.Nm mail
E 16
program to forget about the message.
D 2
This is not irreversible, the message can be
E 2
I 2
This is not irreversible; the message can be
E 2
D 16
.B undeleted
(\fBu\fR)
E 16
I 16
.Ic undeleted
D 22
.Cx \&(
.Ic u
.Cx \&)
.Cx
E 22
I 22
.Ql Ic u )
E 22
E 16
by giving its number, or the
D 16
.I mail
E 16
I 16
.Nm mail
E 16
session can be aborted by giving the
D 16
.B exit
(\fBx\fR)
E 16
I 16
.Ic exit
D 22
.Cx \&(
.Ic x
.Cx \&)
.Cx
E 22
I 22
.Ql Ic x )
E 22
E 16
command.
Deleted messages will, however, usually disappear never to be seen again.
D 16
.PP
.I "Specifying messages.\ "
E 16
I 16
.Pp
.Ss Specifying messages
E 16
Commands such as
D 16
.B print
E 16
I 16
.Ic print
E 16
and
D 16
.B delete
E 16
I 16
.Ic delete
E 16
D 2
often can be given a list of message numbers as argument to apply
E 2
I 2
can be given a list of message numbers as arguments to apply
E 2
to a number of messages at once.
D 16
Thus ``delete 1 2'' deletes messages 1 and 2, while ``delete 1\-5''
E 16
I 16
Thus
.Dq Li delete 1 2
deletes messages 1 and 2, while
.Dq Li delete 1\-5
E 16
deletes messages 1 through 5.
D 16
The special name ``*'' addresses all messages, and ``$'' addresses
E 16
I 16
The special name
D 22
.Sq Li \&*
E 22
I 22
.Ql Li \&*
E 22
addresses all messages, and
D 22
.Sq Li \&$
E 22
I 22
.Ql Li \&$
E 22
addresses
E 16
the last message; thus the command
D 16
.B top
E 16
I 16
.Ic top
E 16
which prints the first few lines of a message could be used in
D 16
``top *'' to print the first few lines of all messages.
.PP
.I "Replying to or originating mail.\ "
E 16
I 16
.Dq Li top \&*
to print the first few lines of all messages.
.Pp
.Ss Replying to or originating mail.
E 16
You can use the
D 16
.B reply
E 16
I 16
.Ic reply
E 16
command to
set up a response to a message, sending it back to the
person who it was from.
D 2
Text you then type in, up to an end-of-file (or a line consisting only
of a ``.'') defines the contents of
the message.
E 2
I 2
Text you then type in, up to an end-of-file,
defines the contents of the message.
E 2
While you are composing a message,
D 16
.I mail
treats lines beginning with the character `~' specially.
For instance, typing ``~m'' (alone on a line) will place a copy
E 16
I 16
.Nm mail
treats lines beginning with the character
D 22
.Sq Ic \&~
E 22
I 22
.Ql Ic \&~
E 22
specially.
For instance, typing
D 22
.Sq Ic \&~m
E 22
I 22
.Ql Ic \&~m
E 22
(alone on a line) will place a copy
E 16
D 10
of the current message into the response right shifting it by a tabstop.
E 10
I 10
of the current message into the response right shifting it by a tabstop
D 15
(see ``tabstr'' variable, below).
E 15
I 15
D 16
(see ``indentprefix'' variable, below).
E 16
I 16
(see
.Em indentprefix
variable, below).
E 16
E 15
E 10
Other escapes will set up subject fields, add and delete recipients
to the message and allow you to escape to an editor to revise the
D 22
message or to a shell to run some commands.  (These options
E 22
I 22
message or to a shell to run some commands.
(These options
E 22
D 2
will be given in the summary below.)
E 2
I 2
are given in the summary below.)
E 2
D 16
.PP
.I "Ending a mail processing session.\ "
E 16
I 16
.Pp
.Ss Ending a mail processing session.
E 16
You can end a
D 16
.I mail
E 16
I 16
.Nm mail
E 16
session with the
D 16
.B quit
(\fBq\fR)
E 16
I 16
.Ic quit
D 22
.Cx  \&(
.Ic q
.Cx \&)
.Cx
E 22
I 22
.Ql Ic q )
E 22
E 16
command.
Messages which have been examined go to your
D 16
.I mbox
E 16
I 16
.Ar mbox
E 16
file unless they have been deleted in which case they are discarded.
D 16
Unexamined messages go back to the post office.
The
.B \-f
option causes
.I mail
to read in the contents of your
.I mbox
(or the specified file)
for processing; when you
D 2
.B quit
E 2
I 2
.BR quit ,
E 2
.I mail
writes undeleted messages back to this file.
I 2
The
.B \-u
flag is a short way of doing
"mail
.B \-f
/usr/spool/mail/user".
E 2
.PP
.I "Personal and systemwide distribution lists.\ "
E 16
I 16
D 22
Unexamined messages go back to the post office. (See the
E 22
I 22
Unexamined messages go back to the post office.
(See the
E 22
.Fl f
option above).
.Pp
.Ss Personal and systemwide distribution lists.
E 16
It is also possible to create a personal distribution lists so that,
D 16
for instance, you can send mail to ``cohorts'' and have it go
E 16
I 16
for instance, you can send mail to
.Dq Li cohorts
and have it go
E 16
to a group of people.
Such lists can be defined by placing a line like
D 16
.IP
D 2
alias cohorts bill ozalp sklower jkf mark cory:kridle
E 2
I 2
alias cohorts bill ozalp jkf mark kridle@ucbcory
E 2
.PP
in the file \&.mailrc in your home directory.
E 16
I 16
.Pp
.Dl alias cohorts bill ozalp jkf mark kridle@ucbcory
.Pp
in the file
.Pa \&.mailrc
in your home directory.
E 16
D 2
The current list of such aliases can be displayed by the
E 2
I 2
The current list of such aliases can be displayed with the
E 2
D 16
.B alias
.B (a)
E 16
I 16
.Ic alias
E 16
command in
D 2
.I mail.
E 2
I 2
D 16
.IR mail .
E 16
I 16
.Nm mail  .
E 16
E 2
System wide distribution lists can be created by editing
D 18
/usr/lib/aliases, see
E 18
I 18
.Pa /etc/aliases ,
see
E 18
D 16
.IR aliases (5)
E 16
I 16
.Xr aliases  5
E 16
and
D 2
.IR delivermail (8);
these are kept in a slightly different syntax.
E 2
I 2
D 16
.IR sendmail (8);
E 16
I 16
.Xr sendmail  8  ;
E 16
these are kept in a different syntax.
E 2
In mail you send, personal aliases will be expanded in mail sent
D 16
to others so that they will be able to \fBreply\fR to the recipients.
System wide \fIaliases\fR are not expanded when the mail is sent,
E 16
I 16
to others so that they will be able to
.Ic reply
to the recipients.
System wide
.Ic aliases
are not expanded when the mail is sent,
E 16
but any reply returned to the machine will have the system wide
alias expanded as all mail goes through
D 2
.I delivermail.
If you edit
/usr/lib/aliases, you must run the program
.IR newaliases (1).
E 2
I 2
D 16
.IR sendmail .
E 2
.PP
.I "Network mail (ARPA, UUCP, Berknet)\ "
E 16
I 16
.Xr sendmail  .
.Pp
.Ss Network mail (ARPA, UUCP, Berknet)
E 16
D 2
Mail to sites on the ARPA network and sites within Bell laboratories
can be sent using ``name@site'' for ARPA-net sites or ``machine!user''
for Bell labs sites, provided appropriate gateways are known to the
system.  (Be sure to escape the ! in Bell sites when giving it on a
.I csh
command line by preceding it with an \e.
Machines on an instance of the Berkeley network are addressed as
``machine:user'', e.g. ``csvax:bill''.  When addressed from the
arpa-net, ``csvax:bill'' is known as ``csvax.bill@berkeley''.
E 2
I 2
See
D 16
.IR mailaddr(7)
E 16
I 16
.Xr mailaddr 7
E 16
for a description of network addresses.
E 2
D 16
.PP
.I Mail
E 16
I 16
.Pp
.Nm Mail
E 16
D 2
has a number of options which can be
.B set
in the
E 2
I 2
has a number of options which can be set in the
E 2
D 16
.I \&.mailrc
file to alter its behavior; thus ``set askcc'' enables the ``askcc''
E 16
I 16
D 22
.Pa \& .mailrc
E 22
I 22
.Pa .mailrc
E 22
file to alter its behavior; thus
.Dq Li set askcc
enables the
.Ar askcc
E 16
D 22
feature.  (These options are summarized below.)
E 22
I 22
feature.
(These options are summarized below.)
E 22
D 16
.SH SUMMARY
E 16
I 16
.Sh SUMMARY
E 16
(Adapted from the `Mail Reference Manual')
I 2
D 16
.PP
E 16
I 16
.Pp
E 16
E 2
Each command is typed on a line by itself, and may take arguments
D 22
following the command word.  The command need not be typed in its
E 22
I 22
following the command word.
The command need not be typed in its
E 22
entirety \- the first command which matches the typed prefix is used.
D 2
For the commands which take message lists as arguments, if no message
E 2
I 2
For commands which take message lists as arguments, if no message
E 2
list is given, then the next message forward which satisfies the
D 22
command's requirements is used.  If there are no messages forward of
E 22
I 22
command's requirements is used.
If there are no messages forward of
E 22
the current message, the search proceeds backwards, and if there are no
good messages at all,
D 16
.I mail
types ``No applicable messages'' and
E 16
I 16
.Nm mail
types
.Dq Li No applicable messages
and
E 16
aborts the command.
D 16
.TP 12n
.B \-
Goes to the previous message and prints it out.  If given a numeric
E 16
I 16
D 22
.Tp Ic \&\-
Print out the preceding message.  If given a numeric
E 22
I 22
.Bl -tag -width delete
.It Ic \&\-
Print out the preceding message.
If given a numeric
E 22
E 16
argument
D 2
.I n ,
E 2
I 2
D 16
.IR n ,
E 16
I 16
.Ar n  ,
E 16
E 2
goes to the
D 2
.I n th
E 2
I 2
D 16
.IR n -th
E 16
I 16
D 22
.Cx Ar n
.Cx \'th
.Cx
E 22
I 22
.Ar n Ns 'th
E 22
E 16
E 2
previous message and prints it.
D 16
.TP
.B ?
E 16
I 16
D 22
.Tp Ic \&?
E 22
I 22
.It Ic \&?
E 22
E 16
Prints a brief summary of commands.
D 16
.TP
.B !
Executes the \s-2UNIX\s0 shell command which follows.
.TP
I 2
.B Print
(\fBP\fR)
E 16
I 16
D 22
.Tp Ic \&!
E 22
I 22
.It Ic \&!
E 22
Executes the shell
(see
.Xr sh 1
and
.Xr csh 1 )
command which follows.
D 22
.Tp Ic Print
.Cx \&(
.Ic P
.Cx \&)
.Cx
E 22
I 22
.It Ic Print
.Pq Ic P
E 22
E 16
Like
D 16
.B print
E 16
I 16
.Ic print
E 16
D 22
but also prints out ignored header fields. See also
E 22
I 22
but also prints out ignored header fields.
See also
E 22
D 16
.B print
I 3
,
.B ignore
E 16
I 16
.Ic print ,
.Ic ignore
E 16
E 3
and
D 3
.B ignore.
E 3
I 3
D 16
.B retain.
E 3
.TP
.B Reply
D 7
(\fRR\fR)
E 7
I 7
(\fBR\fR)
E 16
I 16
.Ic retain .
D 22
.Tp Ic Reply
.Cx \&(
.Ic R
.Cx \&)
.Cx
E 16
E 7
Reply to originator. Does not reply to other
E 22
I 22
.It Ic Reply
.Pq Ic R
Reply to originator.
Does not reply to other
E 22
recipients of the original message.
D 16
.TP
.B Type
D 7
(\fTT\fR)
E 7
I 7
(\fBT\fR)
E 16
I 16
D 22
.Tp Ic Type
.Cx \&(
.Ic T
.Cx \&)
.Cx
E 22
I 22
.It Ic Type
.Pq Ic T
E 22
E 16
E 7
Identical to the
D 16
.B Print
E 16
I 16
.Ic Print
E 16
command.
D 16
.TP
E 2
.B alias
(\fBa\fR) With no arguments, prints out all currently-defined aliases.  With one
E 16
I 16
D 22
.Tp Ic alias
.Cx \&(
.Ic a
.Cx \&)
.Cx
With no arguments, prints out all currently-defined aliases.  With one
E 16
D 2
argument, prints out that alias.  With more than one argument, adds the
users named in the second and later arguments to the alias named in the
first argument.
E 2
I 2
argument, prints out that alias.  With more than one argument, creates
E 22
I 22
.It Ic alias
.Pq Ic a
With no arguments, prints out all currently-defined aliases.
With one
argument, prints out that alias.
With more than one argument, creates
E 22
D 10
an new or changes an on old alias.
E 10
I 10
a new alias or changes an old one.
E 10
E 2
D 16
.TP
I 2
.B alternates
(\fBalt\fR)
E 16
I 16
D 22
.Tp Ic alternates
.Cx \&(
.Ic alt
.Cx \&)
.Cx
E 22
I 22
.It Ic alternates
.Pq Ic alt
E 22
E 16
The
D 16
.B alternates
E 16
I 16
.Ic alternates
E 16
command is useful if you have accounts on several machines.
It can be used to inform
D 16
.I mail
E 16
I 16
.Nm mail
E 16
D 22
that the listed addresses are really you. When you
E 22
I 22
that the listed addresses are really you.
When you
E 22
D 16
.B reply
E 16
I 16
.Ic reply
E 16
to messages,
D 16
.I mail
E 16
I 16
.Nm mail
E 16
will not send a copy of the message to any of the addresses
listed on the
D 16
.I alternates
E 16
I 16
.Ic alternates
E 16
D 22
list. If the
E 22
I 22
list.
If the
E 22
D 16
.B alternates
E 16
I 16
.Ic alternates
E 16
command is given with no argument, the current set of alternate
names is displayed.
D 16
.TP
E 2
.B chdir
(\fBc\fR) Changes the user's working directory to that specified, if given.  If
E 16
I 16
D 22
.Tp Ic chdir
.Cx \&(
.Ic c
.Cx \&)
.Cx
Changes the user's working directory to that specified, if given.  If
E 22
I 22
.It Ic chdir
.Pq Ic c
Changes the user's working directory to that specified, if given.
If
E 22
E 16
no directory is given, then changes to the user's login directory.
D 16
.TP
I 2
.B copy
(\fBco\fR)
E 16
I 16
D 22
.Tp Ic copy
.Cx \&(
.Ic co
.Cx \&)
.Cx
E 22
I 22
.It Ic copy
.Pq Ic co
E 22
E 16
The
D 16
.B copy
E 16
I 16
.Ic copy
E 16
command does the same thing that
D 16
.B save 
E 16
I 16
.Ic save
E 16
does, except that it does not mark the messages it
is used on for deletion when you quit.
D 16
.TP
E 2
.B delete
(\fBd\fR) Takes a list of messages as argument and marks them all as deleted.
E 16
I 16
D 22
.Tp Ic delete
.Cx \&(
.Ic d
.Cx \&)
.Cx
E 22
I 22
.It Ic delete
.Pq Ic d
E 22
Takes a list of messages as argument and marks them all as deleted.
E 16
Deleted messages will not be saved in
D 2
.I mbox ,
E 2
I 2
D 16
.IR mbox ,
E 2
nor will they be available for most other commands.  
.TP
.B dp
(also \fBdt\fR) Deletes the current message and prints the next message.
If there is no next message, 
.I mail
says ``at EOF.''
.TP
.B edit
(\fBe\fR) Takes a list of messages and points the text editor at each one in
E 16
I 16
.Ar mbox  ,
nor will they be available for most other commands.
D 22
.Tp Ic dp
E 22
I 22
.It Ic dp
E 22
(also
.Ic dt )
Deletes the current message and prints the next message.
If there is no next message,
.Nm mail
says
D 22
.Dq Li at EOF.
.Tp Ic edit
.Cx \&(
.Ic e
.Cx \&)
.Cx
E 22
I 22
.Dq Li "at EOF" .
.It Ic edit
.Pq Ic e
E 22
Takes a list of messages and points the text editor at each one in
E 16
D 22
turn.  On return from the editor, the message is read back in.
D 16
.TP
.B exit
(\fBex\fR or \fBx\fR) Effects an immediate return to the Shell without
E 16
I 16
.Tp Ic exit
.Cx \&(
.Ic ex
.Cx
E 22
I 22
turn.
On return from the editor, the message is read back in.
.It Ic exit
.Pf ( Ic ex
E 22
or
.Ic x )
Effects an immediate return to the Shell without
E 16
modifying the user's system mailbox, his
D 16
.I mbox
E 16
I 16
.Ar mbox
E 16
file, or his edit file in
D 2
.B \-f .
E 2
I 2
D 16
.BR \-f .
E 2
.TP
I 2
.B file
(\fBfi\fR)
E 16
I 16
.Fl f  .
D 22
.Tp Ic file
.Cx \&(
.Ic fi
.Cx )
.Cx
E 22
I 22
.It Ic file
.Pq Ic fi
E 22
E 16
The same as
D 16
.BR folder .
.TP
.B folders
E 16
I 16
.Ic folder  .
D 22
.Tp Ic folders
E 22
I 22
.It Ic folders
E 22
E 16
List the names of the folders in your folder directory.
D 16
.TP
.B folder
(\fBfo\fR)
E 16
I 16
D 22
.Tp Ic folder
.Cx \&(
.Ic fo
.Cx \&)
.Cx
E 22
I 22
.It Ic folder
.Pq Ic fo
E 22
E 16
The
D 16
.B folder
E 16
I 16
.Ic folder
E 16
D 22
command switches to a new mail file or folder. With no
E 22
I 22
command switches to a new mail file or folder.
With no
E 22
arguments, it tells you which file you are currently reading.
If you give it an argument, it will write out changes (such
as deletions) you have made in the current file and read in
D 22
the new file. Some special conventions are recognized for
the name. # means the previous file, % means your system
E 22
I 22
the new file.
Some special conventions are recognized for
the name.
# means the previous file, % means your system
E 22
mailbox, %user means user's system mailbox, & means
D 12
your \~/mbox file, and +folder means a file in your folder
E 12
I 12
D 16
your \fImbox\fP file, and +folder means a file in your folder
E 16
I 16
your
.Ar mbox
D 22
file, and +folder means a file in your folder
E 22
I 22
file, and
\&+\&folder means a file in your folder
E 22
E 16
E 12
directory.
D 16
.TP
E 2
.B from
(\fBf\fR) Takes a list of messages and prints their message headers.
.TP
.B headers
D 10
(\fBh\fR) Lists the current range of headers, which is an 18 message group.  If
a ``+'' argument is given, then the next 18 message group is printed, and if
a ``\-'' argument is given, the previous 18 message group is printed.
E 10
I 10
(\fBh\fR) Lists the current range of headers, which is an 18\-message group.  If
a ``+'' argument is given, then the next 18\-message group is printed, and if
a ``\-'' argument is given, the previous 18\-message group is printed.
E 10
.TP
.B help
A synonym for ?
.TP
.B hold
(\fBho\fR, also \fBpreserve\fR) Takes a message list and marks each
E 16
I 16
D 22
.Tp Ic from
.Cx \&(
.Ic f
.Cx \&)
.Cx
E 22
I 22
.It Ic from
.Pq Ic f
E 22
Takes a list of messages and prints their message headers.
D 22
.Tp Ic headers
.Cx \&(
.Ic h
.Cx \&)
.Cx
Lists the current range of headers, which is an 18\-message group.  If
E 22
I 22
.It Ic headers
.Pq Ic h
Lists the current range of headers, which is an 18\-message group.
If
E 22
a
D 22
.Sq Li \&+
E 22
I 22
.Ql \&+
E 22
argument is given, then the next 18\-message group is printed, and if
a
D 22
.Sq Li \&\-
E 22
I 22
.Ql \&\-
E 22
argument is given, the previous 18\-message group is printed.
D 22
.Tp Ic help
E 22
I 22
.It Ic help
E 22
A synonym for
.Ic \&?
I 27
.ne 1i
E 27
D 22
.Tp Ic hold
.Cx \&(
.Ic ho  ,
.Cx
E 22
I 22
.It Ic hold
.Pf ( Ic ho ,
E 22
also
.Ic preserve )
Takes a message list and marks each
E 16
message therein to be saved in the
user's system mailbox instead of in
D 2
.I mbox.
E 2
I 2
D 16
.IR mbox .
E 16
I 16
.Ar mbox  .
E 16
E 2
Does not override the
D 16
.B delete
E 16
I 16
.Ic delete
E 16
command.
D 16
.TP
I 2
.B ignore
I 3
.B N.B.:
.I Ignore
E 16
I 16
D 22
.Tp Ic ignore
E 22
I 22
.It Ic ignore
E 22
D 21
.Sy N.B.:
.Ic Ignore
E 16
has been superseded by
D 16
.I retain.
E 16
I 16
.Ic retain .
E 16
.br
E 21
E 3
Add the list of header fields named to the
D 16
.IR "ignored list" .
E 16
I 16
D 25
.Ar ignored list
E 25
I 25
.Ar ignored list .
E 25
E 16
Header fields in the ignore list are not printed
D 22
on your terminal when you print a message. This
E 22
I 22
on your terminal when you print a message.
This
E 22
command is very handy for suppression of certain machine-generated
D 22
header fields. The
E 22
I 22
header fields.
The
E 22
D 16
.B Type
E 16
I 16
.Ic Type
E 16
and
D 16
.B Print
E 16
I 16
.Ic Print
E 16
commands can be used to print a message in its entirety, including
D 22
ignored fields. If
E 22
I 22
ignored fields.
If
E 22
D 16
.B ignore
E 16
I 16
.Ic ignore
E 16
is executed with no arguments, it lists the current set of
ignored fields.
I 28
.It Ic inc
Incorporate any new messages that have arrived while mail
is being read.
The new messages are added to the end of the message list,
and the current message is reset to be the first new mail message.
This does not renumber the existing message list, nor does
does it cause any changes made so far to be saved.
E 28
D 16
.TP
E 2
.B mail
(\fBm\fR) Takes as argument login names and distribution group names and sends
E 16
I 16
D 22
.Tp Ic mail
.Cx \&(
.Ic m
.Cx \&)
.Cx
E 22
I 22
.It Ic mail
.Pq Ic m
E 22
Takes as argument login names and distribution group names and sends
E 16
mail to those people.
D 16
.TP
I 2
.B mbox
E 16
I 16
D 22
.Tp Ic mbox
E 22
I 22
.It Ic mbox
E 22
E 16
Indicate that a list of messages be sent to
D 16
.I mbox
E 16
I 16
.Ic mbox
E 16
D 22
in your home directory when you quit. This is the default
E 22
I 22
in your home directory when you quit.
This is the default
E 22
action for messages if you do
D 16
.I not
E 16
I 16
.Em not
E 16
have the
D 16
.I hold
E 16
I 16
.Ic hold
E 16
option set.
D 16
.TP
E 2
.B next
(\fBn\fR like \fB+\fR or CR) Goes to the next message in sequence and types it.
E 16
I 16
D 22
.Tp Ic next
.Cx \&(
.Ic n
.Cx
E 22
I 22
.It Ic next
.Pq Ic n
E 22
like
.Ic \&+
D 22
or CR) Goes to the next message in sequence and types it.
E 22
I 22
or
.Tn CR )
Goes to the next message in sequence and types it.
E 22
E 16
With an argument list, types the next matching message.
D 16
.TP
.B preserve
I 2
(\fBpre\fR)
E 16
I 16
D 22
.Tp Ic preserve
.Cx \&(
.Ic pre
.Cx \&)
.Cx
E 22
I 22
.It Ic preserve
.Pq Ic pre
E 22
E 16
E 2
A synonym for
D 2
.B hold.
E 2
I 2
D 16
.BR hold .
E 2
.TP
.B print
D 2
(\fBp\fR) Takes a message list and types out each message on the user's
terminal.
E 2
I 2
(\fBp\fR)
E 16
I 16
.Ic hold  .
D 22
.Tp Ic print
.Cx \&(
.Ic p
.Cx \&)
.Cx
E 22
I 22
.It Ic print
.Pq Ic p
E 22
E 16
Takes a message list and types out each message on the user's terminal.
E 2
D 16
.TP
.B quit
(\fBq\fR) Terminates the session, saving all undeleted, unsaved messages in
E 16
I 16
D 22
.Tp Ic quit
.Cx \&(
.Ic q
.Cx \&)
.Cx
E 22
I 22
.It Ic quit
.Pq Ic q
E 22
Terminates the session, saving all undeleted, unsaved messages in
E 16
the user's
D 16
.I mbox
E 16
I 16
.Ar mbox
E 16
file in his login directory, preserving all messages marked with
D 16
.B hold
E 16
I 16
.Ic hold
E 16
or
D 16
.B preserve
E 16
I 16
.Ic preserve
E 16
or never referenced
in his system mailbox, and removing all other messages from his system
D 22
mailbox.  If new mail has arrived during the session, the message
D 16
``You have new mail'' is given.  If given while editing a
E 16
I 16
D 18
.Dq LI You have new mail
E 18
I 18
.Dq Li You have new mail
E 18
is given.  If given while editing a
E 22
I 22
mailbox.
If new mail has arrived during the session, the message
.Dq Li "You have new mail"
is given.
If given while editing a
E 22
E 16
mailbox file with the
D 16
.B \-f
E 16
I 16
.Fl f
E 16
D 22
flag, then the edit file is rewritten.  A return to the Shell is
E 22
I 22
flag, then the edit file is rewritten.
A return to the Shell is
E 22
effected, unless the rewrite of edit file fails, in which case the user
can escape with the
D 16
.B exit
E 16
I 16
.Ic exit
E 16
command.
D 16
.TP
.B reply
D 2
(\fBr\fR) Takes a message list and sends mail to each message author just like
the
.B mail
command.  The default message must not be deleted.
E 2
I 2
(\fBr\fR)
E 16
I 16
D 22
.Tp Ic reply
.Cx \&(
.Ic r
.Cx \&)
.Cx
E 22
I 22
.It Ic reply
.Pq Ic r
E 22
E 16
Takes a message list and sends mail to the sender and all
recipients of the specified message.
The default message must not be deleted.
E 2
D 16
.TP
.B respond
E 16
I 16
D 22
.Tp Ic respond
E 22
I 22
.It Ic respond
E 22
E 16
A synonym for
D 2
.B reply .
E 2
I 2
D 16
.BR reply .
E 2
.TP
I 3
.B retain
E 16
I 16
.Ic reply  .
D 22
.Tp Ic retain
E 22
I 22
.It Ic retain
E 22
E 16
Add the list of header fields named to the
D 16
.IR "retained list" .
E 16
I 16
.Ar retained list
E 16
Only the header fields in the retain list
are shown on your terminal when you print a message.
All other header fields are suppressed.
The
D 16
.B Type
E 16
I 16
.Ic Type
E 16
and
D 16
.B Print
E 16
I 16
.Ic Print
E 16
commands can be used to print a message in its entirety.
If
D 16
.B retain
E 16
I 16
.Ic retain
E 16
is executed with no arguments, it lists the current set of
retained fields.
D 16
.TP
E 3
.B save
(\fBs\fR) Takes a message list and a filename and appends each message in
E 16
I 16
D 22
.Tp Ic save
.Cx \&(
.Ic s
.Cx \&)
.Cx
E 22
I 22
.It Ic save
.Pq Ic s
E 22
Takes a message list and a filename and appends each message in
E 16
D 22
turn to the end of the file.  The filename in quotes, followed by the line
E 22
I 22
turn to the end of the file.
The filename in quotes, followed by the line
E 22
D 16
count and character count is echoed on the user's terminal.  
.TP
.B set
(\fBse\fR) With no arguments, prints all variable values.  Otherwise, sets
E 16
I 16
count and character count is echoed on the user's terminal.
D 22
.Tp Ic set
.Cx \&(
.Ic se
.Cx \&)
.Cx
With no arguments, prints all variable values.  Otherwise, sets
E 16
option.  Arguments are of the form
E 22
I 22
.It Ic set
.Pq Ic se
With no arguments, prints all variable values.
Otherwise, sets
option.
Arguments are of the form
E 22
D 16
``option=value''
E 16
I 16
.Ar option=value
E 16
D 3
or
E 3
I 3
(no space before or after =) or
E 3
D 16
``option.''
E 16
I 16
.Ar option .
E 16
I 10
Quotation marks may be placed around any part of the assignment statement to
D 15
quote blanks or tabs, i.e. ``set tabstr="-> "''.
E 15
I 15
D 16
quote blanks or tabs, i.e. ``set indentprefix="-> "''.
E 15
E 10
.TP
I 9
.B saveignore
\fBSaveignore\fP is to \fBsave\fP what \fBignore\fP is to \fBprint\fP
and \fBtype\fP.  Header fields thus marked are filtered out when
D 12
saving a message by \fBsave\fP or when automatically saving to mbox.
E 12
I 12
saving a message by \fBsave\fP or when automatically saving to \fImbox\fP.
E 12
.TP
.B saveretain
\fBSaveretain\fP is to \fBsave\fP what \fBretain\fP is to \fBprint\fP
and \fBtype\fP.  Header fields thus marked are the only ones saved
D 12
with a message when saving by \fBsave\fP or when automatically saving to mbox.
E 12
I 12
with a message when saving by \fBsave\fP or when automatically saving to
\fImbox\fP.
E 12
\fBSaveretain\fP overrides \fBsaveignore\fP.
.TP
E 9
.B shell
(\fBsh\fR) Invokes an interactive version of the shell.
.TP
.B size
E 16
I 16
quote blanks or tabs, i.e.
D 18
.Dq Li set indentprefix=\*(Lq \*(Rq
E 18
I 18
D 22
.Dq Li set indentprefix="->"
E 18
.Tp Ic saveignore
E 22
I 22
.Dq Li "set indentprefix=\*q->\*q"
.It Ic saveignore
E 22
.Ic Saveignore
is to
.Ic save
what
.Ic ignore
is to
.Ic print
and
.Ic type  .
Header fields thus marked are filtered out when
saving a message by
.Ic save
or when automatically saving to
.Ar mbox  .
I 27
.pl +1
E 27
D 22
.Tp Ic saveretain
E 22
I 22
.It Ic saveretain
E 22
.Ic Saveretain
is to
.Ic save
what
.Ic retain
is to
.Ic print
and
.Ic type  .
Header fields thus marked are the only ones saved
with a message when saving by
.Ic save
or when automatically saving to
.Ar mbox  .
.Ic Saveretain
overrides
.Ic saveignore  .
D 22
.Tp Ic shell
.Cx \&(
.Ic sh
.Cx \&)
.Cx
E 22
I 22
.It Ic shell
.Pq Ic sh
E 22
Invokes an interactive version of the shell.
D 22
.Tp Ic size
E 22
I 22
.It Ic size
E 22
E 16
Takes a message list and prints out the size in characters of each
message.
D 16
.TP
I 2
.B source
(\fBso\fR)
E 16
I 16
D 22
.Tp Ic source
.Cx \&(
.Ic so
.Cx \&)
E 22
I 22
.It Ic source
E 22
E 16
The
D 16
.B source
E 16
I 16
.Ic source
E 16
command reads
D 16
.I mail
E 16
I 16
D 22
.Nm mail
E 22
E 16
commands from a file.
D 16
.TP
E 2
.B top
E 16
I 16
D 22
.Tp Ic top
E 16
Takes a message list and prints the top few lines of each.  The number of
E 22
I 22
.It Ic top
Takes a message list and prints the top few lines of each.
The number of
E 22
lines printed is controlled by the variable
D 16
.B toplines
E 16
I 16
.Ic toplines
E 16
and defaults to five.
D 16
.TP
.B type
(\fBt\fR) A synonym for
D 2
.B print .
E 2
I 2
.BR print .
E 2
.TP
.B unalias
E 16
I 16
D 22
.Tp Ic type
.Cx \&(
.Ic t
.Cx \&)
.Cx
E 22
I 22
.It Ic type
.Pq Ic t
E 22
A synonym for
.Ic print  .
D 22
.Tp Ic unalias
E 22
I 22
.It Ic unalias
E 22
E 16
Takes a list of names defined by
D 16
.B alias
E 16
I 16
.Ic alias
E 16
D 22
commands and discards the remembered groups of users.  The group names
E 22
I 22
commands and discards the remembered groups of users.
The group names
E 22
no longer have any significance.
D 16
.TP
.B undelete
D 5
(\fBu\fR) Takes a message list and marks each one as
E 5
I 5
(\fBu\fR) Takes a message list and marks each message as
E 5
.I not
E 16
I 16
D 22
.Tp Ic undelete
.Cx \&(
.Ic u
.Cx \&)
.Cx
E 22
I 22
.It Ic undelete
.Pq Ic u
E 22
Takes a message list and marks each message as
.Ic not
E 16
being deleted.
D 16
.TP
I 5
.B unread
(\fBU\fR) Takes a message list and marks each message as
.I not
E 16
I 16
D 22
.Tp Ic unread
.Cx \&(
.Ic U
.Cx \&)
.Cx
E 22
I 22
.It Ic unread
.Pq Ic U
E 22
Takes a message list and marks each message as
.Ic not
E 16
having been read.
D 16
.TP
E 5
.B unset
E 16
I 16
D 22
.Tp Ic unset
E 22
I 22
.It Ic unset
E 22
E 16
Takes a list of option names and discards their remembered values;
the inverse of
D 2
.B set .
E 2
I 2
D 16
.BR set .
E 2
.TP
.B visual
(\fBv\fR) Takes a message list and invokes the display editor on each message.
.TP
.B write
D 4
(\fBw\fR) A synonym for
D 2
.B save .
E 2
I 2
.BR save .
E 4
I 4
(\fBw\fR) Similar to
.BR save ,
E 16
I 16
.Ic set  .
D 22
.Tp Ic visual
.Cx \&(
.Ic v
.Cx \&)
.Cx
E 22
I 22
.It Ic visual
.Pq Ic v
E 22
Takes a message list and invokes the display editor on each message.
D 22
.Tp Ic write
.Cx \&(
.Ic w
.Cx \&)
.Cx
E 22
I 22
.It Ic write
.Pq Ic w
E 22
Similar to
.Ic save  ,
E 16
except that
D 16
.I only
the message body (\fIwithout\fP the header) is saved.
E 16
I 16
.Ic only
the message body
D 22
.Cx \&(
.Ar without
.Cx
E 22
I 22
.Pq Ar without
E 22
the header) is saved.
E 16
Extremely useful for such tasks as sending and receiving source
program text over the message system.
E 4
E 2
D 16
.TP
.B xit
(\fBx\fR) A synonym for
D 2
.B exit .
E 2
I 2
.BR exit .
.TP
.B z
.I Mail
E 16
I 16
D 22
.Tp Ic xit
.Cx \&(
.Ic x
.Cx \&)
.Cx
E 22
I 22
.It Ic xit
.Pq Ic x
E 22
A synonym for
.Ic exit  .
D 22
.Tp Ic z
E 22
I 22
.It Ic z
E 22
.Nm Mail
E 16
presents message headers in windowfuls as described under the
D 16
.B headers
E 16
I 16
.Ic headers
E 16
D 22
command. You can move
D 16
.IR mail 's
E 16
I 16
.Cx Nm mail
.Cx 's
.Cx
E 22
I 22
command.
You can move
.Nm mail Ns 's
E 22
E 16
attention forward to the next window with the
D 16
.B z
E 16
I 16
.Ic \&z
E 16
D 22
command. Also, you can move to the previous window by using
E 22
I 22
command.
Also, you can move to the previous window by using
E 22
D 16
.BR z\- .
E 2
.PP
E 16
I 16
.Ic \&z\&\-  .
D 22
.Tp
E 22
I 22
.El
E 22
.Ss Tilde/Escapes
.Pp
E 16
Here is a summary of the tilde escapes,
which are used when composing messages to perform
D 22
special functions.  Tilde escapes are only recognized at the beginning
of lines.  The name
E 22
I 22
special functions.
Tilde escapes are only recognized at the beginning
of lines.
The name
E 22
D 16
``tilde\ escape''
E 16
I 16
.Dq Em tilde\ escape
E 16
is somewhat of a misnomer since the actual escape character can be set
by the option
D 16
.B escape.
.TP 12n
D 2
\fB~!\fRcommand
E 2
I 2
.BR ~! command
E 16
I 16
.Ic escape .
D 22
.Tw Ds
.Tp Cx Ic \&~!
.Ar command
.Cx
E 22
I 22
.Bl -tag -width Ds
.It Ic \&~! Ns Ar command
E 22
E 16
E 2
Execute the indicated shell command, then return to the message.
D 16
.TP
I 6
\fB~b\fR name ...
E 16
I 16
D 22
.Tp Cx Ic \&~b
.Ar name ...
.Cx
E 22
I 22
.It Ic \&~b Ns Ar name ...
E 22
E 16
Add the given names to the list of carbon copy recipients but do not make
the names visible in the Cc: line ("blind" carbon copy).
D 16
.TP
E 6
\fB~c\fR name ...
E 16
I 16
D 22
.Tp Cx Ic \&~c
.Ar name ...
.Cx
E 22
I 22
.It Ic \&~c Ns Ar name ...
E 22
E 16
Add the given names to the list of carbon copy recipients.
D 16
.TP
.B ~d
Read the file ``dead.letter'' from your home directory into the message.
.TP
.B ~e
E 16
I 16
D 22
.Tp Ic \&~d
E 22
I 22
.It Ic \&~d
E 22
Read the file
.Dq Pa dead.letter
from your home directory into the message.
D 22
.Tp Ic \&~e
E 16
Invoke the text editor on the message collected so far.  After the
E 22
I 22
.It Ic \&~e
Invoke the text editor on the message collected so far.
After the
E 22
editing session is finished, you may continue appending text to the
message.
D 16
.TP
I 2
\fB~f\fR messages
E 16
I 16
D 22
.Tp Cx Ic \&~f
.Ar messages
.Cx
E 22
I 22
.It Ic \&~f Ns Ar messages
E 22
E 16
Read the named messages into the message being sent.
If no messages are specified, read in the current message.
I 12
D 16
Message headers currently being ignored (by the \fIignore\fP or \fIretain\fP
E 16
I 16
Message headers currently being ignored (by the
.Ic ignore
or
.Ic retain
E 16
command) are not included.
I 27
.ne 1i
E 27
E 12
D 16
.TP
I 12
\fB~F\fR messages
Identical to \fB~f\fP, except all message headers are included.
.TP
E 12
E 2
.B ~h
E 16
I 16
D 22
.Tp Cx Ic \&~F
.Ar messages
.Cx
E 22
I 22
.It Ic \&~F Ns Ar messages
E 22
Identical to
D 18
Ic \&~f ,
E 18
I 18
.Ic \&~f ,
E 18
except all message headers are included.
D 22
.Tp Ic \&~h
E 22
I 22
.It Ic \&~h
E 22
E 16
Edit the message header fields by typing each one in turn and allowing
the user to append text to the end or modify the field by using the
current terminal erase and kill characters.
D 16
.TP
\fB~m\fR messages
E 16
I 16
D 22
.Tp Cx Ic \&~m
.Ar messages
.Cx
E 22
I 22
.It Ic \&~m Ns Ar messages
E 22
E 16
D 15
Read the named messages into the message being sent, shifted right one
D 12
tab.  If no messages are specified, read the current message.
E 12
I 12
tab or by the value of \fItabstr\fP.  If no messages are specified,
E 15
I 15
Read the named messages into the message being sent, indented by a
D 16
tab or by the value of \fIindentprefix\fP.  If no messages are specified,
E 16
I 16
tab or by the value of
.Ar indentprefix  .
If no messages are specified,
E 16
E 15
read the current message.
D 16
Message headers currently being ignored (by the \fIignore\fP or \fIretain\fP
E 16
I 16
Message headers currently being ignored (by the
.Ic ignore
or
.Ic retain
E 16
command) are not included.
E 12
D 16
.TP
I 12
\fB~M\fR messages
Identical to \fB~m\fP, except all message headers are included.
.TP
E 12
.B ~p
E 16
I 16
D 22
.Tp Cx Ic \&~M
.Ar messages
.Cx
E 22
I 22
.It Ic \&~M Ns Ar messages
E 22
Identical to
.Ic \&~m ,
except all message headers are included.
D 22
.Tp Ic \&~p
E 22
I 22
.It Ic \&~p
E 22
E 16
Print out the message collected so far, prefaced by the message header
fields.
D 16
.TP
.B ~q
E 16
I 16
D 22
.Tp Ic \&~q
E 22
I 22
.It Ic \&~q
E 22
E 16
Abort the message being sent, copying the message to
D 16
``dead.letter''
E 16
I 16
.Dq Pa dead.letter
E 16
in your home directory if
D 16
.B save
E 16
I 16
.Ic save
E 16
is set.
D 16
.TP
\fB~r\fR filename
E 16
I 16
D 22
.Tp Cx Ic \&~r
.Ar filename
.Cx
E 22
I 22
.It Ic \&~r Ns Ar filename
E 22
E 16
Read the named file into the message.
D 16
.TP
\fB~s\fR string
E 16
I 16
D 18
.Tp Ic \&~s
string
E 18
I 18
D 22
.Tp Cx Ic \&~s
.Ar string
.Cx
E 22
I 22
.It Ic \&~s Ns Ar string
E 22
E 18
E 16
Cause the named string to become the current subject field.
D 16
.TP
\fB~t\fR name ...
E 16
I 16
D 22
.Tp Cx Ic \&~\&t
.Ar name ...
.Cx
E 22
I 22
.It Ic \&~\&t Ns Ar name ...
E 22
E 16
Add the given names to the direct recipient list.
D 16
.TP
.B ~v
E 16
I 16
D 22
.\" This .br should have to be here
.br
.Tp Ic \&~\&v
E 16
Invoke an alternate editor (defined by the VISUAL option) on the
message collected so far.  Usually, the alternate editor will be a
screen editor.  After you quit the editor, you may resume appending
E 22
I 22
.It Ic \&~\&v
Invoke an alternate editor (defined by the
.Ev VISUAL
option) on the
message collected so far.
Usually, the alternate editor will be a
screen editor.
After you quit the editor, you may resume appending
E 22
text to the end of your message.
D 16
.TP
\fB~w\fR filename
E 16
I 16
D 22
.Tp Cx Ic \&~w
.Ar filename
.Cx
E 22
I 22
.It Ic \&~w Ns Ar filename
E 22
E 16
Write the message onto the named file.
D 16
.TP
\fB~\||\|\fRcommand
E 16
I 16
D 18
.Tp Cx Ic \&~\\
E 18
I 18
D 22
.Tp Cx Ic \&~\&|
E 18
.Ar command
.Cx
E 16
Pipe the message through the command as a filter.  If the command gives
E 22
I 22
.It Ic \&~\&| Ns Ar command
Pipe the message through the command as a filter.
If the command gives
E 22
no output or terminates abnormally, retain the original text of the
D 22
message.  The command
D 16
.IR fmt (1)
E 16
I 16
.Xr fmt  1
E 22
I 22
message.
The command
.Xr fmt 1
E 22
E 16
is often used as
D 16
.I command
E 16
I 16
.Ic command
E 16
to rejustify the message.
D 16
.TP
I 12
\fB~:\fR mail-command
E 16
I 16
D 22
.Tp Cx Ic \&~:
.Ar mail-command
.Cx
E 16
Execute the given mail command.  Not all commands, however, are allowed.
D 16
.TP
E 12
D 2
\fB~~\fRstring
E 2
I 2
.BR ~~ string
E 16
I 16
.Tp Cx Ic \&~~
.Ar string
.Cx
E 16
E 2
Insert the string of text in the message prefaced by a single ~.  If
E 22
I 22
.It Ic \&~: Ns Ar mail-command
Execute the given mail command.
Not all commands, however, are allowed.
.It Ic \&~~ Ns Ar string
Insert the string of text in the message prefaced by a single ~.
If
E 22
you have changed the escape character, then you should double
that character in order to send it.
D 16
.PP
Options are controlled via the
.B set
E 16
I 16
D 22
.Tp
E 22
I 22
.El
E 22
.Ss Mail Options
Options are controlled via
.Ic set
E 16
and
D 16
.B unset
E 16
I 16
.Ic unset
E 16
D 22
commands.  Options may be either binary, in which case it is only
E 22
I 22
commands.
Options may be either binary, in which case it is only
E 22
D 8
significant to see whether they are set or not, or string, in which
E 8
I 8
significant to see whether they are set or not; or string, in which
E 8
case the actual value is of interest.
The binary options include the following:
D 16
.TP 15n
.B append
E 16
I 16
D 22
.Tp Ar append
E 22
I 22
.Bl -tag -width append
.It Ar append
E 22
E 16
Causes messages saved in
D 16
.I mbox
E 16
I 16
.Ar mbox
E 16
to be appended to the end rather than prepended.
D 12
(This is set in
/usr/lib/Mail.rc
on version 7 systems.)
E 12
I 12
D 18
This should always be set (perhaps in /usr/lib/Mail.rc).
E 18
I 18
This should always be set (perhaps in
D 26
.Pa /usr/share/misc/Mail.rc ) .
E 26
I 26
.Pa /etc/mail.rc ) .
E 26
E 18
E 12
D 16
.TP
.B ask
E 16
I 16
D 22
.Tp Ar ask
E 22
I 22
.It Ar ask
E 22
E 16
Causes
D 16
.I mail
E 16
I 16
.Nm mail
E 16
D 22
to prompt you for the subject of each message you send.  If
E 22
I 22
to prompt you for the subject of each message you send.
If
E 22
you respond with simply a newline, no subject field will be sent.
I 27
.ne 1i
E 27
D 16
.TP
.B askcc
E 16
I 16
D 22
.Tp Ar askcc
E 22
I 22
.It Ar askcc
E 22
E 16
Causes you to be prompted for additional carbon copy recipients at the
D 22
end of each message.  Responding with a newline indicates your
E 22
I 22
end of each message.
Responding with a newline indicates your
E 22
satisfaction with the current list.
I 28
.It Ar autoinc
Causes new mail to be automatically incorporated when it arrives.
Setting this is similar to issuing the
.Ic inc
command at each prompt, except that the current message is not
reset when new mail arrives.
E 28
D 16
.TP
.B autoprint
E 16
I 16
D 22
.Tp Ar autoprint
E 22
I 22
.It Ar autoprint
E 22
E 16
Causes the
D 16
.B delete
E 16
I 16
.Ic delete
E 16
command to behave like
D 16
.B dp
E 16
I 16
.Ic dp
E 16
\- thus, after deleting a message, the next one will be typed
automatically.
D 16
.TP
I 2
.B debug
E 16
I 16
D 22
.Tp Ar debug
E 22
I 22
.It Ar debug
E 22
E 16
Setting the binary option
D 16
.I debug
E 16
I 16
.Ar debug
E 16
is the same as specifying
D 16
.B \-d
E 16
I 16
.Fl d
E 16
on the command line and causes
D 16
.I mail
E 16
I 16
.Nm mail
E 16
to output all sorts of information useful for debugging
D 16
.IR mail .
.TP
.B dot
E 16
I 16
.Nm mail  .
D 22
.Tp Ar dot
E 22
I 22
.It Ar dot
E 22
E 16
The binary option
D 16
.I dot
E 16
I 16
.Ar dot
E 16
causes
D 16
.I mail
E 16
I 16
.Nm mail
E 16
to interpret a period alone on a line as the terminator
of a message you are sending.
D 16
.TP
.B hold
E 16
I 16
D 22
.Tp Ar hold
E 22
I 22
.It Ar hold
E 22
E 16
This option is used to hold messages in the system mailbox
by default.
D 16
.TP
E 2
.B ignore
E 16
I 16
D 22
.Tp Ar ignore
E 22
I 22
.It Ar ignore
E 22
E 16
Causes interrupt signals from your terminal to be ignored and echoed as
@'s.
D 16
.TP
I 2
.B ignoreeof
E 16
I 16
D 22
.Tp Ar ignoreeof
E 22
I 22
.It Ar ignoreeof
E 22
E 16
An option related to
D 16
.I dot
E 16
I 16
.Ar dot
E 16
is
D 16
.I ignoreeof
E 16
I 16
.Ar ignoreeof
E 16
which makes
D 16
.I mail
E 16
I 16
.Nm mail
E 16
refuse to accept a control-d as the end of a message.
D 16
.I Ignoreeof
E 16
I 16
.Ar Ignoreeof
E 16
also applies to
D 16
.I mail
E 16
I 16
.Nm mail
E 16
command mode.
D 16
.TP
E 2
.B metoo
E 16
I 16
D 22
.Tp Ar metoo
E 22
I 22
.It Ar metoo
E 22
E 16
Usually, when a group is expanded that contains the sender, the sender
D 22
is removed from the expansion.  Setting this option causes the sender
E 22
I 22
is removed from the expansion.
Setting this option causes the sender
E 22
to be included in the group.
D 16
.TP
I 12
.B noheader
E 16
I 16
D 22
.Tp Ar noheader
E 22
I 22
.It Ar noheader
E 22
E 16
Setting the option
D 16
.I noheader
E 16
I 16
.Ar noheader
E 16
is the same as giving the
D 16
.B \-N
E 16
I 16
.Fl N
E 16
flag on the command line.
D 16
.TP
E 12
I 2
.B nosave
Normally, when you abort a message with two \s-2RUBOUT\s0,
.I mail
copies the partial letter to the file ``dead.letter''
E 16
I 16
D 22
.Tp Ar nosave
E 22
I 22
.It Ar nosave
E 22
Normally, when you abort a message with two
D 22
.Li RUBOUT
E 22
I 22
.Tn RUBOUT
E 22
(erase or delete)
.Nm mail
copies the partial letter to the file
.Dq Pa dead.letter
E 16
D 22
in your home directory. Setting the binary option
E 22
I 22
in your home directory.
Setting the binary option
E 22
D 16
.I nosave
E 16
I 16
.Ar nosave
E 16
prevents this.
D 16
.TP
I 5
.B Replyall
E 16
I 16
D 22
.Tp Ar Replyall
E 22
I 22
.It Ar Replyall
E 22
E 16
Reverses the sense of
D 16
.I reply
E 16
I 16
.Ic reply
E 16
and
D 16
.I Reply
E 16
I 16
.Ic Reply
E 16
commands.
D 16
.TP
E 5
E 2
.B quiet
E 16
I 16
D 22
.Tp Ar quiet
E 22
I 22
.It Ar quiet
E 22
E 16
Suppresses the printing of the version when first invoked.
I 23
.It Ar searchheaders
If this option is set, then a message-list specifier in the form ``/x:y''
will expand to all messages containing the substring ``y'' in the header
field ``x''.  The string search is case insensitive.
I 29
D 30
The form ``/To:y'' is a special case, and will expand
E 30
I 30
If ``x'' is ommitted, it will default to the ``Subject'' header field.
The form ``/to:y'' is a special case, and will expand
E 30
to all messages containing the substring ``y'' in the ``To'', ``Cc''
or ``Bcc'' header fields.
I 30
The check for "to" is case sensitive, so that
``/To:y'' can be used to limit the search for ``y'' to just
the ``To:'' field.
E 30
E 29
E 23
D 16
.TP
D 2
.B save
Causes the message collected prior to a interrupt to be saved on
the file
``dead.letter''
in your home directory on receipt of two interrupts (or after a \fB~q\fR.)
E 2
I 2
.B verbose
E 16
I 16
D 22
.Tp Ar verbose
E 22
I 22
.It Ar verbose
E 22
E 16
Setting the option
D 16
.I verbose
E 16
I 16
.Ar verbose
E 16
is the same as using the
D 16
.B \-v
E 16
I 16
.Fl v
E 16
D 22
flag on the command line. When mail runs in verbose mode,
E 22
I 22
flag on the command line.
When mail runs in verbose mode,
E 22
D 25
the actual delivery of messages is displayed on he users
E 25
I 25
the actual delivery of messages is displayed on the user's
E 25
terminal.
E 2
D 16
.PP
The following options have string values:
.TP 15n
EDITOR
E 16
I 16
D 22
.Tp
E 22
I 22
.El
E 22
.Ss Option String Values
D 22
.Tw Va
.Tp Va EDITOR
E 22
I 22
.Bl -tag -width Va
.It Ev EDITOR
E 22
E 16
Pathname of the text editor to use in the
D 16
.B edit
command and ~e escape.  If not defined, then a default editor is used.
.TP
I 12
LISTER
E 16
I 16
.Ic edit
command and
.Ic \&~e
D 22
escape.  If not defined, then a default editor is used.
.Tp Va LISTER
E 22
I 22
escape.
If not defined, then a default editor is used.
.It Ev LISTER
E 22
E 16
Pathname of the directory lister to use in the
D 16
.B folders
command.  Default is /bin/ls.
.TP
E 12
I 5
PAGER
E 16
I 16
.Ic folders
D 22
command.  Default is
E 22
I 22
command.
Default is
E 22
.Pa /bin/ls .
D 22
.Tp Va PAGER
E 22
I 22
.It Ev PAGER
E 22
E 16
Pathname of the program to use in the
D 16
.B more
E 16
I 16
.Ic more
E 16
command or when
D 16
.I crt
E 16
I 16
.Ic crt
E 16
D 10
variable is set.  A default paginator is used if this option is
not defined.
E 10
I 10
D 22
variable is set.  The default paginator
E 22
I 22
variable is set.
The default paginator
E 22
D 16
.I more(1)
E 16
I 16
.Xr more 1
E 16
is used if this option is not defined.
E 10
D 16
.TP
E 5
SHELL
E 16
I 16
D 22
.Tp Va SHELL
E 22
I 22
.It Ev SHELL
E 22
E 16
Pathname of the shell to use in the
D 16
.B !
command and the ~! escape.  A default shell is used if this option is
E 16
I 16
.Ic \&!
command and the
.Ic \&~!
D 22
escape.  A default shell is used if this option is
E 22
I 22
escape.
A default shell is used if this option is
E 22
E 16
not defined.
D 16
.TP
VISUAL
E 16
I 16
D 22
.Tp Va VISUAL
E 22
I 22
.It Ev VISUAL
E 22
E 16
Pathname of the text editor to use in the
D 16
.B visual
command and ~v escape.
.TP
I 2
.B crt
E 16
I 16
.Ic visual
command and
.Ic \&~v
escape.
I 27
.ne 1i
E 27
D 22
.Tp Va crt
E 22
I 22
.It Va crt
E 22
E 16
The valued option
D 16
.I crt
E 16
I 16
.Va crt
E 16
is used as a threshold to determine how long a message must
be before
D 5
.I more
E 5
I 5
D 16
.B PAGER
E 5
D 12
is used to read it.
E 12
I 12
is used to read it.  If \fIcrt\fP is set without a value,
E 16
I 16
D 22
.Va PAGER
is used to read it.  If
E 22
I 22
.Ev PAGER
is used to read it.
If
E 22
.Va crt
is set without a value,
E 16
then the height of the terminal screen stored in the system
D 16
is used to compute the threshold (see \fIstty(1)\fP).
E 12
.TP
E 2
.B escape
E 16
I 16
is used to compute the threshold (see
.Xr stty 1 ) .
D 22
.Tp Ar escape
E 22
I 22
.It Ar escape
E 22
E 16
If defined, the first character of this option gives the character to
use in the place of ~ to denote escapes.
D 16
.TP
I 2
.B folder
E 16
I 16
D 22
.Tp Ar folder
E 22
I 22
.It Ar folder
E 22
E 16
The name of the directory to use for storing folders of
D 22
messages. If this name begins with a `/',
E 22
I 22
messages.
If this name begins with a `/',
E 22
D 16
.I mail
E 16
I 16
.Nm mail
E 16
considers it to be an absolute pathname; otherwise, the
folder directory is found relative to your home directory.
D 16
.TP
I 12
D 13
.B mbox
E 13
I 13
.B MBOX
E 13
The name of the \fImbox\fP file.  It can be the name of a folder.
The default is ``mbox'' in the user's home directory.
.TP
E 12
E 2
.B record
E 16
I 16
D 22
.Tp Ar MBOX
E 22
I 22
.It Ev MBOX
E 22
The name of the
.Ar mbox
D 22
file.  It can be the name of a folder.
E 22
I 22
file.
It can be the name of a folder.
E 22
The default is
.Dq Li mbox
in the user's home directory.
D 22
.Tp Ar record
E 22
I 22
.It Ar record
E 22
E 16
If defined, gives the pathname of the file used to record all outgoing
D 22
mail.  If not defined, then outgoing mail is not so saved.
D 16
.TP
I 10
D 15
.B tabstr
String used by the ``~m'' tilde escape for tabbing messages, in place of
E 15
I 15
.B indentprefix
E 16
I 16
.Tp Ar indentprefix
E 22
I 22
mail.
If not defined, then outgoing mail is not so saved.
.It Ar indentprefix
E 22
E 16
String used by the ``~m'' tilde escape for indenting messages, in place of
E 15
D 22
the normal tab character (^I).  Be sure to quote the value if it contains
E 22
I 22
the normal tab character (^I).
Be sure to quote the value if it contains
E 22
spaces or tabs.
D 16
.TP
E 10
.B toplines
E 16
I 16
D 22
.Tp Ar toplines
E 22
I 22
.It Ar toplines
E 22
E 16
If defined, gives the number of lines of a message to be printed out
with the
D 16
.B top
E 16
I 16
.Ic top
E 16
command; normally, the first five lines are printed.
D 16
.SH FILES
.if n .ta 2.5i
.if t .ta 1.8i
/usr/spool/mail/*	post office
.br
~/mbox	your old mail
.br
~/.mailrc	file giving initial mail commands
.br
D 12
/tmp/R#	temporary for editor escape
E 12
I 12
/tmp/R*	temporary files
E 12
.br
/usr/lib/Mail.help*	help files
.br
/usr/lib/Mail.rc	system initialization file
D 12
.br
D 2
/bin/mail	to do actual mailing
.br
/etc/delivermail	postman
E 2
I 2
Message*	temporary for editing messages
E 12
E 2
.SH "SEE ALSO"
D 2
binmail(1), fmt(1), newaliases(1), aliases(5), delivermail(8)
E 2
I 2
D 14
binmail(1), fmt(1), newaliases(1), aliases(5),
E 2
.br
E 14
I 14
binmail(1), fmt(1), newaliases(1), vacation(1), aliases(5),
E 14
I 2
mailaddr(7), sendmail(8)
.br
E 2
`The Mail Reference Manual'
I 2
.SH BUGS
E 16
I 16
D 22
.Tp
E 22
I 22
.El
E 22
.Sh ENVIRONMENT
.Nm Mail
utilizes the
.Ev HOME
and
.Ev USER
environment variables.
.Sh FILES
D 22
.Dw /usr/share/misc/Mail.help*
.Di L
.Dp Pa /var/spool/mail/*
post office
.Dp ~/mbox
your old mail
.Dp ~/.mailrc
file giving initial mail commands
.Dp Pa /tmp/R*
temporary files
.Dp Pa /usr/share/misc/Mail.help*
help files
.Dp Pa /usr/share/misc/Mail.rc
system initialization file
.Dp
E 22
I 22
.Bl -tag -width /usr/share/misc/Mail.help* -compact
D 31
.It Pa /var/spool/mail/*
E 31
I 31
.It Pa /var/mail/*
E 31
Post office.
.It ~/mbox
User's old mail.
.It ~/.mailrc
File giving initial mail commands.
I 28
This can be overridden by setting the
.Ev MAILRC
environment variable.
E 28
.It Pa /tmp/R*
Temporary files.
.It Pa /usr/share/misc/Mail.help*
Help files.
D 26
.It Pa /usr/share/misc/Mail.rc
E 26
I 26
.It Pa /etc/mail.rc
E 26
System initialization file.
.El
E 22
.Sh SEE ALSO
D 21
.Xr binmail 1 ,
E 21
.Xr fmt 1 ,
.Xr newaliases 1 ,
.Xr vacation 1 ,
.Xr aliases 5 ,
.Xr mailaddr 7 ,
.Xr sendmail 8
and
D 22
.Em The Mail Reference Manual .
E 22
I 22
.Rs
.%T "The Mail Reference Manual" .
.Re
E 22
.Sh HISTORY
A
.Nm mail
command
D 22
appeared in Version 6 AT&T UNIX.
E 22
I 22
appeared in
.At v6 .
E 22
This man page is derived from
D 22
.Em The Mail Reference Manual
E 22
I 22
.%T "The Mail Reference Manual"
E 22
originally written by Kurt Shoens.
.Sh BUGS
E 16
D 12
There are many flags that are not documented here. Most are
E 12
I 12
D 22
There are some flags that are not documented here. Most are
E 22
I 22
There are some flags that are not documented here.
Most are
E 22
E 12
not useful to the general user.
D 16
.br
E 16
I 16
.Pp
E 16
Usually,
D 16
.I mail
E 16
I 16
.Nm mail
E 16
is just a link to
D 16
.IR Mail ,
E 16
I 16
.Nm Mail  ,
E 16
which can be confusing.
E 2
D 14
.SH AUTHOR
Kurt Shoens
I 10

E 14
E 10
D 2
.SH BUGS
E 2
E 1
