libexec/rlogind/SCCS/s.rlogind.8
h32568
s 00002/00002/00140
d D 8.1 93/06/04 18:59:04 bostic 14 13
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00078/00055/00064
d D 6.12 91/03/16 17:05:32 cael 13 12
c macro and text revision (-mdoc version 3)
e
s 00001/00011/00118
d D 6.11 90/06/24 21:22:48 trent 12 11
c new copyright notice
e
s 00019/00014/00110
d D 6.10 89/09/11 21:41:06 karels 11 10
c add -a
e
s 00001/00001/00123
d D 6.9 89/01/23 12:14:12 bostic 10 9
c no more subsections
e
s 00009/00003/00115
d D 6.8 89/01/06 19:54:31 karels 9 8
c add -n, remove -d
e
s 00008/00008/00110
d D 6.7 88/12/20 21:46:47 kfall 8 7
c no longer calls login -r, fix "pseduo" type
e
s 00002/00002/00116
d D 6.6 88/12/08 09:29:49 bostic 7 6
c forgot to mention superuser exception on -l flag
e
s 00010/00005/00108
d D 6.5 88/12/07 21:25:38 bostic 6 5
c document -p flag, minor cleanups
e
s 00015/00004/00098
d D 6.4 88/09/19 13:03:57 bostic 5 4
c add Berkeley specific copyright
e
s 00006/00004/00096
d D 6.3 86/05/24 11:03:24 karels 4 3
c more updates
e
s 00008/00008/00092
d D 6.2 86/05/24 10:51:44 karels 3 2
c updates
e
s 00001/00001/00099
d D 6.1 85/04/27 15:41:57 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00100/00000/00000
d D 5.1 85/04/27 15:41:39 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
f b 
t
T
I 1
D 5
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 5
I 5
D 11
.\" Copyright (c) 1983 The Regents of the University of California.
E 11
I 11
D 13
.\" Copyright (c) 1983, 1989 The Regents of the University of California.
E 13
I 13
D 14
.\" Copyright (c) 1983, 1989, 1991 The Regents of the University of California.
E 13
E 11
.\" All rights reserved.
E 14
I 14
.\" Copyright (c) 1983, 1989, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 14
E 5
.\"
I 5
D 12
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 12
I 12
.\" %sccs.include.redist.man%
E 12
.\"
E 5
D 13
.\"	%W% (Berkeley) %G%
E 13
I 13
.\"     %W% (Berkeley) %G%
E 13
.\"
D 2
.TH RLOGIND 8C "4 March 1983"
E 2
I 2
D 5
.TH RLOGIND 8C "%Q%"
E 5
I 5
D 13
.TH RLOGIND 8 "%Q%"
E 5
E 2
.UC 5
.SH NAME
rlogind \- remote login server
.SH SYNOPSIS
D 11
.B /etc/rlogind
E 11
I 11
.B rlogind
E 11
[
D 6
.B \-d
E 6
I 6
D 9
.B \-dl
E 9
I 9
D 11
.B \-ln
E 11
I 11
.B \-aln
E 11
E 9
E 6
]
.SH DESCRIPTION
.I Rlogind
E 13
I 13
.Dd %Q%
.Dt RLOGIND 8
.Os BSD 4.2
.Sh NAME
.Nm rlogind
.Nd remote login server
.Sh SYNOPSIS
.Nm rlogind
.Op Fl aln
.Sh DESCRIPTION
.Nm Rlogind
E 13
is the server for the 
D 6
.IR rlogin (1C)
E 6
I 6
D 13
.IR rlogin (1)
E 13
I 13
.Xr rlogin 1
E 13
E 6
program.  The server provides a remote login facility
D 3
with authentication based on privileged port numbers.
E 3
I 3
with authentication based on privileged port numbers from trusted hosts.
E 3
D 13
.PP
.I Rlogind
E 13
I 13
.Pp
Options supported by
.Nm rlogind :
.Bl -tag -width Ds
.It Fl a
Ask hostname for verification.
.It Fl l
Prevent any authentication based on the user's
.Dq Pa .rhosts
file, unless the user is logging in as the superuser.
.It Fl n
Disable keep-alive messages.
.El
.Pp
.Nm Rlogind
E 13
listens for service requests at the port indicated in
the ``login'' service specification; see
D 13
.IR services (5).
E 13
I 13
.Xr services 5 .
E 13
When a service request is received the following protocol
is initiated:
D 13
.IP 1)
E 13
I 13
.Bl -enum
.It
E 13
The server checks the client's source port.
D 9
If the port is not in the range 0-1023, the server
E 9
I 9
If the port is not in the range 512-1023, the server
E 9
aborts the connection.
D 13
.IP 2)
E 13
I 13
.It
E 13
D 4
The server checks the client's source address.
If the address is associated with a host for which no
corresponding entry exists in the host name data base (see
E 4
I 4
The server checks the client's source address
and requests the corresponding host name (see
E 4
D 3
.IR hosts (5)),
the server aborts the connection.
E 3
I 3
D 6
.IR gethostbyaddr (3N),
E 6
I 6
D 11
.IR gethostbyaddr (3),
E 11
I 11
D 13
IR gethostbyaddr (3),
E 11
E 6
.IR hosts (5)
E 13
I 13
.Xr gethostbyaddr 3 ,
.Xr hosts 5
E 13
and
D 4
.IR named (8)),
E 4
I 4
D 13
.IR named (8)).
E 13
I 13
.Xr named 8 ) .
E 13
If the hostname cannot be determined,
E 4
the dot-notation representation of the host address is used.
I 11
If the hostname is in the same domain as the server (according to
the last two components of the domain name),
or if the
D 13
.B \-a
E 13
I 13
.Fl a
E 13
option is given,
the addresses for the hostname are requested,
verifying that the name and address correspond.
Normal authentication is bypassed if the address verification fails.
E 11
E 3
D 13
.PP
E 13
I 13
.El
.Pp
E 13
Once the source port and address have been checked, 
D 13
.I rlogind
E 13
I 13
.Nm rlogind
E 13
D 8
allocates a pseudo terminal (see 
E 8
I 8
proceeds with the authentication process described in
D 10
.IR rshd (8C).
E 10
I 10
D 13
.IR rshd (8).
E 13
I 13
.Xr rshd 8 .
E 13
E 10
It then allocates a pseudo terminal (see 
E 8
D 13
.IR pty (4)),
E 13
I 13
.Xr pty 4 ) ,
E 13
and manipulates file descriptors so that the slave
half of the pseudo terminal becomes the 
D 13
.B stdin ,
.B stdout ,
E 13
I 13
.Em stdin ,
.Em stdout ,
E 13
and
D 13
.B stderr 
E 13
I 13
.Em stderr
E 13
for a login process.
The login process is an instance of the
D 13
.IR login (1)
E 13
I 13
.Xr login 1
E 13
program, invoked with the
D 8
.B \-r
option.  The login process then proceeds with the authentication
process as described in
D 6
.IR rshd (8C),
E 6
I 6
.IR rshd (8),
E 6
but if automatic authentication fails, it reprompts the user
D 6
to login as one finds on a standard terminal line.
E 6
I 6
to login as one finds on a standard terminal line.  The
E 8
I 8
D 13
.B \-f
E 13
I 13
.Fl f
E 13
option if authentication has succeeded.
If automatic authentication fails, the user is
D 13
prompted to log in as if on a standard terminal line.  The
E 8
D 7
.I -p
E 7
I 7
D 11
.I -l
E 11
I 11
.B \-l
E 11
E 7
option prevents any authentication based on the user's
D 7
``.rhosts'' file.
E 7
I 7
D 9
``.rhosts'' file, unless the user is the superuser.
E 9
I 9
``.rhosts'' file, unless the user is logging in as the superuser.
E 9
E 7
E 6
.PP
E 13
I 13
prompted to log in as if on a standard terminal line.
.Pp
E 13
The parent of the login process manipulates the master side of
D 8
the pseduo terminal, operating as an intermediary
E 8
I 8
the pseudo terminal, operating as an intermediary
E 8
between the login process and the client instance of the
D 13
.I rlogin
E 13
I 13
.Xr rlogin
E 13
program.  In normal operation, the packet protocol described
in
D 13
.IR pty (4)
is invoked to provide ^S/^Q type facilities and propagate
E 13
I 13
.Xr pty 4
is invoked to provide
.Ql ^S/^Q
type facilities and propagate
E 13
interrupt signals to the remote programs.  The login process
propagates the client terminal's baud rate and terminal type,
D 13
as found in the environment variable, ``TERM''; see
.IR environ (7).
E 13
I 13
as found in the environment variable,
.Ql Ev TERM ;
see
.Xr environ 7 .
E 13
I 3
The screen or window size of the terminal is requested from the client,
and window size changes from the client are propagated to the pseudo terminal.
I 9
D 13
.PP
E 13
I 13
.Pp
E 13
Transport-level keepalive messages are enabled unless the
D 13
.B \-n
E 13
I 13
.Fl n
E 13
option is present.
The use of keepalive messages allows sessions to be timed out
if the client crashes or becomes unreachable.
E 9
E 3
D 13
.SH DIAGNOSTICS
E 13
I 13
.Sh DIAGNOSTICS
E 13
D 11
All diagnostic messages are returned on the connection
associated with the
.BR stderr ,
E 11
I 11
All initial diagnostic messages are indicated
by a leading byte with a value of 1,
E 11
after which any network connections are closed.
D 11
An error is indicated by a leading byte with a value of 1.
E 11
I 11
If there are no errors before
D 13
.I login
E 13
I 13
.Xr login
E 13
is invoked, a null byte is returned as in indication of success.
E 11
D 3
.PP
.B ``Hostname for your address unknown.''
.br
No entry in the host name database existed for
the client's machine.
E 3
D 13
.PP
.B ``Try again.''
.br
E 13
I 13
.Bl -tag -width Ds
.It Sy Try again.
E 13
A
D 13
.I fork
E 13
I 13
.Xr fork
E 13
by the server failed.
D 11
.PP
.B ``/bin/sh: ...''
.br
The user's login shell could not be started.
E 11
I 6
D 13
.SH "SEE ALSO"
D 11
ruserok(3), rshd(8)
E 11
I 11
login(1), ruserok(3), rshd(8)
E 11
E 6
.SH BUGS
E 13
I 13
.El
.Sh SEE ALSO
.Xr login 1 ,
.Xr ruserok 3 ,
.Xr rshd 8
.Sh BUGS
E 13
The authentication procedure used here assumes the integrity
of each client machine and the connecting medium.  This is
insecure, but is useful in an ``open'' environment.
D 13
.PP
E 13
I 13
.Pp
E 13
A facility to allow all data exchanges to be encrypted should be
present.
I 4
D 13
.PP
E 13
I 13
.Pp
E 13
A more extensible protocol should be used.
I 13
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.2 .
E 13
E 4
E 1
