usr.sbin/quotaon/SCCS/s.quotaon.8
h30307
s 00001/00001/00112
d D 8.2 93/12/11 23:44:44 mckusick 10 9
c copyediting for Usenix manuals
e
s 00002/00002/00111
d D 8.1 93/06/06 14:05:02 bostic 9 8
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00090/00099/00023
d D 6.7 91/03/16 18:13:10 cael 8 7
c macro and text revision (-mdoc version 3)
e
s 00001/00011/00121
d D 6.6 90/06/24 22:29:17 trent 7 6
c new copyright notice
e
s 00100/00034/00032
d D 6.5 90/05/06 14:34:47 mckusick 6 5
c update for new quota system
e
s 00036/00058/00030
d D 6.4 90/01/02 14:45:57 bostic 5 4
c remove mention of mtab, consolidate descriptions
e
s 00010/00005/00078
d D 6.3 88/07/09 11:32:05 bostic 4 3
c install approved copyright notice
e
s 00008/00002/00075
d D 6.2 88/05/20 12:23:51 bostic 3 2
c add Berkeley specific header
e
s 00001/00001/00076
d D 6.1 85/04/27 15:39:00 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00077/00000/00000
d D 5.1 85/04/27 15:38:40 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
D 6
.\" Copyright (c) 1983 Regents of the University of California.
E 6
I 6
D 8
.\" Copyright (c) 1983, 1990 Regents of the University of California.
E 8
I 8
D 9
.\" Copyright (c) 1983, 1990, 1991 Regents of the University of California.
E 8
E 6
D 3
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 3
I 3
.\" All rights reserved.
E 9
I 9
.\" Copyright (c) 1983, 1990, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 9
.\"
I 6
.\" This code is derived from software contributed to Berkeley by
.\" Robert Elz at The University of Melbourne.
D 8
.\"
E 8
E 6
D 7
.\" Redistribution and use in source and binary forms are permitted
D 4
.\" provided that this notice is preserved and that due credit is given
.\" to the University of California at Berkeley. The name of the University
.\" may not be used to endorse or promote products derived from this
.\" software without specific prior written permission. This software
.\" is provided ``as is'' without express or implied warranty.
E 4
I 4
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 7
I 7
.\" %sccs.include.redist.man%
E 7
E 4
E 3
.\"
D 8
.\"	%W% (Berkeley) %G%
E 8
I 8
.\"     %W% (Berkeley) %G%
E 8
.\"
D 2
.TH QUOTAON 8  "28 June 1983"
E 2
I 2
D 8
.TH QUOTAON 8 "%Q%"
E 2
.UC 5
.SH NAME
D 6
quotaon, quotaoff \- turn file system quotas on and off
E 6
I 6
quotaon, quotaoff \- turn filesystem quotas on and off
E 6
.SH SYNOPSIS
D 5
.B /etc/quotaon
[
.B \-v
]
.I filsys...
.PP
.B /etc/quotaon
[
.B \-v
]
.B \-a
.PP
.B /etc/quotaoff
[
.B \-v
]
.I filsys...
.PP
.B /etc/quotaoff
[
.B \-v
]
.B \-a
E 5
I 5
D 6
.nf
.ft B
quotaon [-v] filesys ...
quotaon [-av]
quotaoff [-v] filesys ...
quotaoff [-av]
.fi
.ft R
E 6
I 6
.B quotaon
[
.B \-g
] [
.B \-u
] [
.B \-v
]
filesystem ...
.br
.B quotaon
[
.B \-g
] [
.B \-u
] [
.B \-v
]
.B \-a
.br
.B quotaoff
[
.B \-g
] [
.B \-u
] [
.B \-v
]
filesystem ...
.br
.B quotaoff
[
.B \-g
] [
.B \-u
] [
.B \-v
]
.B \-a
.br
E 6
E 5
.SH DESCRIPTION
.I Quotaon
E 8
I 8
.Dd %Q%
.Dt QUOTAON 8
.Os BSD 4.2
.Sh NAME
.Nm quotaon ,
.Nm quotaoff
.Nd turn filesystem quotas on and off
.Sh SYNOPSIS
.Nm quotaon
.Op Fl g
.Op Fl u
.Op Fl v
.Ar filesystem Ar ...
.Nm quotaon
.Op Fl g
.Op Fl u
.Op Fl v
.Fl a
.Nm quotaoff
.Op Fl g
.Op Fl u
.Op Fl v
.Ar filesystem Ar ...
.Nm quotaoff
.Op Fl g
.Op Fl u
.Op Fl v
.Fl a
.Sh DESCRIPTION
.Nm Quotaon
E 8
D 5
announces to the system that disc quotas should be enabled
on one or more file systems.
The file systems specified must have entries
in /etc/fstab and be mounted at the time.
The file system quota files must be present in the root
directory of the specified file system and be named
.IR quotas .
The optional argument
.B \-v
causes
.I quotaon
to print a message for each file system where quotas are turned on.
If, instead of a list of file systems, a
.B \-a
argument is give to 
.IR quotaon ,
all file systems in /etc/fstab marked read-write with quotas
will have their quotas turned on.  This is normally used at
boot time to enable quotas.
E 5
I 5
announces to the system that disk quotas should be enabled on one or more
D 6
file systems.
The file systems specified must have entries in the
.I fstab
file and be mounted.
The file system quota files (named ``quotas'') must be present in
the root directory of the specified file system.
E 6
I 6
filesystems.
I 8
.Nm Quotaoff
announces to the system that the specified
filesystems should have any disk quotas
diskquotas turned off.
E 8
The filesystems specified must have entries in
D 8
.I /etc/fstab
E 8
I 8
.Pa /etc/fstab
E 8
and be mounted.
D 8
.I Quotaon
E 8
I 8
.Nm Quotaon
E 8
expects each filesystem to have quota files named
D 8
.I quota.user
E 8
I 8
.Pa quota.user
E 8
and
D 8
.I quota.group
E 8
I 8
.Pa quota.group
E 8
which are located at the root of the associated file system.
These defaults may be overridden in
D 8
.I /etc/fstab .
E 8
I 8
.Pa /etc/fstab .
E 8
By default both user and group quotas are enabled.
D 8
The optional \fI-g\fP flag specifies that only group quotas should be enabled.
The optional \fI-u\fP flag specifies that only user quotas should be enabled.
Specifying both \fI-g\fP and \fI-u\fP is equivalent to the default.
E 6
E 5
.PP
E 8
I 8
.Pp
Available options:
.Bl -tag -width Ds
.It Fl a
E 8
I 6
If the
D 8
.B \-a
E 8
I 8
.Fl a
E 8
flag is supplied in place of any filesystem names,
D 8
.I quotaon
will enable all the filesystems indicated in
.I /etc/fstab
E 8
I 8
D 10
.Nm quotaon Ns / Ns quotaoff
E 10
I 10
.Nm quotaon Ns / Ns Nm quotaoff
E 10
will enable/disable all the filesystems indicated in
.Pa /etc/fstab
E 8
to be read-write with disk quotas.
By default only the types of quotas listed in
D 8
.I /etc/fstab
E 8
I 8
.Pa /etc/fstab
E 8
are enabled.
D 8
The optional \fI-g\fP flag specifies that only group quotas listed in
.I /etc/fstab
should be enabled.
The optional \fI-u\fP flag specifies that only user quotas listed in
.I /etc/fstab
should be enabled.
Specifying both \fI-g\fP and \fI-u\fP is equivalent to the default.
.PP
E 6
.I Quotaoff
D 5
announces to the system that file systems specified should
have any disc quotas turned off.  As above, the
.B \-v
forces a verbose message for each file system affected; and
the 
.B \-a
option forces all file systems in /etc/fstab to have their
quotas disabled.
E 5
I 5
D 6
announces to the system that the specified file systems should have
E 6
I 6
announces to the system that the specified filesystems should have
E 6
any disk quotas turned off.
I 6
If the
.B \-a
flag is supplied in place of any filesystem names,
.I quotaoff
will turn off quotas on all the filesystems indicated in
.I /etc/fstab
to be read-write with disk quotas.
The \fI-g\fP and \fI-u\fP flags work analogously with quotaon.
E 6
E 5
.PP
D 5
These commands
update the status field of devices located in
.I /etc/mtab
to indicate when quotas are on or off for each file system.
E 5
I 5
D 6
The options are as follows:
.TP
-v
Verbose; this flag causes
E 6
I 6
The \fI-v\fP flag causes
E 6
.I quotaon
E 8
I 8
.It Fl g
Only group quotas listed in
.Pa /etc/fstab
should be enabled/disabled.
.It Fl u
Only user quotas listed in
.Pa /etc/fstab
should be enabled/disabled.
.It Fl v
Causes
.Nm quotaon
E 8
and
D 8
.I quotaoff
E 8
I 8
.Nm quotaoff
E 8
D 6
to print a message for each file system where quotas are turned on or off.
.TP
-a
Turn on (off) quotas on the standard set of file systems.
This flag should be specified instead of a list of file systems.
It causes all file systems in the
.I fstab
file marked read-write with quotas to have their quotas turned on (off).
This is normally used at boot time by the
.I /etc/rc
file.
E 6
I 6
to print a message for each filesystem where quotas are turned on or off.
E 6
E 5
D 8
.SH FILES
D 5
/etc/mtab	mount table
.br
E 5
D 6
/etc/fstab	file system table
E 6
I 6
.DT
\fIquota.user\fP	at the filesystem root with user quotas
.br
\fIquota.group\fP	at the filesystem root with group quotas
.br
/etc/fstab	filesystem table
E 6
.SH "SEE ALSO"
D 5
setquota(2),
mtab(5), fstab(5)
E 5
I 5
D 6
setquota(2), fstab(5)
E 6
I 6
quota(1),
quotactl(2),
fstab(5),
edquota(8), quotacheck(8), repquota(8)
E 8
I 8
.El
.Pp
Specifying both
.Fl g
and
.Fl u
is equivalent to the default.
.Sh FILES
.Bl -tag -width quota.group -compact
.It Pa quota.user
at the filesystem root with user quotas
.It Pa quota.group
at the filesystem root with group quotas
.It Pa /etc/fstab
filesystem table
.El
.Sh SEE ALSO
.Xr quota 1 ,
.Xr quotactl 2 ,
.Xr fstab 5 ,
.Xr edquota 8 ,
.Xr quotacheck 8 ,
.Xr repquota 8
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.2 .
E 8
E 6
E 5
E 1
