usr.bin/uucp/uupoll/SCCS/s.uupoll.8
h37431
s 00002/00002/00083
d D 8.1 93/06/06 22:14:38 bostic 6 5
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00064/00054/00021
d D 6.5 91/03/16 18:11:11 cael 5 4
c macro and text revision (-mdoc version 3)
e
s 00002/00002/00073
d D 6.4 90/06/24 22:09:26 trent 4 3
c new pathnames
e
s 00003/00003/00072
d D 6.3 88/10/24 12:00:07 bostic 3 2
c remove refs to [18]C, add copyright if needed
e
s 00005/00005/00070
d D 6.2 86/07/07 19:22:47 mckusick 2 1
c update crontab examples
e
s 00075/00000/00000
d D 6.1 86/04/24 22:25:42 mckusick 1 0
c from rfg
e
u
U
t
T
I 1
D 5
.\" Copyright (c) 1986 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 5
I 5
D 6
.\" Copyright (c) 1986, 1991 Regents of the University of California.
.\" All rights reserved.
E 6
I 6
.\" Copyright (c) 1986, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 6
E 5
.\"
D 5
.\"	%W% (Berkeley) %G%
E 5
I 5
.\" %sccs.include.redist.man%
E 5
.\"
D 3
.TH UUPOLL 8C "%Q%"
E 3
I 3
D 5
.TH UUPOLL 8 "%Q%"
E 3
.UC 6
.SH NAME
uupoll \- poll a remote \s-1UUCP\s+1 site
.SH SYNOPSIS
.B uupoll
[
.BI \-g grade
] [
.B \-n
]
.I system
.SH DESCRIPTION
.I Uupoll
E 5
I 5
.\"     %W% (Berkeley) %G%
.\"
.Dd %Q%
.Dt UUPOLL 8
.Os BSD 4.3
.Sh NAME
.Nm uupoll
.Nd poll a remote
.Tn UUCP
site
.Sh SYNOPSIS
.Nm uupoll
.Op Fl g Ns Ar grade
.Op Fl n
.Ar system
.Sh DESCRIPTION
.Nm Uupoll
E 5
is used to force a poll of a remote system. It queues a null job for the
remote system and then invokes
D 3
.IR uucico (8C).
E 3
I 3
D 5
.IR uucico (8).
E 3
.PP
E 5
I 5
.Xr uucico 8 .
.Pp
E 5
The following options are available:
D 5
.TP 8
.BI \-g grade
E 5
I 5
.Bl -tag -width Fl
.It Fl g Ns Ar grade
E 5
Only send jobs of grade
D 5
.I grade
E 5
I 5
.Ar grade
E 5
or higher on this call.
D 5
.TP 8
.B \-n
E 5
I 5
.It Fl n
E 5
Queue the null job, but do not invoke
D 5
.IR uucico .
.PP
.I Uupoll
E 5
I 5
.Xr uucico .
.El
.Pp
.Nm Uupoll
E 5
is usually run by
D 5
.IR cron (5)
E 5
I 5
.Xr cron 5
E 5
or by a user who wants to hurry a job along. A typical entry in
D 5
.I crontab
E 5
I 5
.Em crontab
E 5
could be:
D 5
.PP
.nf
D 2
	0	0,8,16	*	*	*	/usr/bin/uupoll ihnp4
	0	4,12,20	*	*	*	/usr/bin/uupoll ucbvax
E 2
I 2
	0	0,8,16	*	*	*	daemon	/usr/bin/uupoll ihnp4
	0	4,12,20	*	*	*	daemon	/usr/bin/uupoll ucbvax
E 2
.fi
E 5
I 5
.Bd -literal
0    0,8,16     *    *    *    daemon    /usr/bin/uupoll ihnp4
0    4,12,20    *    *    *    daemon    /usr/bin/uupoll ucbvax
.Ed
.Pp
E 5
This will poll
D 5
.B ihnp4
E 5
I 5
.Em ihnp4
E 5
at midnight, 0800, and 1600, and
D 5
.B ucbvax
E 5
I 5
.Em ucbvax
E 5
at 0400, noon, and 2000.
D 5
.PP
E 5
I 5
.Pp
E 5
If the local machine is already running
D 5
.I uucico
E 5
I 5
.Xr uucico
E 5
every
hour and has a limited number of outgoing modems, a more elegant approach
might be:
D 5
.PP
.nf
D 2
	0	0,8,16	*	*	*	/usr/bin/uupoll -n ihnp4
	0	4,12,20	*	*	*	/usr/bin/uupoll -n ucbvax
	5	*		*	*	*	/usr/lib/uucp/uucico -r1
E 2
I 2
	0	0,8,16	*	*	*	daemon	/usr/bin/uupoll -n ihnp4
	0	4,12,20	*	*	*	daemon	/usr/bin/uupoll -n ucbvax
	5		*	*	*	*	daemon	/usr/lib/uucp/uucico -r1
E 2
.fi
E 5
I 5
.Bd -literal
0    0,8,16    *    *    *    daemon    /usr/bin/uupoll -n ihnp4
0    4,12,20   *    *    *    daemon    /usr/bin/uupoll -n ucbvax
5        *     *    *    *    daemon    /usr/lib/uucp/uucico -r1
.Ed
.Pp
E 5
This will queue null jobs for the remote sites at the top of hour; they
will be processed by
D 5
.I uucico
E 5
I 5
.Xr uucico
E 5
when it runs five minutes later.
D 5
.SH FILES
D 4
.ta \w'/usr/spool/uucp/   'u
E 4
I 4
.ta \w'/var/spool/uucp/   'u
E 4
.nf
/usr/lib/uucp/	UUCP internal files/utilities
D 4
/usr/spool/uucp/	Spool directory
E 4
I 4
/var/spool/uucp/	Spool directory
E 4
.fi
.SH SEE ALSO
D 3
uucp(1C), uux(1C), uucico(8C)
E 3
I 3
uucp(1), uux(1), uucico(8)
E 5
I 5
.Sh FILES
.Bl -tag -width /usr/lib/uucp/UUCP -compact
.It Pa /usr/lib/uucp/UUCP
internal files/utilities
.It Pa /var/spool/uucp/
Spool directory
.El
.Sh SEE ALSO
.Xr uucp 1 ,
.Xr uux 1 ,
.Xr uucico 8
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.3 .
E 5
E 3
E 1
