usr.sbin/repquota/SCCS/s.repquota.8
h60588
s 00002/00002/00075
d D 8.1 93/06/06 14:05:09 bostic 8 7
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00061/00056/00016
d D 6.6 91/03/16 18:13:14 cael 7 6
c macro and text revision (-mdoc version 3)
e
s 00001/00011/00071
d D 6.5 90/06/24 22:30:25 trent 6 5
c new copyright notice
e
s 00047/00007/00035
d D 6.4 90/05/06 14:35:26 mckusick 5 4
c update for new quota system
e
s 00010/00005/00032
d D 6.3 88/07/09 11:32:07 bostic 4 3
c install approved copyright notice
e
s 00008/00002/00029
d D 6.2 88/05/20 12:23:52 bostic 3 2
c add Berkeley specific header
e
s 00001/00001/00030
d D 6.1 85/04/27 15:40:25 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00031/00000/00000
d D 5.1 85/04/27 15:40:05 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
D 5
.\" Copyright (c) 1983 Regents of the University of California.
E 5
I 5
D 7
.\" Copyright (c) 1983, 1990 Regents of the University of California.
E 7
I 7
D 8
.\" Copyright (c) 1983, 1990, 1991 Regents of the University of California.
E 7
E 5
D 3
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 3
I 3
.\" All rights reserved.
E 8
I 8
.\" Copyright (c) 1983, 1990, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 8
.\"
I 5
.\" This code is derived from software contributed to Berkeley by
.\" Robert Elz at The University of Melbourne.
.\"
E 5
D 6
.\" Redistribution and use in source and binary forms are permitted
D 4
.\" provided that this notice is preserved and that due credit is given
.\" to the University of California at Berkeley. The name of the University
.\" may not be used to endorse or promote products derived from this
.\" software without specific prior written permission. This software
.\" is provided ``as is'' without express or implied warranty.
E 4
I 4
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 6
I 6
.\" %sccs.include.redist.man%
E 6
E 4
E 3
.\"
D 7
.\"	%W% (Berkeley) %G%
E 7
I 7
.\"     %W% (Berkeley) %G%
E 7
.\"
D 2
.TH REPQUOTA 8 "7 July 1983"
E 2
I 2
D 7
.TH REPQUOTA 8 "%Q%"
E 2
.UC 5
.SH NAME
repquota \- summarize quotas for a file system
.SH SYNOPSIS
.B repquota
D 5
.IR filesys ...
E 5
I 5
[
.B \-v
] [
.B \-g
] [
.B \-u
]
filesystem ...
.br
.B repquota
[
.B \-v
] [
.B \-g
] [
.B \-u
]
.B \-a
.br
E 5
.SH DESCRIPTION
.I Repquota
E 7
I 7
.Dd %Q%
.Dt REPQUOTA 8
.Os BSD 4.2
.Sh NAME
.Nm repquota
.Nd summarize quotas for a file system
.Sh SYNOPSIS
.Nm repquota
.Op Fl g
.Op Fl u
.Op Fl v
.Ar filesystem Ar ...
.Nm repquota
.Op Fl g
.Op Fl u
.Op Fl v
.Fl a
.Sh DESCRIPTION
.Nm Repquota
E 7
D 5
prints a summary of the disc usage and quotas for the
specified file systems.  For each user the current
E 5
I 5
prints a summary of the disk usage and quotas for the
specified file systems.
D 7
If the \fI-a\fP flag is used,
.I repquota
prints the quotas of all the filesystems listed in
.IR /etc/fstab .
.PP
By default both user and group quotas are printed if they exist.
The optional \fI-g\fP flag specifies that only group quotas should be printed.
The optional \fI-u\fP flag specifies that only user quotas should be printed.
Specifying both \fI-g\fP and \fI-u\fP is equivalent to the default.
.PP
E 7
I 7
.Pp
Available options:
.Bl -tag -width Ds
.It Fl a
Print the quotas of all the filesystems listed in
.Pa /etc/fstab .
.It Fl g
Print only group quotas (the default is to print both
group and user quotas if they exist).
.It Fl u
Print only user quotas (the default is to print both
group and user quotas if they exist).
.It Fl v
Print a header line before printing each filesystem quotas.
.El
.Pp
E 7
For each user or group, the current
E 5
number files and amount of space (in kilobytes) is
printed, along with any quotas created with
D 7
.IR edquota (8).
I 5
If the \fI-v\fP flag is specified,
a header line is printed preceding each filesystems quotas.
E 5
.PP
E 7
I 7
.Xr edquota 8 .
.Pp
E 7
D 5
Only the super-user may view quotas which are not their own.
E 5
I 5
Only members of the operator group or the super-user may
use this command.
E 5
D 7
.SH FILES
.DT
D 5
\fIquotas\fP	at the root of each file system with quotas
E 5
I 5
\fIquota.user\fP	at the filesystem root with user quotas
E 5
.br
I 5
\fIquota.group\fP	at the filesystem root with group quotas
.br
E 5
/etc/fstab	for file system names and locations
.SH SEE ALSO
D 5
quota(1), quota(2), quotacheck(8), quotaon(8), edquota(8)
E 5
I 5
quota(1),
quotactl(2),
fstab(5),
edquota(8), quotacheck(8), quotaon(8)
E 5
.SH DIAGNOSTICS
E 7
I 7
.Sh FILES
.Bl -tag -width quota.group -compact
.It Pa quota.user
at the filesystem root with user quotas
.It Pa quota.group
at the filesystem root with group quotas
.It Pa /etc/fstab
for file system names and locations
.El
.Sh SEE ALSO
.Xr quota 1 ,
.Xr quotactl 2 ,
.Xr fstab 5 ,
.Xr edquota 8 ,
.Xr quotacheck 8 ,
.Xr quotaon 8
.Sh DIAGNOSTICS
E 7
Various messages about inaccessible files; self-explanatory.
I 7
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.2 .
E 7
E 1
