usr.sbin/lpr/pac/SCCS/s.pac.8
h55053
s 00002/00002/00078
d D 8.1 93/06/06 14:02:03 bostic 7 6
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00061/00066/00019
d D 6.5 91/03/16 18:12:51 cael 6 5
c macro and text revision (-mdoc version 3)
e
s 00004/00014/00081
d D 6.4 90/06/24 22:25:04 trent 5 4
c new copyright & pathnames (pac, acct)
e
s 00014/00003/00081
d D 6.3 88/09/29 09:32:26 bostic 4 3
c add Berkeley copyright notice
e
s 00012/00002/00072
d D 6.2 85/10/30 12:29:19 bloom 3 2
c add -m flag for grouping hosts, comment about price in printcap
e
s 00005/00001/00069
d D 6.1 85/04/27 15:37:42 mckusick 2 1
c 4.3BSD beta release manual page
e
s 00070/00000/00000
d D 5.1 85/04/27 15:37:11 mckusick 1 0
c manual page first distributed with 4.2BSD
e
u
U
t
T
I 1
D 4
.\" Copyright (c) 1983 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 4
I 4
D 6
.\" Copyright (c) 1983 The Regents of the University of California.
E 6
I 6
D 7
.\" Copyright (c) 1983, 1991 The Regents of the University of California.
E 6
.\" All rights reserved.
E 7
I 7
.\" Copyright (c) 1983, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 7
.\"
D 5
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 5
I 5
.\" %sccs.include.redist.man%
E 5
E 4
.\"
D 6
.\"	%W% (Berkeley) %G%
E 6
I 6
.\"     %W% (Berkeley) %G%
E 6
.\"
D 2
.TH PAC 8 "21 February 1981"
E 2
I 2
D 6
.TH PAC 8 "%Q%"
E 2
.UC 5
.SH NAME
D 3
pac \- printer/ploter accounting information
E 3
I 3
pac \- printer/plotter accounting information
E 3
.SH SYNOPSIS
D 5
.B /etc/pac
E 5
I 5
.B pac
E 5
[
.B \-Pprinter
] [
.B \-pprice
] [
.B \-s
] [
.B \-r
] [
.B \-c
I 3
] [
.B \-m
E 3
] [ name ... ]
.SH DESCRIPTION
.I Pac
E 6
I 6
.Dd %Q%
.Dt PAC 8
.Os BSD 4.2
.Sh NAME
.Nm pac
.Nd printer/plotter accounting information
.Sh SYNOPSIS
.Nm pac
.Op Fl P Ns Ar printer
.Op Fl c
.Op Fl m
.Op Fl p Ns Ar price
.Op Fl s
.Op Fl r
.Op Ar name ...
.Sh DESCRIPTION
.Nm Pac
E 6
reads the printer/plotter accounting files, accumulating the number
of pages (the usual case) or feet (for raster devices)
of paper consumed by each user, and printing out
how much each user consumed in pages or feet and dollars.
D 6
If any
.I names
are specified, then statistics are only printed for those users;
usually, statistics are printed for every user who has used any paper.
.PP
The
.B \-P
flag causes accounting to be done for the named printer.
E 6
I 6
.Pp
Options and operands available:
.Bl -tag -width PPprinter
.It Fl P Ns Ar printer
Accounting is done for the named printer.
E 6
Normally, accounting is done for the default printer (site dependent) or
the value of the environment variable
D 6
.B PRINTER
E 6
I 6
.Ev PRINTER
E 6
is used.
D 6
.PP
The
.B \-p
flag causes the value
.I price
D 3
to be used for the cost in dollars instead of the default value of 0.02.
E 3
I 3
to be used for the cost in dollars instead of the default value of 0.02
or the price specified in
.IR /etc/printcap.
E 3
.PP
The
.B \-c
E 6
I 6
.It Fl c
E 6
flag causes the output to be sorted by cost; usually the
output is sorted alphabetically by name.
D 6
.PP
The
.B \-r
flag reverses the sorting order.
.PP
The
.B \-s
flag causes the accounting information to be summarized on the
summary accounting file; this summarization is necessary since on a
busy system, the accounting file can grow by several lines per day.
I 3
.PP
The
.B \-m
E 6
I 6
.It Fl m
E 6
flag causes the host name to be ignored in the accounting file.  This
allows for a user on multiple machines to have all of his printing
charges grouped together.
E 3
D 6
.SH FILES
.ta 2i
D 5
/usr/adm/?acct	raw accounting files
E 5
I 5
/var/account/?acct	raw accounting files
E 5
.br
D 5
/usr/adm/?_sum	summary accounting files
E 5
I 5
/var/account/?_sum	summary accounting files
E 5
I 2
.br
/etc/printcap	printer capability data base
.SH SEE ALSO
printcap(5)
E 2
.SH BUGS
E 6
I 6
.It Fl p Ns Ar price
The value
.Ar price
is used for the cost in dollars instead of the default value of 0.02
or the price specified in
.Pa /etc/printcap .
.It Fl r
Reverse the sorting order.
.It Fl s
Accounting information is summarized on the
summary accounting file; this summarization is necessary since on a
busy system, the accounting file can grow by several lines per day.
.It Ar names
Statistics are only printed for user(s)
.Ar name ;
usually, statistics are printed for every user who has used any paper.
.El
.Sh FILES
.Bl -tag -width /var/account/?_sum -compact
.It Pa /var/account/?acct
raw accounting files
.It Pa /var/account/?_sum
summary accounting files
.It Pa /etc/printcap
printer capability data base
.El
.Sh SEE ALSO
.Xr printcap 5
.Sh BUGS
E 6
The relationship between the computed price and reality is
as yet unknown.
I 6
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.0 .
E 6
E 1
