usr.sbin/trsp/SCCS/s.trsp.8
h15121
s 00002/00002/00113
d D 8.1 93/06/06 14:11:51 bostic 5 4
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00077/00064/00038
d D 6.4 91/03/16 18:14:05 cael 4 3
c macro and text revision (-mdoc version 3)
e
s 00001/00011/00101
d D 6.3 90/06/24 22:48:31 trent 3 2
c new copyright notice
e
s 00016/00005/00096
d D 6.2 88/09/20 10:31:51 bostic 2 1
c Berkeley copyright
e
s 00101/00000/00000
d D 6.1 85/10/08 22:31:28 sklower 1 0
c date and time created 85/10/08 22:31:28 by sklower
e
u
U
t
This manual page documents a tool used for debugging failures in
the Xerox NS Sequenced packet protocol layer.  It is adapted from
the Internet equivalent trpt(8c).
T
I 1
D 2
.\" Copyright (c) 1985 Regents of the University of California.
.\" All rights reserved.  The Berkeley software License Agreement
.\" specifies the terms and conditions for redistribution.
E 2
I 2
D 4
.\" Copyright (c) 1985 The Regents of the University of California.
E 4
I 4
D 5
.\" Copyright (c) 1985, 1991 The Regents of the University of California.
E 4
.\" All rights reserved.
E 5
I 5
.\" Copyright (c) 1985, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 5
E 2
.\"
I 2
D 3
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 3
I 3
.\" %sccs.include.redist.man%
E 3
.\"
E 2
D 4
.\"	%W% (Berkeley) %G%
E 4
I 4
.\"     %W% (Berkeley) %G%
E 4
.\"
D 2
.TH TRSP 8c "%Q%"
E 2
I 2
D 4
.TH TRSP 8 "%Q%"
E 2
.UC 5
.SH NAME
trsp \- transliterate sequenced packet protocol trace
.SH SYNOPSIS
.B trsp
[
.B \-a
] [
.B \-s
]  [
.B \-t
] [
.B \-j
] [
.B \-p
hex-address ]
[ system [ core ] ]
.SH DESCRIPTION
.I Trpt
interrogates the buffer of SPP trace records created
when a socket is marked for \*(lqdebugging\*(rq (see
.IR setsockopt (2)),
E 4
I 4
.Dd %Q%
.Dt TRSP 8
.Os BSD 4.2
.Sh NAME
.Nm trsp
.Nd transliterate sequenced packet protocol trace
.Sh SYNOPSIS
.Nm trsp
.Op Fl a
.Op Fl s
.Op Fl t
.Op Fl j
.Op Fl p Ar hex-address
.Oo
.Ar system Op Ar core
.Oc
.Sh DESCRIPTION
.Xr Trpt
interrogates the buffer of
.Tn SPP
trace records created
when a socket is marked for
.Dq debugging
(see
.Xr setsockopt 2 ) ,
E 4
and prints a readable description of these records.
When no options are supplied, 
D 4
.I trsp
E 4
I 4
.Nm trsp
E 4
prints all the trace records found in the system
D 4
grouped according to SPP connection protocol control
block (PCB).  The following options may be used to
E 4
I 4
grouped according to
.Tn SPP
connection protocol control
block
.Pq Tn PCB .
The following options may be used to
E 4
alter this behavior.
D 4
.TP
.B \-s
E 4
I 4
.Bl -tag -width Ds
.It Fl a
In addition to the normal output,
print the values of the source and destination
addresses for each packet recorded.
.It Fl j
Just give a list of the protocol control block
addresses for which there are trace records.
.It Fl p
Show only trace records associated with the protocol
control block at the given address,
.Ar hex-address .
.It Fl s
E 4
in addition to the normal output,
print a detailed description of the packet
D 4
sequencing information,
.TP
.B \-t
E 4
I 4
sequencing information.
.It Fl t
E 4
in addition to the normal output,
print the values for all timers at each
point in the trace,
D 4
.TP
.B \-j
just give a list of the protocol control block
addresses for which there are trace records,
.TP
.B \-p
show only trace records associated with the protocol
control block who's address follows,
.TP
.B \-a
in addition to the normal output,
print the values of the source and destination
addresses for each packet recorded.
.PP
E 4
I 4
.El
.Pp
E 4
The recommended use of
D 4
.I trsp
E 4
I 4
.Nm trsp
E 4
is as follows.
Isolate the problem and enable debugging on the
socket(s) involved in the connection.
Find the address of the protocol control blocks
associated with the sockets using the 
D 4
.B \-A
E 4
I 4
.Fl A
E 4
option to 
D 4
.IR netstat (1).
E 4
I 4
.Xr netstat 1 .
E 4
Then run
D 4
.I trsp
E 4
I 4
.Nm trsp
E 4
with the
D 4
.B \-p
E 4
I 4
.Fl p
E 4
option, supplying the associated
protocol control block addresses.  If there are
many sockets using the debugging option, the
D 4
.B \-j
E 4
I 4
.Fl j
E 4
option may be useful in checking to see if
any trace records are present for the socket in
question.
D 4
.PP
E 4
I 4
.Pp
E 4
If debugging is being performed on a system or
core file other than the default, the last two
arguments may be used to supplant the defaults.
D 4
.SH FILES
/vmunix
.br
/dev/kmem
.SH "SEE ALSO"
D 2
setsockopt(2), netstat(1)
E 2
I 2
netstat(1), setsockopt(2)
E 2
.SH DIAGNOSTICS
``no namelist'' when the system image doesn't
E 4
I 4
.Sh FILES
.Bl -tag -width /dev/kmem -compact
.It Pa /vmunix
.It Pa /dev/kmem
.El
.Sh SEE ALSO
.Xr netstat 1 ,
.Xr setsockopt 2
.Sh DIAGNOSTICS
.Bl -tag -width Ds
.It Sy no namelist
When the system image doesn't
E 4
contain the proper symbols to find the trace buffer;
others which should be self explanatory.
D 4
.SH BUGS
E 4
I 4
.Sh BUGS
E 4
Should also print the data for each input or output,
but this is not saved in the race record.
D 4
.PP
E 4
I 4
.Pp
E 4
The output format is inscrutable and should be described
here.
I 4
.Sh HISTORY
The
.Nm
command appeared in
.Bx 4.3 .
E 4
E 1
