usr.sbin/traceroute/SCCS/s.traceroute.8
h47347
s 00001/00000/00310
d D 8.2 94/06/01 20:47:57 ah 6 5
c page breaks for 4.4BSD manuals
e
s 00002/00002/00308
d D 8.1 93/06/06 14:11:23 bostic 5 4
c 4.4BSD snapshot (revision 8.1); add 1993 to copyright
e
s 00198/00155/00112
d D 5.4 91/03/16 18:13:53 cael 4 3
c macro and text revision (-mdoc version 3)
e
s 00000/00000/00267
d D 5.3 90/06/24 22:47:34 trent 3 2
c new copyright notice
e
s 00007/00014/00260
d D 5.2 90/04/28 16:32:18 bostic 2 1
c add Berkeley copyright notice
e
s 00274/00000/00000
d D 5.1 90/04/28 16:28:33 bostic 1 0
c date and time created 90/04/28 16:28:33 by bostic
e
u
U
t
T
I 1
D 2
.\" Copyright (c) 1988 The Regents of the University of California.
E 2
I 2
D 4
.\" Copyright (c) 1990 The Regents of the University of California.
E 4
I 4
D 5
.\" Copyright (c) 1990, 1991 The Regents of the University of California.
E 4
E 2
.\" All rights reserved.
E 5
I 5
.\" Copyright (c) 1990, 1991, 1993
.\"	The Regents of the University of California.  All rights reserved.
E 5
.\"
D 2
.\" Redistribution and use in source and binary forms are permitted
.\" provided that the above copyright notice and this paragraph are
.\" duplicated in all such forms and that any documentation,
.\" advertising materials, and other materials related to such
.\" distribution and use acknowledge that the software was developed
.\" by the University of California, Berkeley.  The name of the
.\" University may not be used to endorse or promote products derived
.\" from this software without specific prior written permission.
.\" THIS SOFTWARE IS PROVIDED ``AS IS'' AND WITHOUT ANY EXPRESS OR
.\" IMPLIED WARRANTIES, INCLUDING, WITHOUT LIMITATION, THE IMPLIED
.\" WARRANTIES OF MERCHANTIBILITY AND FITNESS FOR A PARTICULAR PURPOSE.
E 2
I 2
.\" This code is derived from software contributed to Berkeley by
.\" Van Jacobson.
E 2
.\"
D 2
.\"	$Header: traceroute.8,v 1.1 89/02/28 20:46:12 van Exp $
E 2
I 2
.\" %sccs.include.redist.man%
E 2
.\"
D 2
.TH TRACEROUTE 8 "February 28, 1989"
E 2
I 2
D 4
.\"	%W% (Berkeley) %G%
E 4
I 4
.\"     %W% (Berkeley) %G%
E 4
.\"
D 4
.TH TRACEROUTE 8 "%Q%"
E 2
.UC 6
.SH NAME
traceroute \- print the route packets take to network host
.SH SYNOPSIS
.B traceroute
[
.B \-m
max_ttl
] [
.B \-n
] [
.B \-p
port
] [
.B \-q
nqueries
] [
.B \-r
] [
.B \-s
src_addr
] [
.B \-t
tos
] [
.B \-w
] [
.B \-w
waittime
]
.I host
[
.I packetsize
]
.SH DESCRIPTION
E 4
I 4
.Dd %Q%
.Dt TRACEROUTE 8
.Os BSD 4.3
.Sh NAME
.Nm traceroute
.Nd print the route packets take to network host
.Sh SYNOPSIS
.Nm traceroute
.Op Fl m Ar max_ttl
.Op Fl n
.Op Fl p Ar port
.Op Fl q Ar nqueries
.Op Fl r
.Bk -words
.Op Fl s Ar src_addr
.Ek
.Op Fl t Ar tos
.Op Fl w Ar waittime
.Ar host
.Op Ar packetsize
.Sh DESCRIPTION
E 4
The Internet is a large and complex aggregation of
network hardware, connected together by gateways.
Tracking the route one's packets follow (or finding the miscreant
gateway that's discarding your packets) can be difficult.
D 4
.I Traceroute
E 4
I 4
.Nm Traceroute
E 4
utilizes the IP protocol `time to live' field and attempts to elicit an
D 4
ICMP TIME_EXCEEDED response from each gateway along the path to some
E 4
I 4
.Tn ICMP
.Dv TIME_EXCEEDED
response from each gateway along the path to some
E 4
host.
D 4

E 4
I 4
.Pp
E 4
The only mandatory parameter is the destination host name or IP number.
The default probe datagram length is 38 bytes, but this may be increased
by specifying a packet size (in bytes) after the destination host
name.
D 4

E 4
I 4
.Pp
E 4
Other options are:
D 4
.TP
.B \-m
E 4
I 4
.Bl -tag -width Ds
.It Fl m Ar max_ttl
E 4
Set the max time-to-live (max number of hops) used in outgoing probe
D 4
packets.  The default is 30 hops (the same default used for TCP
E 4
I 4
packets.  The default is 30 hops (the same default used for
.Tn TCP
E 4
connections).
D 4
.TP
.B \-n
E 4
I 4
.It Fl n
E 4
Print hop addresses numerically rather than symbolically and numerically
(saves a nameserver address-to-name lookup for each gateway found on the
path).
D 4
.TP
.B \-p
Set the base UDP port number used in probes (default is 33434).
Traceroute hopes that nothing is listening on UDP ports
.I base
E 4
I 4
.It Fl p Ar port
Set the base
.Tn UDP
.Ar port
number used in probes (default is 33434).
.Nm Traceroute
hopes that nothing is listening on
.Tn UDP
ports
.Em base
E 4
to
D 4
.I base+nhops-1
at the destination host (so an ICMP PORT_UNREACHABLE message will
E 4
I 4
.Em base+nhops-1
at the destination host (so an
.Tn ICMP
.Dv PORT_UNREACHABLE
message will
E 4
be returned to terminate the route tracing).  If something is
listening on a port in the default range, this option can be used
to pick an unused port range.
D 4
.TP
.B \-r
E 4
I 4
.It Fl q Ar nqueries
Set the number of probes per ``ttl'' to
.Ar nqueries
(default is three probes).
.It Fl r
E 4
Bypass the normal routing tables and send directly to a host on an attached
network.
If the host is not on a directly-attached network,
an error is returned.
This option can be used to ping a local host through an interface
that has no route through it (e.g., after the interface was dropped by
D 4
.IR routed (8C)).
.TP
.B \-s
Use the following IP address (which must be given as an IP number, not
E 4
I 4
.Xr routed 8 ) .
.It Fl s Ar src_addr
Use the following IP address
(which must be given as an IP number, not
E 4
a hostname) as the source address in outgoing probe packets.  On
hosts with more than one IP address, this option can be used to
force the source address to be something other than the IP address
of the interface the probe packet is sent on.  If the IP address
is not one of this machine's interface addresses, an error is
returned and nothing is sent.
I 6
.ne 1i
E 6
D 4
.TP
.B \-t
E 4
I 4
.It Fl t Ar tos
E 4
Set the
D 4
.I type-of-service
in probe packets to the following value (default zero).  The value must be 
E 4
I 4
.Em type-of-service
in probe packets to the following value (default zero).  The value must be
E 4
a decimal integer in the range 0 to 255.  This option can be used to
see if different types-of-service result in different paths.  (If you
D 4
are not running 4.4bsd, this may be academic since the normal network
services like telnet and ftp don't let you control the TOS).
Not all values of TOS are legal or
E 4
I 4
are not running a
.Bx 4.3 tahoe
or later system, this may be academic since the normal network
services like telnet and ftp don't let you control the
.Dv TOS ) .
Not all values of
.Dv TOS
are legal or
E 4
meaningful \- see the IP spec for definitions.  Useful values are
D 4
probably `-t 16' (low delay) and `-t 8' (high throughput).
.TP
.B \-v
Verbose output.  Received ICMP packets other than TIME_EXCEEDED and
UNREACHABLEs are listed.
.TP
.B \-w
E 4
I 4
probably
.Ql \-t 16
(low delay) and
.Ql \-t 8
(high throughput).
.It Fl v
Verbose output.  Received
.Tn ICMP
packets other than
.Dv TIME_EXCEEDED
and
.Dv UNREACHABLE Ns s
are listed.
.It Fl w
E 4
Set the time (in seconds) to wait for a response to a probe (default 3
sec.).
D 4
.PP
E 4
I 4
.El
.Pp
E 4
This program attempts to trace the route an IP packet would follow to some
D 4
internet host by launching UDP probe
E 4
I 4
internet host by launching
.Tn UDP
probe
E 4
packets with a small ttl (time to live) then listening for an
D 4
ICMP "time exceeded" reply from a gateway.  We start our probes
with a ttl of one and increase by one until we get an ICMP "port
unreachable" (which means we got to "host") or hit a max (which
defaults to 30 hops & can be changed with the \-m flag).  Three
probes (change with \-q flag) are sent at each ttl setting and a
E 4
I 4
.Tn ICMP
"time exceeded" reply from a gateway.  We start our probes
with a ttl of one and increase by one until we get an
.Tn ICMP
"port unreachable"
(which means we got to "host") or hit a max (which
defaults to 30 hops & can be changed with the
.Fl m
flag).  Three
probes (changed with
.Fl q
flag) are sent at each ttl setting and a
E 4
line is printed showing the ttl, address of the gateway and
round trip time of each probe.  If the probe answers come from
different gateways, the address of each responding system will
be printed.  If there is no response within a 3 sec. timeout
D 4
interval (changed with the \-w flag), a "*" is printed for that
E 4
I 4
interval (changed with the
.Fl w
flag), a "*" is printed for that
E 4
probe.
D 4
.PP
E 4
I 4
.Pp
E 4
We don't want the destination
D 4
host to process the UDP probe packets so the destination port is set to an
E 4
I 4
host to process the
.Tn UDP
probe packets so the destination port is set to an
E 4
unlikely value (if some clod on the destination is using that
D 4
value, it can be changed with the \-p flag).
.PP
E 4
I 4
value, it can be changed with the
.Fl p
flag).
.Pp
E 4
A sample use and output might be:
D 4

.RS
.nf
E 4
I 4
.Bd -literal
E 4
[yak 71]% traceroute nis.nsf.net.
traceroute to nis.nsf.net (35.1.1.48), 30 hops max, 56 byte packet
D 4
 1  helios.ee.lbl.gov (128.3.112.1)  19 ms  19 ms  0 ms
 2  lilac-dmc.Berkeley.EDU (128.32.216.1)  39 ms  39 ms  19 ms
 3  lilac-dmc.Berkeley.EDU (128.32.216.1)  39 ms  39 ms  19 ms
 4  ccngw-ner-cc.Berkeley.EDU (128.32.136.23)  39 ms  40 ms  39 ms
 5  ccn-nerif22.Berkeley.EDU (128.32.168.22)  39 ms  39 ms  39 ms
 6  128.32.197.4 (128.32.197.4)  40 ms  59 ms  59 ms
 7  131.119.2.5 (131.119.2.5)  59 ms  59 ms  59 ms
 8  129.140.70.13 (129.140.70.13)  99 ms  99 ms  80 ms
 9  129.140.71.6 (129.140.71.6)  139 ms  239 ms  319 ms
E 4
I 4
1  helios.ee.lbl.gov (128.3.112.1)  19 ms  19 ms  0 ms
2  lilac-dmc.Berkeley.EDU (128.32.216.1)  39 ms  39 ms  19 ms
3  lilac-dmc.Berkeley.EDU (128.32.216.1)  39 ms  39 ms  19 ms
4  ccngw-ner-cc.Berkeley.EDU (128.32.136.23)  39 ms  40 ms  39 ms
5  ccn-nerif22.Berkeley.EDU (128.32.168.22)  39 ms  39 ms  39 ms
6  128.32.197.4 (128.32.197.4)  40 ms  59 ms  59 ms
7  131.119.2.5 (131.119.2.5)  59 ms  59 ms  59 ms
8  129.140.70.13 (129.140.70.13)  99 ms  99 ms  80 ms
9  129.140.71.6 (129.140.71.6)  139 ms  239 ms  319 ms
E 4
10  129.140.81.7 (129.140.81.7)  220 ms  199 ms  199 ms
11  nic.merit.edu (35.1.1.48)  239 ms  239 ms  239 ms
D 4
.fi
.RE
E 4

I 4
.Ed
E 4
Note that lines 2 & 3 are the same.  This is due to a buggy
kernel on the 2nd hop system \- lbl-csam.arpa \- that forwards
packets with a zero ttl (a bug in the distributed version
D 4
of 4.3BSD).  Note that you have to guess what path
the packets are taking cross-country since the NSFNet (129.140)
doesn't supply address-to-name translations for its NSSes.
.PP
E 4
I 4
of 4.3
.Tn BSD ) .
Note that you have to guess what path
the packets are taking cross-country since the
.Tn NSFNet
(129.140)
doesn't supply address-to-name translations for its
.Tn NSS Ns es .
.Pp
E 4
A more interesting example is:
D 4

.RS
.nf
E 4
I 4
.Bd -literal
E 4
[yak 72]% traceroute allspice.lcs.mit.edu.
traceroute to allspice.lcs.mit.edu (18.26.0.115), 30 hops max
D 4
 1  helios.ee.lbl.gov (128.3.112.1)  0 ms  0 ms  0 ms
 2  lilac-dmc.Berkeley.EDU (128.32.216.1)  19 ms  19 ms  19 ms
 3  lilac-dmc.Berkeley.EDU (128.32.216.1)  39 ms  19 ms  19 ms
 4  ccngw-ner-cc.Berkeley.EDU (128.32.136.23)  19 ms  39 ms  39 ms
 5  ccn-nerif22.Berkeley.EDU (128.32.168.22)  20 ms  39 ms  39 ms
 6  128.32.197.4 (128.32.197.4)  59 ms  119 ms  39 ms
 7  131.119.2.5 (131.119.2.5)  59 ms  59 ms  39 ms
 8  129.140.70.13 (129.140.70.13)  80 ms  79 ms  99 ms
 9  129.140.71.6 (129.140.71.6)  139 ms  139 ms  159 ms
E 4
I 4
1  helios.ee.lbl.gov (128.3.112.1)  0 ms  0 ms  0 ms
2  lilac-dmc.Berkeley.EDU (128.32.216.1)  19 ms  19 ms  19 ms
3  lilac-dmc.Berkeley.EDU (128.32.216.1)  39 ms  19 ms  19 ms
4  ccngw-ner-cc.Berkeley.EDU (128.32.136.23)  19 ms  39 ms  39 ms
5  ccn-nerif22.Berkeley.EDU (128.32.168.22)  20 ms  39 ms  39 ms
6  128.32.197.4 (128.32.197.4)  59 ms  119 ms  39 ms
7  131.119.2.5 (131.119.2.5)  59 ms  59 ms  39 ms
8  129.140.70.13 (129.140.70.13)  80 ms  79 ms  99 ms
9  129.140.71.6 (129.140.71.6)  139 ms  139 ms  159 ms
E 4
10  129.140.81.7 (129.140.81.7)  199 ms  180 ms  300 ms
11  129.140.72.17 (129.140.72.17)  300 ms  239 ms  239 ms
12  * * *
13  128.121.54.72 (128.121.54.72)  259 ms  499 ms  279 ms
14  * * *
15  * * *
16  * * *
17  * * *
18  ALLSPICE.LCS.MIT.EDU (18.26.0.115)  339 ms  279 ms  279 ms
D 4
.fi
.RE
E 4

I 4
.Ed
E 4
Note that the gateways 12, 14, 15, 16 & 17 hops away
D 4
either don't send ICMP "time exceeded" messages or send them
E 4
I 4
either don't send
.Tn ICMP
"time exceeded" messages or send them
E 4
with a ttl too small to reach us.  14 \- 17 are running the
D 4
MIT C Gateway code that doesn't send "time exceeded"s.  God
E 4
I 4
.Tn MIT
C Gateway code that doesn't send "time exceeded"s.  God
E 4
only knows what's going on with 12.
D 4
.PP
E 4
I 4
.Pp
E 4
The silent gateway 12 in the above may be the result of a bug in
D 4
the 4.[23]BSD network code (and its derivatives):  4.x (x <= 3)
E 4
I 4
the 4.[23]
.Tn BSD
network code (and its derivatives):  4.x (x <= 3)
E 4
sends an unreachable message using whatever ttl remains in the
original datagram.  Since, for gateways, the remaining ttl is
D 4
zero, the ICMP "time exceeded" is guaranteed to not make it back
E 4
I 4
zero, the
.Tn ICMP
"time exceeded" is guaranteed to not make it back
E 4
to us.  The behavior of this bug is slightly more interesting
when it appears on the destination system:
D 4

.RS
.nf
 1  helios.ee.lbl.gov (128.3.112.1)  0 ms  0 ms  0 ms
 2  lilac-dmc.Berkeley.EDU (128.32.216.1)  39 ms  19 ms  39 ms
 3  lilac-dmc.Berkeley.EDU (128.32.216.1)  19 ms  39 ms  19 ms
 4  ccngw-ner-cc.Berkeley.EDU (128.32.136.23)  39 ms  40 ms  19 ms
 5  ccn-nerif35.Berkeley.EDU (128.32.168.35)  39 ms  39 ms  39 ms
 6  csgw.Berkeley.EDU (128.32.133.254)  39 ms  59 ms  39 ms
 7  * * *
 8  * * *
 9  * * *
E 4
I 4
.Bd -literal
1  helios.ee.lbl.gov (128.3.112.1)  0 ms  0 ms  0 ms
2  lilac-dmc.Berkeley.EDU (128.32.216.1)  39 ms  19 ms  39 ms
3  lilac-dmc.Berkeley.EDU (128.32.216.1)  19 ms  39 ms  19 ms
4  ccngw-ner-cc.Berkeley.EDU (128.32.136.23)  39 ms  40 ms  19 ms
5  ccn-nerif35.Berkeley.EDU (128.32.168.35)  39 ms  39 ms  39 ms
6  csgw.Berkeley.EDU (128.32.133.254)  39 ms  59 ms  39 ms
7  * * *
8  * * *
9  * * *
E 4
10  * * *
11  * * *
12  * * *
13  rip.Berkeley.EDU (128.32.131.22)  59 ms !  39 ms !  39 ms !
D 4
.fi
.RE
E 4

I 4
.Ed
E 4
Notice that there are 12 "gateways" (13 is the final
destination) and exactly the last half of them are "missing".
What's really happening is that rip (a Sun-3 running Sun OS3.5)
is using the ttl from our arriving datagram as the ttl in its
D 4
ICMP reply.  So, the reply will time out on the return path
(with no notice sent to anyone since ICMP's aren't sent for
ICMP's) until we probe with a ttl that's at least twice the path
E 4
I 4
.Tn ICMP
reply.  So, the reply will time out on the return path
(with no notice sent to anyone since
.Tn ICMP's
aren't sent for
.Tn ICMP's )
until we probe with a ttl that's at least twice the path
E 4
length.  I.e., rip is really only 7 hops away.  A reply that
returns with a ttl of 1 is a clue this problem exists.
D 4
Traceroute prints a "!" after the time if the ttl is <= 1.
Since vendors ship a lot of obsolete (DEC's Ultrix, Sun 3.x) or
non-standard (HPUX) software, expect to see this problem
E 4
I 4
.Nm Traceroute
prints a "!" after the time if the ttl is <= 1.
Since vendors ship a lot of obsolete
.Pf ( Tn DEC Ns \'s
Ultrix, Sun 3.x) or
non-standard
.Pq Tn HPUX
software, expect to see this problem
E 4
frequently and/or take care picking the target host of your
probes.
D 4

E 4
Other possible annotations after the time are
D 4
.BR !H ,
.BR !N ,
.B !P
E 4
I 4
.Sy !H ,
.Sy !N ,
.Sy !P
E 4
(got a host, network or protocol unreachable, respectively),
D 4
.B !S
E 4
I 4
.Sy !S
E 4
or
D 4
.B !F
E 4
I 4
.Sy !F
E 4
(source route failed or fragmentation needed \- neither of these should
ever occur and the associated gateway is busted if you see one).  If
D 4
almost all the probes result in some kind of unreachable, traceroute
E 4
I 4
almost all the probes result in some kind of unreachable,
.Nm traceroute
E 4
will give up and exit.
D 4
.PP
E 4
I 4
.Pp
E 4
This program is intended for use in network testing, measurement
and management.
It should be used primarily for manual fault isolation.
Because of the load it could impose on the network, it is unwise to use
D 4
.I traceroute
E 4
I 4
.Nm traceroute
E 4
during normal operations or from automated scripts.
D 4
.SH AUTHOR
E 4
I 4
.Sh AUTHOR
E 4
Implemented by Van Jacobson from a suggestion by Steve Deering.  Debugged
by a cast of thousands with particularly cogent suggestions or fixes from
C. Philip Wood, Tim Seaver and Ken Adelman.
D 4
.SH SEE ALSO
netstat(1), ping(8)
E 4
I 4
.Sh SEE ALSO
.Xr netstat 1 ,
.Xr ping 8
.Sh HISTORY
The
.Nm
command
.Bt
E 4
E 1
